espressif/esp-idf/components/soc/esp32p4/register/hw_ver1/soc/h264_dma_reg.h
/** H264_DMA_OUTFIFO_STATUS_CH0_REG register
 *  TX CH0 outfifo status register
 */
#define H264_DMA_OUTFIFO_STATUS_CH0_REG (DR_REG_H264_DMA_BASE + 0x14)
/** H264_DMA_OUTFIFO_FULL_L2_CH0 : RO; bitpos: [0]; default: 0;
 *  Tx FIFO full signal for Tx channel 0.
 */
#define H264_DMA_OUTFIFO_FULL_L2_CH0    (BIT(0))
#define H264_DMA_OUTFIFO_FULL_L2_CH0_M  (H264_DMA_OUTFIFO_FULL_L2_CH0_V << H264_DMA_OUTFIFO_FULL_L2_CH0_S)
#define H264_DMA_OUTFIFO_FULL_L2_CH0_V  0x00000001U
#define H264_DMA_OUTFIFO_FULL_L2_CH0_S  0
/** H264_DMA_OUTFIFO_EMPTY_L2_CH0 : RO; bitpos: [1]; default: 1;
 *  Tx FIFO empty signal for Tx channel 0.
 */
#define H264_DMA_OUTFIFO_EMPTY_L2_CH0    (BIT(1))
#define H264_DMA_OUTFIFO_EMPTY_L2_CH0_M  (H264_DMA_OUTFIFO_EMPTY_L2_CH0_V << H264_DMA_OUTFIFO_EMPTY_L2_CH0_S)
#define H264_DMA_OUTFIFO_EMPTY_L2_CH0_V  0x00000001U
#define H264_DMA_OUTFIFO_EMPTY_L2_CH0_S  1
/** H264_DMA_OUTFIFO_CNT_L2_CH0 : RO; bitpos: [5:2]; default: 0;
 *  The register stores the byte number of the data in Tx FIFO for Tx channel 0.
 */
#define H264_DMA_OUTFIFO_CNT_L2_CH0    0x0000000FU
#define H264_DMA_OUTFIFO_CNT_L2_CH0_M  (H264_DMA_OUTFIFO_CNT_L2_CH0_V << H264_DMA_OUTFIFO_CNT_L2_CH0_S)
#define H264_DMA_OUTFIFO_CNT_L2_CH0_V  0x0000000FU
#define H264_DMA_OUTFIFO_CNT_L2_CH0_S  2
/** H264_DMA_OUTFIFO_FULL_L1_CH0 : RO; bitpos: [6]; default: 0;
 *  Tx FIFO full signal for Tx channel 0.
 */
#define H264_DMA_OUTFIFO_FULL_L1_CH0    (BIT(6))
#define H264_DMA_OUTFIFO_FULL_L1_CH0_M  (H264_DMA_OUTFIFO_FULL_L1_CH0_V << H264_DMA_OUTFIFO_FULL_L1_CH0_S)
#define H264_DMA_OUTFIFO_FULL_L1_CH0_V  0x00000001U
#define H264_DMA_OUTFIFO_FULL_L1_CH0_S  6
/** H264_DMA_OUTFIFO_EMPTY_L1_CH0 : RO; bitpos: [7]; default: 1;
 *  Tx FIFO empty signal for Tx channel 0.
 */
#define H264_DMA_OUTFIFO_EMPTY_L1_CH0    (BIT(7))
#define H264_DMA_OUTFIFO_EMPTY_L1_CH0_M  (H264_DMA_OUTFIFO_EMPTY_L1_CH0_V << H264_DMA_OUTFIFO_EMPTY_L1_CH0_S)
#define H264_DMA_OUTFIFO_EMPTY_L1_CH0_V  0x00000001U
#define H264_DMA_OUTFIFO_EMPTY_L1_CH0_S  7
/** H264_DMA_OUTFIFO_CNT_L1_CH0 : RO; bitpos: [12:8]; default: 0;
 *  The register stores the byte number of the data in Tx FIFO for Tx channel 0.
 */
#define H264_DMA_OUTFIFO_CNT_L1_CH0    0x0000001FU
#define H264_DMA_OUTFIFO_CNT_L1_CH0_M  (H264_DMA_OUTFIFO_CNT_L1_CH0_V << H264_DMA_OUTFIFO_CNT_L1_CH0_S)
#define H264_DMA_OUTFIFO_CNT_L1_CH0_V  0x0000001FU
#define H264_DMA_OUTFIFO_CNT_L1_CH0_S  8
/** H264_DMA_OUTFIFO_FULL_L3_CH0 : RO; bitpos: [16]; default: 0;
 *  Tx FIFO full signal for Tx channel 0.
 */
#define H264_DMA_OUTFIFO_FULL_L3_CH0    (BIT(16))
#define H264_DMA_OUTFIFO_FULL_L3_CH0_M  (H264_DMA_OUTFIFO_FULL_L3_CH0_V << H264_DMA_OUTFIFO_FULL_L3_CH0_S)
#define H264_DMA_OUTFIFO_FULL_L3_CH0_V  0x00000001U
#define H264_DMA_OUTFIFO_FULL_L3_CH0_S  16
/** H264_DMA_OUTFIFO_EMPTY_L3_CH0 : RO; bitpos: [17]; default: 1;
 *  Tx FIFO empty signal for Tx channel 0.
 */
#define H264_DMA_OUTFIFO_EMPTY_L3_CH0    (BIT(17))
#define H264_DMA_OUTFIFO_EMPTY_L3_CH0_M  (H264_DMA_OUTFIFO_EMPTY_L3_CH0_V << H264_DMA_OUTFIFO_EMPTY_L3_CH0_S)
#define H264_DMA_OUTFIFO_EMPTY_L3_CH0_V  0x00000001U
#define H264_DMA_OUTFIFO_EMPTY_L3_CH0_S  17
/** H264_DMA_OUTFIFO_CNT_L3_CH0 : RO; bitpos: [19:18]; default: 0;
 *  The register stores the 8byte number of the data in Tx FIFO for Tx channel 0.
 */
#define H264_DMA_OUTFIFO_CNT_L3_CH0    0x00000003U
#define H264_DMA_OUTFIFO_CNT_L3_CH0_M  (H264_DMA_OUTFIFO_CNT_L3_CH0_V << H264_DMA_OUTFIFO_CNT_L3_CH0_S)
#define H264_DMA_OUTFIFO_CNT_L3_CH0_V  0x00000003U
#define H264_DMA_OUTFIFO_CNT_L3_CH0_S  18

/** H264_DMA_OUT_PUSH_CH0_REG register
 *  TX CH0 outfifo push register
 */
#define H264_DMA_OUT_PUSH_CH0_REG (DR_REG_H264_DMA_BASE + 0x18)
/** H264_DMA_OUTFIFO_WDATA_CH0 : R/W; bitpos: [9:0]; default: 0;
 *  This register stores the data that need to be pushed into DMA Tx FIFO.
 */
#define H264_DMA_OUTFIFO_WDATA_CH0    0x000003FFU
#define H264_DMA_OUTFIFO_WDATA_CH0_M  (H264_DMA_OUTFIFO_WDATA_CH0_V << H264_DMA_OUTFIFO_WDATA_CH0_S)
#define H264_DMA_OUTFIFO_WDATA_CH0_V  0x000003FFU
#define H264_DMA_OUTFIFO_WDATA_CH0_S  0
/** H264_DMA_OUTFIFO_PUSH_CH0 : R/W/SC; bitpos: [10]; default: 0;
 *  Set this bit to push data into DMA Tx FIFO.
 */
#define H264_DMA_OUTFIFO_PUSH_CH0    (BIT(10))
#define H264_DMA_OUTFIFO_PUSH_CH0_M  (H264_DMA_OUTFIFO_PUSH_CH0_V << H264_DMA_OUTFIFO_PUSH_CH0_S)
#define H264_DMA_OUTFIFO_PUSH_CH0_V  0x00000001U
#define H264_DMA_OUTFIFO_PUSH_CH0_S  10

/** H264_DMA_OUT_LINK_CONF_CH0_REG register
 *  TX CH0 out_link dscr ctrl register
 */
#define H264_DMA_OUT_LINK_CONF_CH0_REG (DR_REG_H264_DMA_BASE + 0x1c)
/** H264_DMA_OUTLINK_STOP_CH0 : R/W/SC; bitpos: [20]; default: 0;
 *  Set this bit to stop dealing with the outlink descriptors.
 */
#define H264_DMA_OUTLINK_STOP_CH0    (BIT(20))
#define H264_DMA_OUTLINK_STOP_CH0_M  (H264_DMA_OUTLINK_STOP_CH0_V << H264_DMA_OUTLINK_STOP_CH0_S)
#define H264_DMA_OUTLINK_STOP_CH0_V  0x00000001U
#define H264_DMA_OUTLINK_STOP_CH0_S  20
/** H264_DMA_OUTLINK_START_CH0 : R/W/SC; bitpos: [21]; default: 0;
 *  Set this bit to start dealing with the outlink descriptors.
 */
#define H264_DMA_OUTLINK_START_CH0    (BIT(21))
#define H264_DMA_OUTLINK_START_CH0_M  (H264_DMA_OUTLINK_START_CH0_V << H264_DMA_OUTLINK_START_CH0_S)
#define H264_DMA_OUTLINK_START_CH0_V  0x00000001U
#define H264_DMA_OUTLINK_START_CH0_S  21
/** H264_DMA_OUTLINK_RESTART_CH0 : R/W/SC; bitpos: [22]; default: 0;
 *  Set this bit to restart a new outlink from the last address.
 */
#define H264_DMA_OUTLINK_RESTART_CH0    (BIT(22))
#define H264_DMA_OUTLINK_RESTART_CH0_M  (H264_DMA_OUTLINK_RESTART_CH0_V << H264_DMA_OUTLINK_RESTART_CH0_S)
#define H264_DMA_OUTLINK_RESTART_CH0_V  0x00000001U
#define H264_DMA_OUTLINK_RESTART_CH0_S  22
/** H264_DMA_OUTLINK_PARK_CH0 : RO; bitpos: [23]; default: 1;
 *  1: the outlink descriptor's FSM is in idle state.  0: the outlink descriptor's FSM
 *  is working.
 */
#define H264_DMA_OUTLINK_PARK_CH0    (BIT(23))
#define H264_DMA_OUTLINK_PARK_CH0_M  (H264_DMA_OUTLINK_PARK_CH0_V << H264_DMA_OUTLINK_PARK_CH0_S)
#define H264_DMA_OUTLINK_PARK_CH0_V  0x00000001U
#define H264_DMA_OUTLINK_PARK_CH0_S  23

/** H264_DMA_OUT_LINK_ADDR_CH0_REG register
 *  TX CH0 out_link dscr addr register
 */
#define H264_DMA_OUT_LINK_ADDR_CH0_REG (DR_REG_H264_DMA_BASE + 0x20)
/** H264_DMA_OUTLINK_ADDR_CH0 : R/W; bitpos: [31:0]; default: 0;
 *  This register stores the first outlink descriptor's address.
 */
#define H264_DMA_OUTLINK_ADDR_CH0    0xFFFFFFFFU
#define H264_DMA_OUTLINK_ADDR_CH0_M  (H264_DMA_OUTLINK_ADDR_CH0_V << H264_DMA_OUTLINK_ADDR_CH0_S)
#define H264_DMA_OUTLINK_ADDR_CH0_V  0xFFFFFFFFU
#define H264_DMA_OUTLINK_ADDR_CH0_S  0

/** H264_DMA_OUT_STATE_CH0_REG register
 *  TX CH0 state register
 */
#define H264_DMA_OUT_STATE_CH0_REG (DR_REG_H264_DMA_BASE + 0x24)
/** H264_DMA_OUTLINK_DSCR_ADDR_CH0 : RO; bitpos: [17:0]; default: 0;
 *  This register stores the current outlink descriptor's address.
 */
#define H264_DMA_OUTLINK_DSCR_ADDR_CH0    0x0003FFFFU
#define H264_DMA_OUTLINK_DSCR_ADDR_CH0_M  (H264_DMA_OUTLINK_DSCR_ADDR_CH0_V << H264_DMA_OUTLINK_DSCR_ADDR_CH0_S)
#define H264_DMA_OUTLINK_DSCR_ADDR_CH0_V  0x0003FFFFU
#define H264_DMA_OUTLINK_DSCR_ADDR_CH0_S  0
/** H264_DMA_OUT_DSCR_STATE_CH0 : RO; bitpos: [19:18]; default: 0;
 *  This register stores the current descriptor state machine state.
 */
#define H264_DMA_OUT_DSCR_STATE_CH0    0x00000003U
#define H264_DMA_OUT_DSCR_STATE_CH0_M  (H264_DMA_OUT_DSCR_STATE_CH0_V << H264_DMA_OUT_DSCR_STATE_CH0_S)
#define H264_DMA_OUT_DSCR_STATE_CH0_V  0x00000003U
#define H264_DMA_OUT_DSCR_STATE_CH0_S  18
/** H264_DMA_OUT_STATE_CH0 : RO; bitpos: [23:20]; default: 0;
 *  This register stores the current control module state machine state.
 */
#define H264_DMA_OUT_STATE_CH0    0x0000000FU
#define H264_DMA_OUT_STATE_CH0_M  (H264_DMA_OUT_STATE_CH0_V << H264_DMA_OUT_STATE_CH0_S)
#define H264_DMA_OUT_STATE_CH0_V  0x0000000FU
#define H264_DMA_OUT_STATE_CH0_S  20
/** H264_DMA_OUT_RESET_AVAIL_CH0 : RO; bitpos: [24]; default: 1;
 *  This register indicate that if the channel reset is safety.
 */
#define H264_DMA_OUT_RESET_AVAIL_CH0    (BIT(24))
#define H264_DMA_OUT_RESET_AVAIL_CH0_M  (H264_DMA_OUT_RESET_AVAIL_CH0_V << H264_DMA_OUT_RESET_AVAIL_CH0_S)
#define H264_DMA_OUT_RESET_AVAIL_CH0_V  0x00000001U
#define H264_DMA_OUT_RESET_AVAIL_CH0_S  24

/** H264_DMA_OUT_EOF_DES_ADDR_CH0_REG register
 *  TX CH0 eof des addr register
 */
#define H264_DMA_OUT_EOF_DES_ADDR_CH0_REG (DR_REG_H264_DMA_BASE + 0x28)
/** H264_DMA_OUT_EOF_DES_ADDR_CH0 : RO; bitpos: [31:0]; default: 0;
 *  This register stores the address of the outlink descriptor when the EOF bit in this
 *  descriptor is 1.
 */
#define H264_DMA_OUT_EOF_DES_ADDR_CH0    0xFFFFFFFFU
#define H264_DMA_OUT_EOF_DES_ADDR_CH0_M  (H264_DMA_OUT_EOF_DES_ADDR_CH0_V << H264_DMA_OUT_EOF_DES_ADDR_CH0_S)
#define H264_DMA_OUT_EOF_DES_ADDR_CH0_V  0xFFFFFFFFU
#define H264_DMA_OUT_EOF_DES_ADDR_CH0_S  0

/** H264_DMA_OUT_DSCR_CH0_REG register
 *  TX CH0 next dscr addr register
 */
#define H264_DMA_OUT_DSCR_CH0_REG (DR_REG_H264_DMA_BASE + 0x2c)
/** H264_DMA_OUTLINK_DSCR_CH0 : RO; bitpos: [31:0]; default: 0;
 *  The address of the next outlink descriptor address y.
 */
#define H264_DMA_OUTLINK_DSCR_CH0    0xFFFFFFFFU
#define H264_DMA_OUTLINK_DSCR_CH0_M  (H264_DMA_OUTLINK_DSCR_CH0_V << H264_DMA_OUTLINK_DSCR_CH0_S)
#define H264_DMA_OUTLINK_DSCR_CH0_V  0xFFFFFFFFU
#define H264_DMA_OUTLINK_DSCR_CH0_S  0

/** H264_DMA_OUT_DSCR_BF0_CH0_REG register
 *  TX CH0 last dscr addr register
 */
#define H264_DMA_OUT_DSCR_BF0_CH0_REG (DR_REG_H264_DMA_BASE + 0x30)
/** H264_DMA_OUTLINK_DSCR_BF0_CH0 : RO; bitpos: [31:0]; default: 0;
 *  The address of the last outlink descriptor's next address y-1.
 */
#define H264_DMA_OUTLINK_DSCR_BF0_CH0    0xFFFFFFFFU
#define H264_DMA_OUTLINK_DSCR_BF0_CH0_M  (H264_DMA_OUTLINK_DSCR_BF0_CH0_V << H264_DMA_OUTLINK_DSCR_BF0_CH0_S)
#define H264_DMA_OUTLINK_DSCR_BF0_CH0_V  0xFFFFFFFFU
#define H264_DMA_OUTLINK_DSCR_BF0_CH0_S  0

/** H264_DMA_OUT_DSCR_BF1_CH0_REG register
 *  TX CH0 second-to-last dscr addr register
 */
#define H264_DMA_OUT_DSCR_BF1_CH0_REG (DR_REG_H264_DMA_BASE + 0x34)
/** H264_DMA_OUTLINK_DSCR_BF1_CH0 : RO; bitpos: [31:0]; default: 0;
 *  The address of the second-to-last outlink descriptor's next address y-2.
 */
#define H264_DMA_OUTLINK_DSCR_BF1_CH0    0xFFFFFFFFU
#define H264_DMA_OUTLINK_DSCR_BF1_CH0_M  (H264_DMA_OUTLINK_DSCR_BF1_CH0_V << H264_DMA_OUTLINK_DSCR_BF1_CH0_S)
#define H264_DMA_OUTLINK_DSCR_BF1_CH0_V  0xFFFFFFFFU
#define H264_DMA_OUTLINK_DSCR_BF1_CH0_S  0

