espressif/esp-idf/components/soc/esp32p4/register/hw_ver1/soc/h264_dma_reg.h
/** H264_DMA_OUT_ARB_CH0_REG register
 *  TX CH0 arb register
 */
#define H264_DMA_OUT_ARB_CH0_REG (DR_REG_H264_DMA_BASE + 0x3c)
/** H264_DMA_OUT_ARB_TOKEN_NUM_CH0 : R/W; bitpos: [3:0]; default: 1;
 *  Set the max number of token count of arbiter
 */
#define H264_DMA_OUT_ARB_TOKEN_NUM_CH0    0x0000000FU
#define H264_DMA_OUT_ARB_TOKEN_NUM_CH0_M  (H264_DMA_OUT_ARB_TOKEN_NUM_CH0_V << H264_DMA_OUT_ARB_TOKEN_NUM_CH0_S)
#define H264_DMA_OUT_ARB_TOKEN_NUM_CH0_V  0x0000000FU
#define H264_DMA_OUT_ARB_TOKEN_NUM_CH0_S  0
/** H264_DMA_EXTER_OUT_ARB_PRIORITY_CH0 : R/W; bitpos: [5:4]; default: 1;
 *  Set the priority of channel
 */
#define H264_DMA_EXTER_OUT_ARB_PRIORITY_CH0    0x00000003U
#define H264_DMA_EXTER_OUT_ARB_PRIORITY_CH0_M  (H264_DMA_EXTER_OUT_ARB_PRIORITY_CH0_V << H264_DMA_EXTER_OUT_ARB_PRIORITY_CH0_S)
#define H264_DMA_EXTER_OUT_ARB_PRIORITY_CH0_V  0x00000003U
#define H264_DMA_EXTER_OUT_ARB_PRIORITY_CH0_S  4

/** H264_DMA_OUT_RO_STATUS_CH0_REG register
 *  TX CH0 reorder status register
 */
#define H264_DMA_OUT_RO_STATUS_CH0_REG (DR_REG_H264_DMA_BASE + 0x40)
/** H264_DMA_OUTFIFO_RO_CNT_CH0 : RO; bitpos: [1:0]; default: 0;
 *  The register stores the 8byte number of the data in reorder Tx FIFO for channel 0.
 */
#define H264_DMA_OUTFIFO_RO_CNT_CH0    0x00000003U
#define H264_DMA_OUTFIFO_RO_CNT_CH0_M  (H264_DMA_OUTFIFO_RO_CNT_CH0_V << H264_DMA_OUTFIFO_RO_CNT_CH0_S)
#define H264_DMA_OUTFIFO_RO_CNT_CH0_V  0x00000003U
#define H264_DMA_OUTFIFO_RO_CNT_CH0_S  0
/** H264_DMA_OUT_RO_WR_STATE_CH0 : RO; bitpos: [7:6]; default: 0;
 *  The register stores the state of read ram of reorder
 */
#define H264_DMA_OUT_RO_WR_STATE_CH0    0x00000003U
#define H264_DMA_OUT_RO_WR_STATE_CH0_M  (H264_DMA_OUT_RO_WR_STATE_CH0_V << H264_DMA_OUT_RO_WR_STATE_CH0_S)
#define H264_DMA_OUT_RO_WR_STATE_CH0_V  0x00000003U
#define H264_DMA_OUT_RO_WR_STATE_CH0_S  6
/** H264_DMA_OUT_RO_RD_STATE_CH0 : RO; bitpos: [9:8]; default: 0;
 *  The register stores the state of write ram of reorder
 */
#define H264_DMA_OUT_RO_RD_STATE_CH0    0x00000003U
#define H264_DMA_OUT_RO_RD_STATE_CH0_M  (H264_DMA_OUT_RO_RD_STATE_CH0_V << H264_DMA_OUT_RO_RD_STATE_CH0_S)
#define H264_DMA_OUT_RO_RD_STATE_CH0_V  0x00000003U
#define H264_DMA_OUT_RO_RD_STATE_CH0_S  8
/** H264_DMA_OUT_PIXEL_BYTE_CH0 : RO; bitpos: [13:10]; default: 2;
 *  the number of bytes contained in a pixel at TX channel     0: 1byte     1: 1.5bytes
 *  2 : 2bytes     3: 2.5bytes     4: 3bytes     5: 4bytes
 */
#define H264_DMA_OUT_PIXEL_BYTE_CH0    0x0000000FU
#define H264_DMA_OUT_PIXEL_BYTE_CH0_M  (H264_DMA_OUT_PIXEL_BYTE_CH0_V << H264_DMA_OUT_PIXEL_BYTE_CH0_S)
#define H264_DMA_OUT_PIXEL_BYTE_CH0_V  0x0000000FU
#define H264_DMA_OUT_PIXEL_BYTE_CH0_S  10
/** H264_DMA_OUT_BURST_BLOCK_NUM_CH0 : RO; bitpos: [17:14]; default: 0;
 *  the number of macro blocks contained in a burst of data at TX channel
 */
#define H264_DMA_OUT_BURST_BLOCK_NUM_CH0    0x0000000FU
#define H264_DMA_OUT_BURST_BLOCK_NUM_CH0_M  (H264_DMA_OUT_BURST_BLOCK_NUM_CH0_V << H264_DMA_OUT_BURST_BLOCK_NUM_CH0_S)
#define H264_DMA_OUT_BURST_BLOCK_NUM_CH0_V  0x0000000FU
#define H264_DMA_OUT_BURST_BLOCK_NUM_CH0_S  14

/** H264_DMA_OUT_RO_PD_CONF_CH0_REG register
 *  TX CH0 reorder power config register
 */
#define H264_DMA_OUT_RO_PD_CONF_CH0_REG (DR_REG_H264_DMA_BASE + 0x44)
/** H264_DMA_OUT_RO_RAM_FORCE_PD_CH0 : R/W; bitpos: [4]; default: 0;
 *  dma reorder ram power down
 */
#define H264_DMA_OUT_RO_RAM_FORCE_PD_CH0    (BIT(4))
#define H264_DMA_OUT_RO_RAM_FORCE_PD_CH0_M  (H264_DMA_OUT_RO_RAM_FORCE_PD_CH0_V << H264_DMA_OUT_RO_RAM_FORCE_PD_CH0_S)
#define H264_DMA_OUT_RO_RAM_FORCE_PD_CH0_V  0x00000001U
#define H264_DMA_OUT_RO_RAM_FORCE_PD_CH0_S  4
/** H264_DMA_OUT_RO_RAM_FORCE_PU_CH0 : R/W; bitpos: [5]; default: 1;
 *  dma reorder ram power up
 */
#define H264_DMA_OUT_RO_RAM_FORCE_PU_CH0    (BIT(5))
#define H264_DMA_OUT_RO_RAM_FORCE_PU_CH0_M  (H264_DMA_OUT_RO_RAM_FORCE_PU_CH0_V << H264_DMA_OUT_RO_RAM_FORCE_PU_CH0_S)
#define H264_DMA_OUT_RO_RAM_FORCE_PU_CH0_V  0x00000001U
#define H264_DMA_OUT_RO_RAM_FORCE_PU_CH0_S  5
/** H264_DMA_OUT_RO_RAM_CLK_FO_CH0 : R/W; bitpos: [6]; default: 0;
 *  1: Force to open the clock and bypass the gate-clock when accessing the RAM in DMA.
 *  0: A gate-clock will be used when accessing the RAM in DMA.
 */
#define H264_DMA_OUT_RO_RAM_CLK_FO_CH0    (BIT(6))
#define H264_DMA_OUT_RO_RAM_CLK_FO_CH0_M  (H264_DMA_OUT_RO_RAM_CLK_FO_CH0_V << H264_DMA_OUT_RO_RAM_CLK_FO_CH0_S)
#define H264_DMA_OUT_RO_RAM_CLK_FO_CH0_V  0x00000001U
#define H264_DMA_OUT_RO_RAM_CLK_FO_CH0_S  6

/** H264_DMA_OUT_MODE_ENABLE_CH0_REG register
 *  tx CH0 mode enable register
 */
#define H264_DMA_OUT_MODE_ENABLE_CH0_REG (DR_REG_H264_DMA_BASE + 0x50)
/** H264_DMA_OUT_TEST_MODE_ENABLE_CH0 : R/W; bitpos: [0]; default: 0;
 *  tx CH0 test mode enable.0 : H264_DMA work in normal mode.1 : H264_DMA work in test
 *  mode
 */
#define H264_DMA_OUT_TEST_MODE_ENABLE_CH0    (BIT(0))
#define H264_DMA_OUT_TEST_MODE_ENABLE_CH0_M  (H264_DMA_OUT_TEST_MODE_ENABLE_CH0_V << H264_DMA_OUT_TEST_MODE_ENABLE_CH0_S)
#define H264_DMA_OUT_TEST_MODE_ENABLE_CH0_V  0x00000001U
#define H264_DMA_OUT_TEST_MODE_ENABLE_CH0_S  0

/** H264_DMA_OUT_MODE_YUV_CH0_REG register
 *  tx CH0 test mode yuv value register
 */
#define H264_DMA_OUT_MODE_YUV_CH0_REG (DR_REG_H264_DMA_BASE + 0x54)
/** H264_DMA_OUT_TEST_Y_VALUE_CH0 : R/W; bitpos: [7:0]; default: 0;
 *  tx CH0 test mode y value
 */
#define H264_DMA_OUT_TEST_Y_VALUE_CH0    0x000000FFU
#define H264_DMA_OUT_TEST_Y_VALUE_CH0_M  (H264_DMA_OUT_TEST_Y_VALUE_CH0_V << H264_DMA_OUT_TEST_Y_VALUE_CH0_S)
#define H264_DMA_OUT_TEST_Y_VALUE_CH0_V  0x000000FFU
#define H264_DMA_OUT_TEST_Y_VALUE_CH0_S  0
/** H264_DMA_OUT_TEST_U_VALUE_CH0 : R/W; bitpos: [15:8]; default: 0;
 *  tx CH0 test mode u value
 */
#define H264_DMA_OUT_TEST_U_VALUE_CH0    0x000000FFU
#define H264_DMA_OUT_TEST_U_VALUE_CH0_M  (H264_DMA_OUT_TEST_U_VALUE_CH0_V << H264_DMA_OUT_TEST_U_VALUE_CH0_S)
#define H264_DMA_OUT_TEST_U_VALUE_CH0_V  0x000000FFU
#define H264_DMA_OUT_TEST_U_VALUE_CH0_S  8
/** H264_DMA_OUT_TEST_V_VALUE_CH0 : R/W; bitpos: [23:16]; default: 0;
 *  tx CH0 test mode v value
 */
#define H264_DMA_OUT_TEST_V_VALUE_CH0    0x000000FFU
#define H264_DMA_OUT_TEST_V_VALUE_CH0_M  (H264_DMA_OUT_TEST_V_VALUE_CH0_V << H264_DMA_OUT_TEST_V_VALUE_CH0_S)
#define H264_DMA_OUT_TEST_V_VALUE_CH0_V  0x000000FFU
#define H264_DMA_OUT_TEST_V_VALUE_CH0_S  16

/** H264_DMA_OUT_ETM_CONF_CH0_REG register
 *  TX CH0 ETM config register
 */
#define H264_DMA_OUT_ETM_CONF_CH0_REG (DR_REG_H264_DMA_BASE + 0x68)
/** H264_DMA_OUT_ETM_EN_CH0 : R/W; bitpos: [0]; default: 0;
 *  Set this bit to 1 to enable ETM task function
 */
#define H264_DMA_OUT_ETM_EN_CH0    (BIT(0))
#define H264_DMA_OUT_ETM_EN_CH0_M  (H264_DMA_OUT_ETM_EN_CH0_V << H264_DMA_OUT_ETM_EN_CH0_S)
#define H264_DMA_OUT_ETM_EN_CH0_V  0x00000001U
#define H264_DMA_OUT_ETM_EN_CH0_S  0
/** H264_DMA_OUT_ETM_LOOP_EN_CH0 : R/W; bitpos: [1]; default: 0;
 *  when this bit is 1, dscr can be processed after receiving a task
 */
#define H264_DMA_OUT_ETM_LOOP_EN_CH0    (BIT(1))
#define H264_DMA_OUT_ETM_LOOP_EN_CH0_M  (H264_DMA_OUT_ETM_LOOP_EN_CH0_V << H264_DMA_OUT_ETM_LOOP_EN_CH0_S)
#define H264_DMA_OUT_ETM_LOOP_EN_CH0_V  0x00000001U
#define H264_DMA_OUT_ETM_LOOP_EN_CH0_S  1
/** H264_DMA_OUT_DSCR_TASK_MAK_CH0 : R/W; bitpos: [3:2]; default: 1;
 *  ETM dscr_ready maximum cache numbers
 */
#define H264_DMA_OUT_DSCR_TASK_MAK_CH0    0x00000003U
#define H264_DMA_OUT_DSCR_TASK_MAK_CH0_M  (H264_DMA_OUT_DSCR_TASK_MAK_CH0_V << H264_DMA_OUT_DSCR_TASK_MAK_CH0_S)
#define H264_DMA_OUT_DSCR_TASK_MAK_CH0_V  0x00000003U
#define H264_DMA_OUT_DSCR_TASK_MAK_CH0_S  2

