espressif/esp-idf/components/soc/esp32p4/register/hw_ver1/soc/h264_dma_reg.h
/** H264_DMA_OUT_INT_ST_CH1_REG register
 *  TX CH1  interrupt st register
 */
#define H264_DMA_OUT_INT_ST_CH1_REG (DR_REG_H264_DMA_BASE + 0x10c)
/** H264_DMA_OUT_DONE_CH1_INT_ST : RO; bitpos: [0]; default: 0;
 *  The raw interrupt status bit for the OUT_DONE_CH_INT interrupt.
 */
#define H264_DMA_OUT_DONE_CH1_INT_ST    (BIT(0))
#define H264_DMA_OUT_DONE_CH1_INT_ST_M  (H264_DMA_OUT_DONE_CH1_INT_ST_V << H264_DMA_OUT_DONE_CH1_INT_ST_S)
#define H264_DMA_OUT_DONE_CH1_INT_ST_V  0x00000001U
#define H264_DMA_OUT_DONE_CH1_INT_ST_S  0
/** H264_DMA_OUT_EOF_CH1_INT_ST : RO; bitpos: [1]; default: 0;
 *  The raw interrupt status bit for the OUT_EOF_CH_INT interrupt.
 */
#define H264_DMA_OUT_EOF_CH1_INT_ST    (BIT(1))
#define H264_DMA_OUT_EOF_CH1_INT_ST_M  (H264_DMA_OUT_EOF_CH1_INT_ST_V << H264_DMA_OUT_EOF_CH1_INT_ST_S)
#define H264_DMA_OUT_EOF_CH1_INT_ST_V  0x00000001U
#define H264_DMA_OUT_EOF_CH1_INT_ST_S  1
/** H264_DMA_OUT_DSCR_ERR_CH1_INT_ST : RO; bitpos: [2]; default: 0;
 *  The raw interrupt status bit for the OUT_DSCR_ERR_CH_INT interrupt.
 */
#define H264_DMA_OUT_DSCR_ERR_CH1_INT_ST    (BIT(2))
#define H264_DMA_OUT_DSCR_ERR_CH1_INT_ST_M  (H264_DMA_OUT_DSCR_ERR_CH1_INT_ST_V << H264_DMA_OUT_DSCR_ERR_CH1_INT_ST_S)
#define H264_DMA_OUT_DSCR_ERR_CH1_INT_ST_V  0x00000001U
#define H264_DMA_OUT_DSCR_ERR_CH1_INT_ST_S  2
/** H264_DMA_OUT_TOTAL_EOF_CH1_INT_ST : RO; bitpos: [3]; default: 0;
 *  The raw interrupt status bit for the OUT_TOTAL_EOF_CH_INT interrupt.
 */
#define H264_DMA_OUT_TOTAL_EOF_CH1_INT_ST    (BIT(3))
#define H264_DMA_OUT_TOTAL_EOF_CH1_INT_ST_M  (H264_DMA_OUT_TOTAL_EOF_CH1_INT_ST_V << H264_DMA_OUT_TOTAL_EOF_CH1_INT_ST_S)
#define H264_DMA_OUT_TOTAL_EOF_CH1_INT_ST_V  0x00000001U
#define H264_DMA_OUT_TOTAL_EOF_CH1_INT_ST_S  3
/** H264_DMA_OUTFIFO_OVF_L1_CH1_INT_ST : RO; bitpos: [4]; default: 0;
 *  The raw interrupt status bit for the OUTFIFO_OVF_L1_CH_INT interrupt.
 */
#define H264_DMA_OUTFIFO_OVF_L1_CH1_INT_ST    (BIT(4))
#define H264_DMA_OUTFIFO_OVF_L1_CH1_INT_ST_M  (H264_DMA_OUTFIFO_OVF_L1_CH1_INT_ST_V << H264_DMA_OUTFIFO_OVF_L1_CH1_INT_ST_S)
#define H264_DMA_OUTFIFO_OVF_L1_CH1_INT_ST_V  0x00000001U
#define H264_DMA_OUTFIFO_OVF_L1_CH1_INT_ST_S  4
/** H264_DMA_OUTFIFO_UDF_L1_CH1_INT_ST : RO; bitpos: [5]; default: 0;
 *  The raw interrupt status bit for the OUTFIFO_UDF_L1_CH_INT interrupt.
 */
#define H264_DMA_OUTFIFO_UDF_L1_CH1_INT_ST    (BIT(5))
#define H264_DMA_OUTFIFO_UDF_L1_CH1_INT_ST_M  (H264_DMA_OUTFIFO_UDF_L1_CH1_INT_ST_V << H264_DMA_OUTFIFO_UDF_L1_CH1_INT_ST_S)
#define H264_DMA_OUTFIFO_UDF_L1_CH1_INT_ST_V  0x00000001U
#define H264_DMA_OUTFIFO_UDF_L1_CH1_INT_ST_S  5
/** H264_DMA_OUTFIFO_OVF_L2_CH1_INT_ST : RO; bitpos: [6]; default: 0;
 *  The raw interrupt status bit for the OUTFIFO_OVF_L2_CH_INT interrupt.
 */
#define H264_DMA_OUTFIFO_OVF_L2_CH1_INT_ST    (BIT(6))
#define H264_DMA_OUTFIFO_OVF_L2_CH1_INT_ST_M  (H264_DMA_OUTFIFO_OVF_L2_CH1_INT_ST_V << H264_DMA_OUTFIFO_OVF_L2_CH1_INT_ST_S)
#define H264_DMA_OUTFIFO_OVF_L2_CH1_INT_ST_V  0x00000001U
#define H264_DMA_OUTFIFO_OVF_L2_CH1_INT_ST_S  6
/** H264_DMA_OUTFIFO_UDF_L2_CH1_INT_ST : RO; bitpos: [7]; default: 0;
 *  The raw interrupt status bit for the OUTFIFO_UDF_L2_CH_INT interrupt.
 */
#define H264_DMA_OUTFIFO_UDF_L2_CH1_INT_ST    (BIT(7))
#define H264_DMA_OUTFIFO_UDF_L2_CH1_INT_ST_M  (H264_DMA_OUTFIFO_UDF_L2_CH1_INT_ST_V << H264_DMA_OUTFIFO_UDF_L2_CH1_INT_ST_S)
#define H264_DMA_OUTFIFO_UDF_L2_CH1_INT_ST_V  0x00000001U
#define H264_DMA_OUTFIFO_UDF_L2_CH1_INT_ST_S  7
/** H264_DMA_OUT_DSCR_TASK_OVF_CH1_INT_ST : RO; bitpos: [8]; default: 0;
 *  The raw interrupt status bit for the OUT_DSCR_TASK_OVF_CH_INT interrupt.
 */
#define H264_DMA_OUT_DSCR_TASK_OVF_CH1_INT_ST    (BIT(8))
#define H264_DMA_OUT_DSCR_TASK_OVF_CH1_INT_ST_M  (H264_DMA_OUT_DSCR_TASK_OVF_CH1_INT_ST_V << H264_DMA_OUT_DSCR_TASK_OVF_CH1_INT_ST_S)
#define H264_DMA_OUT_DSCR_TASK_OVF_CH1_INT_ST_V  0x00000001U
#define H264_DMA_OUT_DSCR_TASK_OVF_CH1_INT_ST_S  8

/** H264_DMA_OUT_INT_CLR_CH1_REG register
 *  TX CH1  interrupt clr register
 */
#define H264_DMA_OUT_INT_CLR_CH1_REG (DR_REG_H264_DMA_BASE + 0x110)
/** H264_DMA_OUT_DONE_CH1_INT_CLR : WT; bitpos: [0]; default: 0;
 *  Set this bit to clear the OUT_DONE_CH_INT interrupt.
 */
#define H264_DMA_OUT_DONE_CH1_INT_CLR    (BIT(0))
#define H264_DMA_OUT_DONE_CH1_INT_CLR_M  (H264_DMA_OUT_DONE_CH1_INT_CLR_V << H264_DMA_OUT_DONE_CH1_INT_CLR_S)
#define H264_DMA_OUT_DONE_CH1_INT_CLR_V  0x00000001U
#define H264_DMA_OUT_DONE_CH1_INT_CLR_S  0
/** H264_DMA_OUT_EOF_CH1_INT_CLR : WT; bitpos: [1]; default: 0;
 *  Set this bit to clear the OUT_EOF_CH_INT interrupt.
 */
#define H264_DMA_OUT_EOF_CH1_INT_CLR    (BIT(1))
#define H264_DMA_OUT_EOF_CH1_INT_CLR_M  (H264_DMA_OUT_EOF_CH1_INT_CLR_V << H264_DMA_OUT_EOF_CH1_INT_CLR_S)
#define H264_DMA_OUT_EOF_CH1_INT_CLR_V  0x00000001U
#define H264_DMA_OUT_EOF_CH1_INT_CLR_S  1
/** H264_DMA_OUT_DSCR_ERR_CH1_INT_CLR : WT; bitpos: [2]; default: 0;
 *  Set this bit to clear the OUT_DSCR_ERR_CH_INT interrupt.
 */
#define H264_DMA_OUT_DSCR_ERR_CH1_INT_CLR    (BIT(2))
#define H264_DMA_OUT_DSCR_ERR_CH1_INT_CLR_M  (H264_DMA_OUT_DSCR_ERR_CH1_INT_CLR_V << H264_DMA_OUT_DSCR_ERR_CH1_INT_CLR_S)
#define H264_DMA_OUT_DSCR_ERR_CH1_INT_CLR_V  0x00000001U
#define H264_DMA_OUT_DSCR_ERR_CH1_INT_CLR_S  2
/** H264_DMA_OUT_TOTAL_EOF_CH1_INT_CLR : WT; bitpos: [3]; default: 0;
 *  Set this bit to clear the OUT_TOTAL_EOF_CH_INT interrupt.
 */
#define H264_DMA_OUT_TOTAL_EOF_CH1_INT_CLR    (BIT(3))
#define H264_DMA_OUT_TOTAL_EOF_CH1_INT_CLR_M  (H264_DMA_OUT_TOTAL_EOF_CH1_INT_CLR_V << H264_DMA_OUT_TOTAL_EOF_CH1_INT_CLR_S)
#define H264_DMA_OUT_TOTAL_EOF_CH1_INT_CLR_V  0x00000001U
#define H264_DMA_OUT_TOTAL_EOF_CH1_INT_CLR_S  3
/** H264_DMA_OUTFIFO_OVF_L1_CH1_INT_CLR : WT; bitpos: [4]; default: 0;
 *  Set this bit to clear the OUTFIFO_OVF_L1_CH_INT interrupt.
 */
#define H264_DMA_OUTFIFO_OVF_L1_CH1_INT_CLR    (BIT(4))
#define H264_DMA_OUTFIFO_OVF_L1_CH1_INT_CLR_M  (H264_DMA_OUTFIFO_OVF_L1_CH1_INT_CLR_V << H264_DMA_OUTFIFO_OVF_L1_CH1_INT_CLR_S)
#define H264_DMA_OUTFIFO_OVF_L1_CH1_INT_CLR_V  0x00000001U
#define H264_DMA_OUTFIFO_OVF_L1_CH1_INT_CLR_S  4
/** H264_DMA_OUTFIFO_UDF_L1_CH1_INT_CLR : WT; bitpos: [5]; default: 0;
 *  Set this bit to clear the OUTFIFO_UDF_L1_CH_INT interrupt.
 */
#define H264_DMA_OUTFIFO_UDF_L1_CH1_INT_CLR    (BIT(5))
#define H264_DMA_OUTFIFO_UDF_L1_CH1_INT_CLR_M  (H264_DMA_OUTFIFO_UDF_L1_CH1_INT_CLR_V << H264_DMA_OUTFIFO_UDF_L1_CH1_INT_CLR_S)
#define H264_DMA_OUTFIFO_UDF_L1_CH1_INT_CLR_V  0x00000001U
#define H264_DMA_OUTFIFO_UDF_L1_CH1_INT_CLR_S  5
/** H264_DMA_OUTFIFO_OVF_L2_CH1_INT_CLR : WT; bitpos: [6]; default: 0;
 *  Set this bit to clear the OUTFIFO_OVF_L2_CH_INT interrupt.
 */
#define H264_DMA_OUTFIFO_OVF_L2_CH1_INT_CLR    (BIT(6))
#define H264_DMA_OUTFIFO_OVF_L2_CH1_INT_CLR_M  (H264_DMA_OUTFIFO_OVF_L2_CH1_INT_CLR_V << H264_DMA_OUTFIFO_OVF_L2_CH1_INT_CLR_S)
#define H264_DMA_OUTFIFO_OVF_L2_CH1_INT_CLR_V  0x00000001U
#define H264_DMA_OUTFIFO_OVF_L2_CH1_INT_CLR_S  6
/** H264_DMA_OUTFIFO_UDF_L2_CH1_INT_CLR : WT; bitpos: [7]; default: 0;
 *  Set this bit to clear the OUTFIFO_UDF_L2_CH_INT interrupt.
 */
#define H264_DMA_OUTFIFO_UDF_L2_CH1_INT_CLR    (BIT(7))
#define H264_DMA_OUTFIFO_UDF_L2_CH1_INT_CLR_M  (H264_DMA_OUTFIFO_UDF_L2_CH1_INT_CLR_V << H264_DMA_OUTFIFO_UDF_L2_CH1_INT_CLR_S)
#define H264_DMA_OUTFIFO_UDF_L2_CH1_INT_CLR_V  0x00000001U
#define H264_DMA_OUTFIFO_UDF_L2_CH1_INT_CLR_S  7
/** H264_DMA_OUT_DSCR_TASK_OVF_CH1_INT_CLR : WT; bitpos: [8]; default: 0;
 *  Set this bit to clear the OUT_DSCR_TASK_OVF_CH_INT interrupt.
 */
#define H264_DMA_OUT_DSCR_TASK_OVF_CH1_INT_CLR    (BIT(8))
#define H264_DMA_OUT_DSCR_TASK_OVF_CH1_INT_CLR_M  (H264_DMA_OUT_DSCR_TASK_OVF_CH1_INT_CLR_V << H264_DMA_OUT_DSCR_TASK_OVF_CH1_INT_CLR_S)
#define H264_DMA_OUT_DSCR_TASK_OVF_CH1_INT_CLR_V  0x00000001U
#define H264_DMA_OUT_DSCR_TASK_OVF_CH1_INT_CLR_S  8

/** H264_DMA_OUTFIFO_STATUS_CH1_REG register
 *  TX CH1 outfifo status register
 */
#define H264_DMA_OUTFIFO_STATUS_CH1_REG (DR_REG_H264_DMA_BASE + 0x114)
/** H264_DMA_OUTFIFO_FULL_L2_CH1 : RO; bitpos: [0]; default: 0;
 *  Tx FIFO full signal for Tx channel 1.
 */
#define H264_DMA_OUTFIFO_FULL_L2_CH1    (BIT(0))
#define H264_DMA_OUTFIFO_FULL_L2_CH1_M  (H264_DMA_OUTFIFO_FULL_L2_CH1_V << H264_DMA_OUTFIFO_FULL_L2_CH1_S)
#define H264_DMA_OUTFIFO_FULL_L2_CH1_V  0x00000001U
#define H264_DMA_OUTFIFO_FULL_L2_CH1_S  0
/** H264_DMA_OUTFIFO_EMPTY_L2_CH1 : RO; bitpos: [1]; default: 1;
 *  Tx FIFO empty signal for Tx channel 1.
 */
#define H264_DMA_OUTFIFO_EMPTY_L2_CH1    (BIT(1))
#define H264_DMA_OUTFIFO_EMPTY_L2_CH1_M  (H264_DMA_OUTFIFO_EMPTY_L2_CH1_V << H264_DMA_OUTFIFO_EMPTY_L2_CH1_S)
#define H264_DMA_OUTFIFO_EMPTY_L2_CH1_V  0x00000001U
#define H264_DMA_OUTFIFO_EMPTY_L2_CH1_S  1
/** H264_DMA_OUTFIFO_CNT_L2_CH1 : RO; bitpos: [5:2]; default: 0;
 *  The register stores the byte number of the data in Tx FIFO for Tx channel 1.
 */
#define H264_DMA_OUTFIFO_CNT_L2_CH1    0x0000000FU
#define H264_DMA_OUTFIFO_CNT_L2_CH1_M  (H264_DMA_OUTFIFO_CNT_L2_CH1_V << H264_DMA_OUTFIFO_CNT_L2_CH1_S)
#define H264_DMA_OUTFIFO_CNT_L2_CH1_V  0x0000000FU
#define H264_DMA_OUTFIFO_CNT_L2_CH1_S  2
/** H264_DMA_OUTFIFO_FULL_L1_CH1 : RO; bitpos: [6]; default: 0;
 *  Tx FIFO full signal for Tx channel 1.
 */
#define H264_DMA_OUTFIFO_FULL_L1_CH1    (BIT(6))
#define H264_DMA_OUTFIFO_FULL_L1_CH1_M  (H264_DMA_OUTFIFO_FULL_L1_CH1_V << H264_DMA_OUTFIFO_FULL_L1_CH1_S)
#define H264_DMA_OUTFIFO_FULL_L1_CH1_V  0x00000001U
#define H264_DMA_OUTFIFO_FULL_L1_CH1_S  6
/** H264_DMA_OUTFIFO_EMPTY_L1_CH1 : RO; bitpos: [7]; default: 1;
 *  Tx FIFO empty signal for Tx channel 1.
 */
#define H264_DMA_OUTFIFO_EMPTY_L1_CH1    (BIT(7))
#define H264_DMA_OUTFIFO_EMPTY_L1_CH1_M  (H264_DMA_OUTFIFO_EMPTY_L1_CH1_V << H264_DMA_OUTFIFO_EMPTY_L1_CH1_S)
#define H264_DMA_OUTFIFO_EMPTY_L1_CH1_V  0x00000001U
#define H264_DMA_OUTFIFO_EMPTY_L1_CH1_S  7
/** H264_DMA_OUTFIFO_CNT_L1_CH1 : RO; bitpos: [12:8]; default: 0;
 *  The register stores the byte number of the data in Tx FIFO for Tx channel 1.
 */
#define H264_DMA_OUTFIFO_CNT_L1_CH1    0x0000001FU
#define H264_DMA_OUTFIFO_CNT_L1_CH1_M  (H264_DMA_OUTFIFO_CNT_L1_CH1_V << H264_DMA_OUTFIFO_CNT_L1_CH1_S)
#define H264_DMA_OUTFIFO_CNT_L1_CH1_V  0x0000001FU
#define H264_DMA_OUTFIFO_CNT_L1_CH1_S  8
/** H264_DMA_OUTFIFO_FULL_L3_CH1 : RO; bitpos: [16]; default: 0;
 *  Tx FIFO full signal for Tx channel 1.
 */
#define H264_DMA_OUTFIFO_FULL_L3_CH1    (BIT(16))
#define H264_DMA_OUTFIFO_FULL_L3_CH1_M  (H264_DMA_OUTFIFO_FULL_L3_CH1_V << H264_DMA_OUTFIFO_FULL_L3_CH1_S)
#define H264_DMA_OUTFIFO_FULL_L3_CH1_V  0x00000001U
#define H264_DMA_OUTFIFO_FULL_L3_CH1_S  16
/** H264_DMA_OUTFIFO_EMPTY_L3_CH1 : RO; bitpos: [17]; default: 1;
 *  Tx FIFO empty signal for Tx channel 1.
 */
#define H264_DMA_OUTFIFO_EMPTY_L3_CH1    (BIT(17))
#define H264_DMA_OUTFIFO_EMPTY_L3_CH1_M  (H264_DMA_OUTFIFO_EMPTY_L3_CH1_V << H264_DMA_OUTFIFO_EMPTY_L3_CH1_S)
#define H264_DMA_OUTFIFO_EMPTY_L3_CH1_V  0x00000001U
#define H264_DMA_OUTFIFO_EMPTY_L3_CH1_S  17
/** H264_DMA_OUTFIFO_CNT_L3_CH1 : RO; bitpos: [19:18]; default: 0;
 *  The register stores the byte number of the data in Tx FIFO for Tx channel 1.
 */
#define H264_DMA_OUTFIFO_CNT_L3_CH1    0x00000003U
#define H264_DMA_OUTFIFO_CNT_L3_CH1_M  (H264_DMA_OUTFIFO_CNT_L3_CH1_V << H264_DMA_OUTFIFO_CNT_L3_CH1_S)
#define H264_DMA_OUTFIFO_CNT_L3_CH1_V  0x00000003U
#define H264_DMA_OUTFIFO_CNT_L3_CH1_S  18

/** H264_DMA_OUT_PUSH_CH1_REG register
 *  TX CH1 outfifo push register
 */
#define H264_DMA_OUT_PUSH_CH1_REG (DR_REG_H264_DMA_BASE + 0x118)
/** H264_DMA_OUTFIFO_WDATA_CH1 : R/W; bitpos: [9:0]; default: 0;
 *  This register stores the data that need to be pushed into DMA Tx FIFO.
 */
#define H264_DMA_OUTFIFO_WDATA_CH1    0x000003FFU
#define H264_DMA_OUTFIFO_WDATA_CH1_M  (H264_DMA_OUTFIFO_WDATA_CH1_V << H264_DMA_OUTFIFO_WDATA_CH1_S)
#define H264_DMA_OUTFIFO_WDATA_CH1_V  0x000003FFU
#define H264_DMA_OUTFIFO_WDATA_CH1_S  0
/** H264_DMA_OUTFIFO_PUSH_CH1 : R/W/SC; bitpos: [10]; default: 0;
 *  Set this bit to push data into DMA Tx FIFO.
 */
#define H264_DMA_OUTFIFO_PUSH_CH1    (BIT(10))
#define H264_DMA_OUTFIFO_PUSH_CH1_M  (H264_DMA_OUTFIFO_PUSH_CH1_V << H264_DMA_OUTFIFO_PUSH_CH1_S)
#define H264_DMA_OUTFIFO_PUSH_CH1_V  0x00000001U
#define H264_DMA_OUTFIFO_PUSH_CH1_S  10

/** H264_DMA_OUT_LINK_CONF_CH1_REG register
 *  TX CH1 out_link dscr ctrl register
 */
#define H264_DMA_OUT_LINK_CONF_CH1_REG (DR_REG_H264_DMA_BASE + 0x11c)
/** H264_DMA_OUTLINK_STOP_CH1 : R/W/SC; bitpos: [20]; default: 0;
 *  Set this bit to stop dealing with the outlink descriptors.
 */
#define H264_DMA_OUTLINK_STOP_CH1    (BIT(20))
#define H264_DMA_OUTLINK_STOP_CH1_M  (H264_DMA_OUTLINK_STOP_CH1_V << H264_DMA_OUTLINK_STOP_CH1_S)
#define H264_DMA_OUTLINK_STOP_CH1_V  0x00000001U
#define H264_DMA_OUTLINK_STOP_CH1_S  20
/** H264_DMA_OUTLINK_START_CH1 : R/W/SC; bitpos: [21]; default: 0;
 *  Set this bit to start dealing with the outlink descriptors.
 */
#define H264_DMA_OUTLINK_START_CH1    (BIT(21))
#define H264_DMA_OUTLINK_START_CH1_M  (H264_DMA_OUTLINK_START_CH1_V << H264_DMA_OUTLINK_START_CH1_S)
#define H264_DMA_OUTLINK_START_CH1_V  0x00000001U
#define H264_DMA_OUTLINK_START_CH1_S  21
/** H264_DMA_OUTLINK_RESTART_CH1 : R/W/SC; bitpos: [22]; default: 0;
 *  Set this bit to restart a new outlink from the last address.
 */
#define H264_DMA_OUTLINK_RESTART_CH1    (BIT(22))
#define H264_DMA_OUTLINK_RESTART_CH1_M  (H264_DMA_OUTLINK_RESTART_CH1_V << H264_DMA_OUTLINK_RESTART_CH1_S)
#define H264_DMA_OUTLINK_RESTART_CH1_V  0x00000001U
#define H264_DMA_OUTLINK_RESTART_CH1_S  22
/** H264_DMA_OUTLINK_PARK_CH1 : RO; bitpos: [23]; default: 1;
 *  1: the outlink descriptor's FSM is in idle state.  0: the outlink descriptor's FSM
 *  is working.
 */
#define H264_DMA_OUTLINK_PARK_CH1    (BIT(23))
#define H264_DMA_OUTLINK_PARK_CH1_M  (H264_DMA_OUTLINK_PARK_CH1_V << H264_DMA_OUTLINK_PARK_CH1_S)
#define H264_DMA_OUTLINK_PARK_CH1_V  0x00000001U
#define H264_DMA_OUTLINK_PARK_CH1_S  23

/** H264_DMA_OUT_LINK_ADDR_CH1_REG register
 *  TX CH1 out_link dscr addr register
 */
#define H264_DMA_OUT_LINK_ADDR_CH1_REG (DR_REG_H264_DMA_BASE + 0x120)
/** H264_DMA_OUTLINK_ADDR_CH1 : R/W; bitpos: [31:0]; default: 0;
 *  This register stores the first outlink descriptor's address.
 */
#define H264_DMA_OUTLINK_ADDR_CH1    0xFFFFFFFFU
#define H264_DMA_OUTLINK_ADDR_CH1_M  (H264_DMA_OUTLINK_ADDR_CH1_V << H264_DMA_OUTLINK_ADDR_CH1_S)
#define H264_DMA_OUTLINK_ADDR_CH1_V  0xFFFFFFFFU
#define H264_DMA_OUTLINK_ADDR_CH1_S  0

/** H264_DMA_OUT_STATE_CH1_REG register
 *  TX CH1 state register
 */
#define H264_DMA_OUT_STATE_CH1_REG (DR_REG_H264_DMA_BASE + 0x124)
/** H264_DMA_OUTLINK_DSCR_ADDR_CH1 : RO; bitpos: [17:0]; default: 0;
 *  This register stores the current outlink descriptor's address.
 */
#define H264_DMA_OUTLINK_DSCR_ADDR_CH1    0x0003FFFFU
#define H264_DMA_OUTLINK_DSCR_ADDR_CH1_M  (H264_DMA_OUTLINK_DSCR_ADDR_CH1_V << H264_DMA_OUTLINK_DSCR_ADDR_CH1_S)
#define H264_DMA_OUTLINK_DSCR_ADDR_CH1_V  0x0003FFFFU
#define H264_DMA_OUTLINK_DSCR_ADDR_CH1_S  0
/** H264_DMA_OUT_DSCR_STATE_CH1 : RO; bitpos: [19:18]; default: 0;
 *  This register stores the current descriptor state machine state.
 */
#define H264_DMA_OUT_DSCR_STATE_CH1    0x00000003U
#define H264_DMA_OUT_DSCR_STATE_CH1_M  (H264_DMA_OUT_DSCR_STATE_CH1_V << H264_DMA_OUT_DSCR_STATE_CH1_S)
#define H264_DMA_OUT_DSCR_STATE_CH1_V  0x00000003U
#define H264_DMA_OUT_DSCR_STATE_CH1_S  18
/** H264_DMA_OUT_STATE_CH1 : RO; bitpos: [23:20]; default: 0;
 *  This register stores the current control module state machine state.
 */
#define H264_DMA_OUT_STATE_CH1    0x0000000FU
#define H264_DMA_OUT_STATE_CH1_M  (H264_DMA_OUT_STATE_CH1_V << H264_DMA_OUT_STATE_CH1_S)
#define H264_DMA_OUT_STATE_CH1_V  0x0000000FU
#define H264_DMA_OUT_STATE_CH1_S  20
/** H264_DMA_OUT_RESET_AVAIL_CH1 : RO; bitpos: [24]; default: 1;
 *  This register indicate that if the channel reset is safety.
 */
#define H264_DMA_OUT_RESET_AVAIL_CH1    (BIT(24))
#define H264_DMA_OUT_RESET_AVAIL_CH1_M  (H264_DMA_OUT_RESET_AVAIL_CH1_V << H264_DMA_OUT_RESET_AVAIL_CH1_S)
#define H264_DMA_OUT_RESET_AVAIL_CH1_V  0x00000001U
#define H264_DMA_OUT_RESET_AVAIL_CH1_S  24

/** H264_DMA_OUT_EOF_DES_ADDR_CH1_REG register
 *  TX CH1 eof des addr register
 */
#define H264_DMA_OUT_EOF_DES_ADDR_CH1_REG (DR_REG_H264_DMA_BASE + 0x128)
/** H264_DMA_OUT_EOF_DES_ADDR_CH1 : RO; bitpos: [31:0]; default: 0;
 *  This register stores the address of the outlink descriptor when the EOF bit in this
 *  descriptor is 1.
 */
#define H264_DMA_OUT_EOF_DES_ADDR_CH1    0xFFFFFFFFU
#define H264_DMA_OUT_EOF_DES_ADDR_CH1_M  (H264_DMA_OUT_EOF_DES_ADDR_CH1_V << H264_DMA_OUT_EOF_DES_ADDR_CH1_S)
#define H264_DMA_OUT_EOF_DES_ADDR_CH1_V  0xFFFFFFFFU
#define H264_DMA_OUT_EOF_DES_ADDR_CH1_S  0

/** H264_DMA_OUT_DSCR_CH1_REG register
 *  TX CH1 next dscr addr register
 */
#define H264_DMA_OUT_DSCR_CH1_REG (DR_REG_H264_DMA_BASE + 0x12c)
/** H264_DMA_OUTLINK_DSCR_CH1 : RO; bitpos: [31:0]; default: 0;
 *  The address of the next outlink descriptor address y.
 */
#define H264_DMA_OUTLINK_DSCR_CH1    0xFFFFFFFFU
#define H264_DMA_OUTLINK_DSCR_CH1_M  (H264_DMA_OUTLINK_DSCR_CH1_V << H264_DMA_OUTLINK_DSCR_CH1_S)
#define H264_DMA_OUTLINK_DSCR_CH1_V  0xFFFFFFFFU
#define H264_DMA_OUTLINK_DSCR_CH1_S  0

/** H264_DMA_OUT_DSCR_BF0_CH1_REG register
 *  TX CH1 last dscr addr register
 */
#define H264_DMA_OUT_DSCR_BF0_CH1_REG (DR_REG_H264_DMA_BASE + 0x130)
/** H264_DMA_OUTLINK_DSCR_BF0_CH1 : RO; bitpos: [31:0]; default: 0;
 *  The address of the last outlink descriptor's next address y-1.
 */
#define H264_DMA_OUTLINK_DSCR_BF0_CH1    0xFFFFFFFFU
#define H264_DMA_OUTLINK_DSCR_BF0_CH1_M  (H264_DMA_OUTLINK_DSCR_BF0_CH1_V << H264_DMA_OUTLINK_DSCR_BF0_CH1_S)
#define H264_DMA_OUTLINK_DSCR_BF0_CH1_V  0xFFFFFFFFU
#define H264_DMA_OUTLINK_DSCR_BF0_CH1_S  0

