espressif/esp-idf/components/soc/esp32p4/register/hw_ver1/soc/h264_dma_reg.h
/** H264_DMA_OUT_DSCR_BF1_CH1_REG register
 *  TX CH1 second-to-last dscr addr register
 */
#define H264_DMA_OUT_DSCR_BF1_CH1_REG (DR_REG_H264_DMA_BASE + 0x134)
/** H264_DMA_OUTLINK_DSCR_BF1_CH1 : RO; bitpos: [31:0]; default: 0;
 *  The address of the second-to-last outlink descriptor's next address y-2.
 */
#define H264_DMA_OUTLINK_DSCR_BF1_CH1    0xFFFFFFFFU
#define H264_DMA_OUTLINK_DSCR_BF1_CH1_M  (H264_DMA_OUTLINK_DSCR_BF1_CH1_V << H264_DMA_OUTLINK_DSCR_BF1_CH1_S)
#define H264_DMA_OUTLINK_DSCR_BF1_CH1_V  0xFFFFFFFFU
#define H264_DMA_OUTLINK_DSCR_BF1_CH1_S  0

/** H264_DMA_OUT_ARB_CH1_REG register
 *  TX CH1 arb register
 */
#define H264_DMA_OUT_ARB_CH1_REG (DR_REG_H264_DMA_BASE + 0x13c)
/** H264_DMA_OUT_ARB_TOKEN_NUM_CH1 : R/W; bitpos: [3:0]; default: 1;
 *  Set the max number of token count of arbiter
 */
#define H264_DMA_OUT_ARB_TOKEN_NUM_CH1    0x0000000FU
#define H264_DMA_OUT_ARB_TOKEN_NUM_CH1_M  (H264_DMA_OUT_ARB_TOKEN_NUM_CH1_V << H264_DMA_OUT_ARB_TOKEN_NUM_CH1_S)
#define H264_DMA_OUT_ARB_TOKEN_NUM_CH1_V  0x0000000FU
#define H264_DMA_OUT_ARB_TOKEN_NUM_CH1_S  0
/** H264_DMA_INTER_OUT_ARB_PRIORITY_CH1 : R/W; bitpos: [6]; default: 1;
 *  Set the priority of channel
 */
#define H264_DMA_INTER_OUT_ARB_PRIORITY_CH1    (BIT(6))
#define H264_DMA_INTER_OUT_ARB_PRIORITY_CH1_M  (H264_DMA_INTER_OUT_ARB_PRIORITY_CH1_V << H264_DMA_INTER_OUT_ARB_PRIORITY_CH1_S)
#define H264_DMA_INTER_OUT_ARB_PRIORITY_CH1_V  0x00000001U
#define H264_DMA_INTER_OUT_ARB_PRIORITY_CH1_S  6

/** H264_DMA_OUT_ETM_CONF_CH1_REG register
 *  TX CH1 ETM config register
 */
#define H264_DMA_OUT_ETM_CONF_CH1_REG (DR_REG_H264_DMA_BASE + 0x168)
/** H264_DMA_OUT_ETM_EN_CH1 : R/W; bitpos: [0]; default: 0;
 *  Set this bit to 1 to enable ETM task function
 */
#define H264_DMA_OUT_ETM_EN_CH1    (BIT(0))
#define H264_DMA_OUT_ETM_EN_CH1_M  (H264_DMA_OUT_ETM_EN_CH1_V << H264_DMA_OUT_ETM_EN_CH1_S)
#define H264_DMA_OUT_ETM_EN_CH1_V  0x00000001U
#define H264_DMA_OUT_ETM_EN_CH1_S  0
/** H264_DMA_OUT_ETM_LOOP_EN_CH1 : R/W; bitpos: [1]; default: 0;
 *  when this bit is 1, dscr can be processed after receiving a task
 */
#define H264_DMA_OUT_ETM_LOOP_EN_CH1    (BIT(1))
#define H264_DMA_OUT_ETM_LOOP_EN_CH1_M  (H264_DMA_OUT_ETM_LOOP_EN_CH1_V << H264_DMA_OUT_ETM_LOOP_EN_CH1_S)
#define H264_DMA_OUT_ETM_LOOP_EN_CH1_V  0x00000001U
#define H264_DMA_OUT_ETM_LOOP_EN_CH1_S  1
/** H264_DMA_OUT_DSCR_TASK_MAK_CH1 : R/W; bitpos: [3:2]; default: 1;
 *  ETM dscr_ready maximum cache numbers
 */
#define H264_DMA_OUT_DSCR_TASK_MAK_CH1    0x00000003U
#define H264_DMA_OUT_DSCR_TASK_MAK_CH1_M  (H264_DMA_OUT_DSCR_TASK_MAK_CH1_V << H264_DMA_OUT_DSCR_TASK_MAK_CH1_S)
#define H264_DMA_OUT_DSCR_TASK_MAK_CH1_V  0x00000003U
#define H264_DMA_OUT_DSCR_TASK_MAK_CH1_S  2

/** H264_DMA_OUT_BUF_LEN_CH1_REG register
 *  tx CH1 buf len register
 */
#define H264_DMA_OUT_BUF_LEN_CH1_REG (DR_REG_H264_DMA_BASE + 0x170)
/** H264_DMA_OUT_CMDFIFO_BUF_LEN_HB_CH1 : RO; bitpos: [12:0]; default: 0;
 *  only for debug
 */
#define H264_DMA_OUT_CMDFIFO_BUF_LEN_HB_CH1    0x00001FFFU
#define H264_DMA_OUT_CMDFIFO_BUF_LEN_HB_CH1_M  (H264_DMA_OUT_CMDFIFO_BUF_LEN_HB_CH1_V << H264_DMA_OUT_CMDFIFO_BUF_LEN_HB_CH1_S)
#define H264_DMA_OUT_CMDFIFO_BUF_LEN_HB_CH1_V  0x00001FFFU
#define H264_DMA_OUT_CMDFIFO_BUF_LEN_HB_CH1_S  0

/** H264_DMA_OUT_FIFO_BCNT_CH1_REG register
 *  tx CH1 fifo byte cnt register
 */
#define H264_DMA_OUT_FIFO_BCNT_CH1_REG (DR_REG_H264_DMA_BASE + 0x174)
/** H264_DMA_OUT_CMDFIFO_OUTFIFO_BCNT_CH1 : RO; bitpos: [9:0]; default: 0;
 *  only for debug
 */
#define H264_DMA_OUT_CMDFIFO_OUTFIFO_BCNT_CH1    0x000003FFU
#define H264_DMA_OUT_CMDFIFO_OUTFIFO_BCNT_CH1_M  (H264_DMA_OUT_CMDFIFO_OUTFIFO_BCNT_CH1_V << H264_DMA_OUT_CMDFIFO_OUTFIFO_BCNT_CH1_S)
#define H264_DMA_OUT_CMDFIFO_OUTFIFO_BCNT_CH1_V  0x000003FFU
#define H264_DMA_OUT_CMDFIFO_OUTFIFO_BCNT_CH1_S  0

/** H264_DMA_OUT_PUSH_BYTECNT_CH1_REG register
 *  tx CH1 push byte cnt register
 */
#define H264_DMA_OUT_PUSH_BYTECNT_CH1_REG (DR_REG_H264_DMA_BASE + 0x178)
/** H264_DMA_OUT_CMDFIFO_PUSH_BYTECNT_CH1 : RO; bitpos: [7:0]; default: 255;
 *  only for debug
 */
#define H264_DMA_OUT_CMDFIFO_PUSH_BYTECNT_CH1    0x000000FFU
#define H264_DMA_OUT_CMDFIFO_PUSH_BYTECNT_CH1_M  (H264_DMA_OUT_CMDFIFO_PUSH_BYTECNT_CH1_V << H264_DMA_OUT_CMDFIFO_PUSH_BYTECNT_CH1_S)
#define H264_DMA_OUT_CMDFIFO_PUSH_BYTECNT_CH1_V  0x000000FFU
#define H264_DMA_OUT_CMDFIFO_PUSH_BYTECNT_CH1_S  0

/** H264_DMA_OUT_XADDR_CH1_REG register
 *  tx CH1 xaddr register
 */
#define H264_DMA_OUT_XADDR_CH1_REG (DR_REG_H264_DMA_BASE + 0x17c)
/** H264_DMA_OUT_CMDFIFO_XADDR_CH1 : RO; bitpos: [31:0]; default: 0;
 *  only for debug
 */
#define H264_DMA_OUT_CMDFIFO_XADDR_CH1    0xFFFFFFFFU
#define H264_DMA_OUT_CMDFIFO_XADDR_CH1_M  (H264_DMA_OUT_CMDFIFO_XADDR_CH1_V << H264_DMA_OUT_CMDFIFO_XADDR_CH1_S)
#define H264_DMA_OUT_CMDFIFO_XADDR_CH1_V  0xFFFFFFFFU
#define H264_DMA_OUT_CMDFIFO_XADDR_CH1_S  0

/** H264_DMA_OUT_CONF0_CH2_REG register
 *  TX CH2 config0 register
 */
#define H264_DMA_OUT_CONF0_CH2_REG (DR_REG_H264_DMA_BASE + 0x200)
/** H264_DMA_OUT_AUTO_WRBACK_CH2 : R/W; bitpos: [0]; default: 0;
 *  Set this bit to enable automatic outlink-writeback when all the data pointed by
 *  outlink descriptor has been received.
 */
#define H264_DMA_OUT_AUTO_WRBACK_CH2    (BIT(0))
#define H264_DMA_OUT_AUTO_WRBACK_CH2_M  (H264_DMA_OUT_AUTO_WRBACK_CH2_V << H264_DMA_OUT_AUTO_WRBACK_CH2_S)
#define H264_DMA_OUT_AUTO_WRBACK_CH2_V  0x00000001U
#define H264_DMA_OUT_AUTO_WRBACK_CH2_S  0
/** H264_DMA_OUT_EOF_MODE_CH2 : R/W; bitpos: [1]; default: 1;
 *  EOF flag generation mode when receiving data. 1: EOF flag for Tx channel 0 is
 *  generated when data need to read has been popped from FIFO in DMA
 */
#define H264_DMA_OUT_EOF_MODE_CH2    (BIT(1))
#define H264_DMA_OUT_EOF_MODE_CH2_M  (H264_DMA_OUT_EOF_MODE_CH2_V << H264_DMA_OUT_EOF_MODE_CH2_S)
#define H264_DMA_OUT_EOF_MODE_CH2_V  0x00000001U
#define H264_DMA_OUT_EOF_MODE_CH2_S  1
/** H264_DMA_OUTDSCR_BURST_EN_CH2 : R/W; bitpos: [2]; default: 0;
 *  Set this bit to 1 to enable INCR burst transfer for Tx channel 0 reading link
 *  descriptor when accessing internal SRAM.
 */
#define H264_DMA_OUTDSCR_BURST_EN_CH2    (BIT(2))
#define H264_DMA_OUTDSCR_BURST_EN_CH2_M  (H264_DMA_OUTDSCR_BURST_EN_CH2_V << H264_DMA_OUTDSCR_BURST_EN_CH2_S)
#define H264_DMA_OUTDSCR_BURST_EN_CH2_V  0x00000001U
#define H264_DMA_OUTDSCR_BURST_EN_CH2_S  2
/** H264_DMA_OUT_ECC_AES_EN_CH2 : R/W; bitpos: [3]; default: 0;
 *  When access address space is ecc/aes area, this bit should be set to 1. In this
 *  case, the start address of square should be 16-bit aligned. The width of square
 *  multiply byte number of one pixel should be 16-bit aligned.
 */
#define H264_DMA_OUT_ECC_AES_EN_CH2    (BIT(3))
#define H264_DMA_OUT_ECC_AES_EN_CH2_M  (H264_DMA_OUT_ECC_AES_EN_CH2_V << H264_DMA_OUT_ECC_AES_EN_CH2_S)
#define H264_DMA_OUT_ECC_AES_EN_CH2_V  0x00000001U
#define H264_DMA_OUT_ECC_AES_EN_CH2_S  3
/** H264_DMA_OUT_CHECK_OWNER_CH2 : R/W; bitpos: [4]; default: 0;
 *  Set this bit to enable checking the owner attribute of the link descriptor.
 */
#define H264_DMA_OUT_CHECK_OWNER_CH2    (BIT(4))
#define H264_DMA_OUT_CHECK_OWNER_CH2_M  (H264_DMA_OUT_CHECK_OWNER_CH2_V << H264_DMA_OUT_CHECK_OWNER_CH2_S)
#define H264_DMA_OUT_CHECK_OWNER_CH2_V  0x00000001U
#define H264_DMA_OUT_CHECK_OWNER_CH2_S  4
/** H264_DMA_OUT_MEM_BURST_LENGTH_CH2 : R/W; bitpos: [8:6]; default: 0;
 *  Block size of Tx channel 2. 0: single      1: 16 bytes      2: 32 bytes    3: 64
 *  bytes    4: 128 bytes
 */
#define H264_DMA_OUT_MEM_BURST_LENGTH_CH2    0x00000007U
#define H264_DMA_OUT_MEM_BURST_LENGTH_CH2_M  (H264_DMA_OUT_MEM_BURST_LENGTH_CH2_V << H264_DMA_OUT_MEM_BURST_LENGTH_CH2_S)
#define H264_DMA_OUT_MEM_BURST_LENGTH_CH2_V  0x00000007U
#define H264_DMA_OUT_MEM_BURST_LENGTH_CH2_S  6
/** H264_DMA_OUT_PAGE_BOUND_EN_CH2 : R/W; bitpos: [12]; default: 0;
 *  Set this bit to 1 to make sure AXI read data don't cross the address boundary which
 *  define by mem_burst_length
 */
#define H264_DMA_OUT_PAGE_BOUND_EN_CH2    (BIT(12))
#define H264_DMA_OUT_PAGE_BOUND_EN_CH2_M  (H264_DMA_OUT_PAGE_BOUND_EN_CH2_V << H264_DMA_OUT_PAGE_BOUND_EN_CH2_S)
#define H264_DMA_OUT_PAGE_BOUND_EN_CH2_V  0x00000001U
#define H264_DMA_OUT_PAGE_BOUND_EN_CH2_S  12
/** H264_DMA_OUT_RST_CH2 : R/W; bitpos: [24]; default: 0;
 *  Write 1 then write 0 to this bit to reset TX channel
 */
#define H264_DMA_OUT_RST_CH2    (BIT(24))
#define H264_DMA_OUT_RST_CH2_M  (H264_DMA_OUT_RST_CH2_V << H264_DMA_OUT_RST_CH2_S)
#define H264_DMA_OUT_RST_CH2_V  0x00000001U
#define H264_DMA_OUT_RST_CH2_S  24
/** H264_DMA_OUT_CMD_DISABLE_CH2 : R/W; bitpos: [25]; default: 0;
 *  Write 1 before reset and write 0 after reset
 */
#define H264_DMA_OUT_CMD_DISABLE_CH2    (BIT(25))
#define H264_DMA_OUT_CMD_DISABLE_CH2_M  (H264_DMA_OUT_CMD_DISABLE_CH2_V << H264_DMA_OUT_CMD_DISABLE_CH2_S)
#define H264_DMA_OUT_CMD_DISABLE_CH2_V  0x00000001U
#define H264_DMA_OUT_CMD_DISABLE_CH2_S  25
/** H264_DMA_OUT_ARB_WEIGHT_OPT_DIS_CH2 : R/W; bitpos: [26]; default: 0;
 *  Set this bit to 1 to disable arbiter optimum weight function.
 */
#define H264_DMA_OUT_ARB_WEIGHT_OPT_DIS_CH2    (BIT(26))
#define H264_DMA_OUT_ARB_WEIGHT_OPT_DIS_CH2_M  (H264_DMA_OUT_ARB_WEIGHT_OPT_DIS_CH2_V << H264_DMA_OUT_ARB_WEIGHT_OPT_DIS_CH2_S)
#define H264_DMA_OUT_ARB_WEIGHT_OPT_DIS_CH2_V  0x00000001U
#define H264_DMA_OUT_ARB_WEIGHT_OPT_DIS_CH2_S  26

