espressif/esp-idf/components/soc/esp32p4/register/hw_ver1/soc/h264_dma_reg.h
/** H264_DMA_OUT_INT_RAW_CH2_REG register
 *  TX CH2  interrupt raw register
 */
#define H264_DMA_OUT_INT_RAW_CH2_REG (DR_REG_H264_DMA_BASE + 0x204)
/** H264_DMA_OUT_DONE_CH2_INT_RAW : R/WTC/SS; bitpos: [0]; default: 0;
 *  The raw interrupt bit turns to high level when the last data pointed by one outlink
 *  descriptor has been transmitted to peripherals for Tx channel 0.
 */
#define H264_DMA_OUT_DONE_CH2_INT_RAW    (BIT(0))
#define H264_DMA_OUT_DONE_CH2_INT_RAW_M  (H264_DMA_OUT_DONE_CH2_INT_RAW_V << H264_DMA_OUT_DONE_CH2_INT_RAW_S)
#define H264_DMA_OUT_DONE_CH2_INT_RAW_V  0x00000001U
#define H264_DMA_OUT_DONE_CH2_INT_RAW_S  0
/** H264_DMA_OUT_EOF_CH2_INT_RAW : R/WTC/SS; bitpos: [1]; default: 0;
 *  The raw interrupt bit turns to high level when the last data pointed by one outlink
 *  descriptor has been read from memory for Tx channel 0.
 */
#define H264_DMA_OUT_EOF_CH2_INT_RAW    (BIT(1))
#define H264_DMA_OUT_EOF_CH2_INT_RAW_M  (H264_DMA_OUT_EOF_CH2_INT_RAW_V << H264_DMA_OUT_EOF_CH2_INT_RAW_S)
#define H264_DMA_OUT_EOF_CH2_INT_RAW_V  0x00000001U
#define H264_DMA_OUT_EOF_CH2_INT_RAW_S  1
/** H264_DMA_OUT_DSCR_ERR_CH2_INT_RAW : R/WTC/SS; bitpos: [2]; default: 0;
 *  The raw interrupt bit turns to high level when detecting outlink descriptor error,
 *  including owner error, the second and third word error of outlink descriptor for Tx
 *  channel 0.
 */
#define H264_DMA_OUT_DSCR_ERR_CH2_INT_RAW    (BIT(2))
#define H264_DMA_OUT_DSCR_ERR_CH2_INT_RAW_M  (H264_DMA_OUT_DSCR_ERR_CH2_INT_RAW_V << H264_DMA_OUT_DSCR_ERR_CH2_INT_RAW_S)
#define H264_DMA_OUT_DSCR_ERR_CH2_INT_RAW_V  0x00000001U
#define H264_DMA_OUT_DSCR_ERR_CH2_INT_RAW_S  2
/** H264_DMA_OUT_TOTAL_EOF_CH2_INT_RAW : R/WTC/SS; bitpos: [3]; default: 0;
 *  The raw interrupt bit turns to high level when data corresponding a outlink
 *  (includes one link descriptor or few link descriptors) is transmitted out for Tx
 *  channel 0.
 */
#define H264_DMA_OUT_TOTAL_EOF_CH2_INT_RAW    (BIT(3))
#define H264_DMA_OUT_TOTAL_EOF_CH2_INT_RAW_M  (H264_DMA_OUT_TOTAL_EOF_CH2_INT_RAW_V << H264_DMA_OUT_TOTAL_EOF_CH2_INT_RAW_S)
#define H264_DMA_OUT_TOTAL_EOF_CH2_INT_RAW_V  0x00000001U
#define H264_DMA_OUT_TOTAL_EOF_CH2_INT_RAW_S  3
/** H264_DMA_OUTFIFO_OVF_L1_CH2_INT_RAW : R/WTC/SS; bitpos: [4]; default: 0;
 *  The raw interrupt bit turns to high level when fifo is overflow.
 */
#define H264_DMA_OUTFIFO_OVF_L1_CH2_INT_RAW    (BIT(4))
#define H264_DMA_OUTFIFO_OVF_L1_CH2_INT_RAW_M  (H264_DMA_OUTFIFO_OVF_L1_CH2_INT_RAW_V << H264_DMA_OUTFIFO_OVF_L1_CH2_INT_RAW_S)
#define H264_DMA_OUTFIFO_OVF_L1_CH2_INT_RAW_V  0x00000001U
#define H264_DMA_OUTFIFO_OVF_L1_CH2_INT_RAW_S  4
/** H264_DMA_OUTFIFO_UDF_L1_CH2_INT_RAW : R/WTC/SS; bitpos: [5]; default: 0;
 *  The raw interrupt bit turns to high level when fifo is underflow.
 */
#define H264_DMA_OUTFIFO_UDF_L1_CH2_INT_RAW    (BIT(5))
#define H264_DMA_OUTFIFO_UDF_L1_CH2_INT_RAW_M  (H264_DMA_OUTFIFO_UDF_L1_CH2_INT_RAW_V << H264_DMA_OUTFIFO_UDF_L1_CH2_INT_RAW_S)
#define H264_DMA_OUTFIFO_UDF_L1_CH2_INT_RAW_V  0x00000001U
#define H264_DMA_OUTFIFO_UDF_L1_CH2_INT_RAW_S  5
/** H264_DMA_OUTFIFO_OVF_L2_CH2_INT_RAW : R/WTC/SS; bitpos: [6]; default: 0;
 *  The raw interrupt bit turns to high level when fifo is overflow.
 */
#define H264_DMA_OUTFIFO_OVF_L2_CH2_INT_RAW    (BIT(6))
#define H264_DMA_OUTFIFO_OVF_L2_CH2_INT_RAW_M  (H264_DMA_OUTFIFO_OVF_L2_CH2_INT_RAW_V << H264_DMA_OUTFIFO_OVF_L2_CH2_INT_RAW_S)
#define H264_DMA_OUTFIFO_OVF_L2_CH2_INT_RAW_V  0x00000001U
#define H264_DMA_OUTFIFO_OVF_L2_CH2_INT_RAW_S  6
/** H264_DMA_OUTFIFO_UDF_L2_CH2_INT_RAW : R/WTC/SS; bitpos: [7]; default: 0;
 *  The raw interrupt bit turns to high level when fifo is underflow.
 */
#define H264_DMA_OUTFIFO_UDF_L2_CH2_INT_RAW    (BIT(7))
#define H264_DMA_OUTFIFO_UDF_L2_CH2_INT_RAW_M  (H264_DMA_OUTFIFO_UDF_L2_CH2_INT_RAW_V << H264_DMA_OUTFIFO_UDF_L2_CH2_INT_RAW_S)
#define H264_DMA_OUTFIFO_UDF_L2_CH2_INT_RAW_V  0x00000001U
#define H264_DMA_OUTFIFO_UDF_L2_CH2_INT_RAW_S  7
/** H264_DMA_OUT_DSCR_TASK_OVF_CH2_INT_RAW : R/WTC/SS; bitpos: [8]; default: 0;
 *  The raw interrupt bit turns to high level when dscr ready task fifo is overflow.
 */
#define H264_DMA_OUT_DSCR_TASK_OVF_CH2_INT_RAW    (BIT(8))
#define H264_DMA_OUT_DSCR_TASK_OVF_CH2_INT_RAW_M  (H264_DMA_OUT_DSCR_TASK_OVF_CH2_INT_RAW_V << H264_DMA_OUT_DSCR_TASK_OVF_CH2_INT_RAW_S)
#define H264_DMA_OUT_DSCR_TASK_OVF_CH2_INT_RAW_V  0x00000001U
#define H264_DMA_OUT_DSCR_TASK_OVF_CH2_INT_RAW_S  8

/** H264_DMA_OUT_INT_ENA_CH2_REG register
 *  TX CH2  interrupt ena register
 */
#define H264_DMA_OUT_INT_ENA_CH2_REG (DR_REG_H264_DMA_BASE + 0x208)
/** H264_DMA_OUT_DONE_CH2_INT_ENA : R/W; bitpos: [0]; default: 0;
 *  The interrupt enable bit for the OUT_DONE_CH_INT interrupt.
 */
#define H264_DMA_OUT_DONE_CH2_INT_ENA    (BIT(0))
#define H264_DMA_OUT_DONE_CH2_INT_ENA_M  (H264_DMA_OUT_DONE_CH2_INT_ENA_V << H264_DMA_OUT_DONE_CH2_INT_ENA_S)
#define H264_DMA_OUT_DONE_CH2_INT_ENA_V  0x00000001U
#define H264_DMA_OUT_DONE_CH2_INT_ENA_S  0
/** H264_DMA_OUT_EOF_CH2_INT_ENA : R/W; bitpos: [1]; default: 0;
 *  The interrupt enable bit for the OUT_EOF_CH_INT interrupt.
 */
#define H264_DMA_OUT_EOF_CH2_INT_ENA    (BIT(1))
#define H264_DMA_OUT_EOF_CH2_INT_ENA_M  (H264_DMA_OUT_EOF_CH2_INT_ENA_V << H264_DMA_OUT_EOF_CH2_INT_ENA_S)
#define H264_DMA_OUT_EOF_CH2_INT_ENA_V  0x00000001U
#define H264_DMA_OUT_EOF_CH2_INT_ENA_S  1
/** H264_DMA_OUT_DSCR_ERR_CH2_INT_ENA : R/W; bitpos: [2]; default: 0;
 *  The interrupt enable bit for the OUT_DSCR_ERR_CH_INT interrupt.
 */
#define H264_DMA_OUT_DSCR_ERR_CH2_INT_ENA    (BIT(2))
#define H264_DMA_OUT_DSCR_ERR_CH2_INT_ENA_M  (H264_DMA_OUT_DSCR_ERR_CH2_INT_ENA_V << H264_DMA_OUT_DSCR_ERR_CH2_INT_ENA_S)
#define H264_DMA_OUT_DSCR_ERR_CH2_INT_ENA_V  0x00000001U
#define H264_DMA_OUT_DSCR_ERR_CH2_INT_ENA_S  2
/** H264_DMA_OUT_TOTAL_EOF_CH2_INT_ENA : R/W; bitpos: [3]; default: 0;
 *  The interrupt enable bit for the OUT_TOTAL_EOF_CH_INT interrupt.
 */
#define H264_DMA_OUT_TOTAL_EOF_CH2_INT_ENA    (BIT(3))
#define H264_DMA_OUT_TOTAL_EOF_CH2_INT_ENA_M  (H264_DMA_OUT_TOTAL_EOF_CH2_INT_ENA_V << H264_DMA_OUT_TOTAL_EOF_CH2_INT_ENA_S)
#define H264_DMA_OUT_TOTAL_EOF_CH2_INT_ENA_V  0x00000001U
#define H264_DMA_OUT_TOTAL_EOF_CH2_INT_ENA_S  3
/** H264_DMA_OUTFIFO_OVF_L1_CH2_INT_ENA : R/W; bitpos: [4]; default: 0;
 *  The interrupt enable bit for the OUTFIFO_OVF_L1_CH_INT interrupt.
 */
#define H264_DMA_OUTFIFO_OVF_L1_CH2_INT_ENA    (BIT(4))
#define H264_DMA_OUTFIFO_OVF_L1_CH2_INT_ENA_M  (H264_DMA_OUTFIFO_OVF_L1_CH2_INT_ENA_V << H264_DMA_OUTFIFO_OVF_L1_CH2_INT_ENA_S)
#define H264_DMA_OUTFIFO_OVF_L1_CH2_INT_ENA_V  0x00000001U
#define H264_DMA_OUTFIFO_OVF_L1_CH2_INT_ENA_S  4
/** H264_DMA_OUTFIFO_UDF_L1_CH2_INT_ENA : R/W; bitpos: [5]; default: 0;
 *  The interrupt enable bit for the OUTFIFO_UDF_L1_CH_INT interrupt.
 */
#define H264_DMA_OUTFIFO_UDF_L1_CH2_INT_ENA    (BIT(5))
#define H264_DMA_OUTFIFO_UDF_L1_CH2_INT_ENA_M  (H264_DMA_OUTFIFO_UDF_L1_CH2_INT_ENA_V << H264_DMA_OUTFIFO_UDF_L1_CH2_INT_ENA_S)
#define H264_DMA_OUTFIFO_UDF_L1_CH2_INT_ENA_V  0x00000001U
#define H264_DMA_OUTFIFO_UDF_L1_CH2_INT_ENA_S  5
/** H264_DMA_OUTFIFO_OVF_L2_CH2_INT_ENA : R/W; bitpos: [6]; default: 0;
 *  The interrupt enable bit for the OUTFIFO_OVF_L2_CH_INT interrupt.
 */
#define H264_DMA_OUTFIFO_OVF_L2_CH2_INT_ENA    (BIT(6))
#define H264_DMA_OUTFIFO_OVF_L2_CH2_INT_ENA_M  (H264_DMA_OUTFIFO_OVF_L2_CH2_INT_ENA_V << H264_DMA_OUTFIFO_OVF_L2_CH2_INT_ENA_S)
#define H264_DMA_OUTFIFO_OVF_L2_CH2_INT_ENA_V  0x00000001U
#define H264_DMA_OUTFIFO_OVF_L2_CH2_INT_ENA_S  6
/** H264_DMA_OUTFIFO_UDF_L2_CH2_INT_ENA : R/W; bitpos: [7]; default: 0;
 *  The interrupt enable bit for the OUTFIFO_UDF_L2_CH_INT interrupt.
 */
#define H264_DMA_OUTFIFO_UDF_L2_CH2_INT_ENA    (BIT(7))
#define H264_DMA_OUTFIFO_UDF_L2_CH2_INT_ENA_M  (H264_DMA_OUTFIFO_UDF_L2_CH2_INT_ENA_V << H264_DMA_OUTFIFO_UDF_L2_CH2_INT_ENA_S)
#define H264_DMA_OUTFIFO_UDF_L2_CH2_INT_ENA_V  0x00000001U
#define H264_DMA_OUTFIFO_UDF_L2_CH2_INT_ENA_S  7
/** H264_DMA_OUT_DSCR_TASK_OVF_CH2_INT_ENA : R/W; bitpos: [8]; default: 0;
 *  The interrupt enable bit for the OUT_DSCR_TASK_OVF_CH_INT interrupt.
 */
#define H264_DMA_OUT_DSCR_TASK_OVF_CH2_INT_ENA    (BIT(8))
#define H264_DMA_OUT_DSCR_TASK_OVF_CH2_INT_ENA_M  (H264_DMA_OUT_DSCR_TASK_OVF_CH2_INT_ENA_V << H264_DMA_OUT_DSCR_TASK_OVF_CH2_INT_ENA_S)
#define H264_DMA_OUT_DSCR_TASK_OVF_CH2_INT_ENA_V  0x00000001U
#define H264_DMA_OUT_DSCR_TASK_OVF_CH2_INT_ENA_S  8

/** H264_DMA_OUT_INT_ST_CH2_REG register
 *  TX CH2  interrupt st register
 */
#define H264_DMA_OUT_INT_ST_CH2_REG (DR_REG_H264_DMA_BASE + 0x20c)
/** H264_DMA_OUT_DONE_CH2_INT_ST : RO; bitpos: [0]; default: 0;
 *  The raw interrupt status bit for the OUT_DONE_CH_INT interrupt.
 */
#define H264_DMA_OUT_DONE_CH2_INT_ST    (BIT(0))
#define H264_DMA_OUT_DONE_CH2_INT_ST_M  (H264_DMA_OUT_DONE_CH2_INT_ST_V << H264_DMA_OUT_DONE_CH2_INT_ST_S)
#define H264_DMA_OUT_DONE_CH2_INT_ST_V  0x00000001U
#define H264_DMA_OUT_DONE_CH2_INT_ST_S  0
/** H264_DMA_OUT_EOF_CH2_INT_ST : RO; bitpos: [1]; default: 0;
 *  The raw interrupt status bit for the OUT_EOF_CH_INT interrupt.
 */
#define H264_DMA_OUT_EOF_CH2_INT_ST    (BIT(1))
#define H264_DMA_OUT_EOF_CH2_INT_ST_M  (H264_DMA_OUT_EOF_CH2_INT_ST_V << H264_DMA_OUT_EOF_CH2_INT_ST_S)
#define H264_DMA_OUT_EOF_CH2_INT_ST_V  0x00000001U
#define H264_DMA_OUT_EOF_CH2_INT_ST_S  1
/** H264_DMA_OUT_DSCR_ERR_CH2_INT_ST : RO; bitpos: [2]; default: 0;
 *  The raw interrupt status bit for the OUT_DSCR_ERR_CH_INT interrupt.
 */
#define H264_DMA_OUT_DSCR_ERR_CH2_INT_ST    (BIT(2))
#define H264_DMA_OUT_DSCR_ERR_CH2_INT_ST_M  (H264_DMA_OUT_DSCR_ERR_CH2_INT_ST_V << H264_DMA_OUT_DSCR_ERR_CH2_INT_ST_S)
#define H264_DMA_OUT_DSCR_ERR_CH2_INT_ST_V  0x00000001U
#define H264_DMA_OUT_DSCR_ERR_CH2_INT_ST_S  2
/** H264_DMA_OUT_TOTAL_EOF_CH2_INT_ST : RO; bitpos: [3]; default: 0;
 *  The raw interrupt status bit for the OUT_TOTAL_EOF_CH_INT interrupt.
 */
#define H264_DMA_OUT_TOTAL_EOF_CH2_INT_ST    (BIT(3))
#define H264_DMA_OUT_TOTAL_EOF_CH2_INT_ST_M  (H264_DMA_OUT_TOTAL_EOF_CH2_INT_ST_V << H264_DMA_OUT_TOTAL_EOF_CH2_INT_ST_S)
#define H264_DMA_OUT_TOTAL_EOF_CH2_INT_ST_V  0x00000001U
#define H264_DMA_OUT_TOTAL_EOF_CH2_INT_ST_S  3
/** H264_DMA_OUTFIFO_OVF_L1_CH2_INT_ST : RO; bitpos: [4]; default: 0;
 *  The raw interrupt status bit for the OUTFIFO_OVF_L1_CH_INT interrupt.
 */
#define H264_DMA_OUTFIFO_OVF_L1_CH2_INT_ST    (BIT(4))
#define H264_DMA_OUTFIFO_OVF_L1_CH2_INT_ST_M  (H264_DMA_OUTFIFO_OVF_L1_CH2_INT_ST_V << H264_DMA_OUTFIFO_OVF_L1_CH2_INT_ST_S)
#define H264_DMA_OUTFIFO_OVF_L1_CH2_INT_ST_V  0x00000001U
#define H264_DMA_OUTFIFO_OVF_L1_CH2_INT_ST_S  4
/** H264_DMA_OUTFIFO_UDF_L1_CH2_INT_ST : RO; bitpos: [5]; default: 0;
 *  The raw interrupt status bit for the OUTFIFO_UDF_L1_CH_INT interrupt.
 */
#define H264_DMA_OUTFIFO_UDF_L1_CH2_INT_ST    (BIT(5))
#define H264_DMA_OUTFIFO_UDF_L1_CH2_INT_ST_M  (H264_DMA_OUTFIFO_UDF_L1_CH2_INT_ST_V << H264_DMA_OUTFIFO_UDF_L1_CH2_INT_ST_S)
#define H264_DMA_OUTFIFO_UDF_L1_CH2_INT_ST_V  0x00000001U
#define H264_DMA_OUTFIFO_UDF_L1_CH2_INT_ST_S  5
/** H264_DMA_OUTFIFO_OVF_L2_CH2_INT_ST : RO; bitpos: [6]; default: 0;
 *  The raw interrupt status bit for the OUTFIFO_OVF_L2_CH_INT interrupt.
 */
#define H264_DMA_OUTFIFO_OVF_L2_CH2_INT_ST    (BIT(6))
#define H264_DMA_OUTFIFO_OVF_L2_CH2_INT_ST_M  (H264_DMA_OUTFIFO_OVF_L2_CH2_INT_ST_V << H264_DMA_OUTFIFO_OVF_L2_CH2_INT_ST_S)
#define H264_DMA_OUTFIFO_OVF_L2_CH2_INT_ST_V  0x00000001U
#define H264_DMA_OUTFIFO_OVF_L2_CH2_INT_ST_S  6
/** H264_DMA_OUTFIFO_UDF_L2_CH2_INT_ST : RO; bitpos: [7]; default: 0;
 *  The raw interrupt status bit for the OUTFIFO_UDF_L2_CH_INT interrupt.
 */
#define H264_DMA_OUTFIFO_UDF_L2_CH2_INT_ST    (BIT(7))
#define H264_DMA_OUTFIFO_UDF_L2_CH2_INT_ST_M  (H264_DMA_OUTFIFO_UDF_L2_CH2_INT_ST_V << H264_DMA_OUTFIFO_UDF_L2_CH2_INT_ST_S)
#define H264_DMA_OUTFIFO_UDF_L2_CH2_INT_ST_V  0x00000001U
#define H264_DMA_OUTFIFO_UDF_L2_CH2_INT_ST_S  7
/** H264_DMA_OUT_DSCR_TASK_OVF_CH2_INT_ST : RO; bitpos: [8]; default: 0;
 *  The raw interrupt status bit for the OUT_DSCR_TASK_OVF_CH_INT interrupt.
 */
#define H264_DMA_OUT_DSCR_TASK_OVF_CH2_INT_ST    (BIT(8))
#define H264_DMA_OUT_DSCR_TASK_OVF_CH2_INT_ST_M  (H264_DMA_OUT_DSCR_TASK_OVF_CH2_INT_ST_V << H264_DMA_OUT_DSCR_TASK_OVF_CH2_INT_ST_S)
#define H264_DMA_OUT_DSCR_TASK_OVF_CH2_INT_ST_V  0x00000001U
#define H264_DMA_OUT_DSCR_TASK_OVF_CH2_INT_ST_S  8

/** H264_DMA_OUT_INT_CLR_CH2_REG register
 *  TX CH2  interrupt clr register
 */
#define H264_DMA_OUT_INT_CLR_CH2_REG (DR_REG_H264_DMA_BASE + 0x210)
/** H264_DMA_OUT_DONE_CH2_INT_CLR : WT; bitpos: [0]; default: 0;
 *  Set this bit to clear the OUT_DONE_CH_INT interrupt.
 */
#define H264_DMA_OUT_DONE_CH2_INT_CLR    (BIT(0))
#define H264_DMA_OUT_DONE_CH2_INT_CLR_M  (H264_DMA_OUT_DONE_CH2_INT_CLR_V << H264_DMA_OUT_DONE_CH2_INT_CLR_S)
#define H264_DMA_OUT_DONE_CH2_INT_CLR_V  0x00000001U
#define H264_DMA_OUT_DONE_CH2_INT_CLR_S  0
/** H264_DMA_OUT_EOF_CH2_INT_CLR : WT; bitpos: [1]; default: 0;
 *  Set this bit to clear the OUT_EOF_CH_INT interrupt.
 */
#define H264_DMA_OUT_EOF_CH2_INT_CLR    (BIT(1))
#define H264_DMA_OUT_EOF_CH2_INT_CLR_M  (H264_DMA_OUT_EOF_CH2_INT_CLR_V << H264_DMA_OUT_EOF_CH2_INT_CLR_S)
#define H264_DMA_OUT_EOF_CH2_INT_CLR_V  0x00000001U
#define H264_DMA_OUT_EOF_CH2_INT_CLR_S  1
/** H264_DMA_OUT_DSCR_ERR_CH2_INT_CLR : WT; bitpos: [2]; default: 0;
 *  Set this bit to clear the OUT_DSCR_ERR_CH_INT interrupt.
 */
#define H264_DMA_OUT_DSCR_ERR_CH2_INT_CLR    (BIT(2))
#define H264_DMA_OUT_DSCR_ERR_CH2_INT_CLR_M  (H264_DMA_OUT_DSCR_ERR_CH2_INT_CLR_V << H264_DMA_OUT_DSCR_ERR_CH2_INT_CLR_S)
#define H264_DMA_OUT_DSCR_ERR_CH2_INT_CLR_V  0x00000001U
#define H264_DMA_OUT_DSCR_ERR_CH2_INT_CLR_S  2
/** H264_DMA_OUT_TOTAL_EOF_CH2_INT_CLR : WT; bitpos: [3]; default: 0;
 *  Set this bit to clear the OUT_TOTAL_EOF_CH_INT interrupt.
 */
#define H264_DMA_OUT_TOTAL_EOF_CH2_INT_CLR    (BIT(3))
#define H264_DMA_OUT_TOTAL_EOF_CH2_INT_CLR_M  (H264_DMA_OUT_TOTAL_EOF_CH2_INT_CLR_V << H264_DMA_OUT_TOTAL_EOF_CH2_INT_CLR_S)
#define H264_DMA_OUT_TOTAL_EOF_CH2_INT_CLR_V  0x00000001U
#define H264_DMA_OUT_TOTAL_EOF_CH2_INT_CLR_S  3
/** H264_DMA_OUTFIFO_OVF_L1_CH2_INT_CLR : WT; bitpos: [4]; default: 0;
 *  Set this bit to clear the OUTFIFO_OVF_L1_CH_INT interrupt.
 */
#define H264_DMA_OUTFIFO_OVF_L1_CH2_INT_CLR    (BIT(4))
#define H264_DMA_OUTFIFO_OVF_L1_CH2_INT_CLR_M  (H264_DMA_OUTFIFO_OVF_L1_CH2_INT_CLR_V << H264_DMA_OUTFIFO_OVF_L1_CH2_INT_CLR_S)
#define H264_DMA_OUTFIFO_OVF_L1_CH2_INT_CLR_V  0x00000001U
#define H264_DMA_OUTFIFO_OVF_L1_CH2_INT_CLR_S  4
/** H264_DMA_OUTFIFO_UDF_L1_CH2_INT_CLR : WT; bitpos: [5]; default: 0;
 *  Set this bit to clear the OUTFIFO_UDF_L1_CH_INT interrupt.
 */
#define H264_DMA_OUTFIFO_UDF_L1_CH2_INT_CLR    (BIT(5))
#define H264_DMA_OUTFIFO_UDF_L1_CH2_INT_CLR_M  (H264_DMA_OUTFIFO_UDF_L1_CH2_INT_CLR_V << H264_DMA_OUTFIFO_UDF_L1_CH2_INT_CLR_S)
#define H264_DMA_OUTFIFO_UDF_L1_CH2_INT_CLR_V  0x00000001U
#define H264_DMA_OUTFIFO_UDF_L1_CH2_INT_CLR_S  5
/** H264_DMA_OUTFIFO_OVF_L2_CH2_INT_CLR : WT; bitpos: [6]; default: 0;
 *  Set this bit to clear the OUTFIFO_OVF_L2_CH_INT interrupt.
 */
#define H264_DMA_OUTFIFO_OVF_L2_CH2_INT_CLR    (BIT(6))
#define H264_DMA_OUTFIFO_OVF_L2_CH2_INT_CLR_M  (H264_DMA_OUTFIFO_OVF_L2_CH2_INT_CLR_V << H264_DMA_OUTFIFO_OVF_L2_CH2_INT_CLR_S)
#define H264_DMA_OUTFIFO_OVF_L2_CH2_INT_CLR_V  0x00000001U
#define H264_DMA_OUTFIFO_OVF_L2_CH2_INT_CLR_S  6
/** H264_DMA_OUTFIFO_UDF_L2_CH2_INT_CLR : WT; bitpos: [7]; default: 0;
 *  Set this bit to clear the OUTFIFO_UDF_L2_CH_INT interrupt.
 */
#define H264_DMA_OUTFIFO_UDF_L2_CH2_INT_CLR    (BIT(7))
#define H264_DMA_OUTFIFO_UDF_L2_CH2_INT_CLR_M  (H264_DMA_OUTFIFO_UDF_L2_CH2_INT_CLR_V << H264_DMA_OUTFIFO_UDF_L2_CH2_INT_CLR_S)
#define H264_DMA_OUTFIFO_UDF_L2_CH2_INT_CLR_V  0x00000001U
#define H264_DMA_OUTFIFO_UDF_L2_CH2_INT_CLR_S  7
/** H264_DMA_OUT_DSCR_TASK_OVF_CH2_INT_CLR : WT; bitpos: [8]; default: 0;
 *  Set this bit to clear the OUT_DSCR_TASK_OVF_CH_INT interrupt.
 */
#define H264_DMA_OUT_DSCR_TASK_OVF_CH2_INT_CLR    (BIT(8))
#define H264_DMA_OUT_DSCR_TASK_OVF_CH2_INT_CLR_M  (H264_DMA_OUT_DSCR_TASK_OVF_CH2_INT_CLR_V << H264_DMA_OUT_DSCR_TASK_OVF_CH2_INT_CLR_S)
#define H264_DMA_OUT_DSCR_TASK_OVF_CH2_INT_CLR_V  0x00000001U
#define H264_DMA_OUT_DSCR_TASK_OVF_CH2_INT_CLR_S  8

/** H264_DMA_OUTFIFO_STATUS_CH2_REG register
 *  TX CH2 outfifo status register
 */
#define H264_DMA_OUTFIFO_STATUS_CH2_REG (DR_REG_H264_DMA_BASE + 0x214)
/** H264_DMA_OUTFIFO_FULL_L2_CH2 : RO; bitpos: [0]; default: 0;
 *  Tx FIFO full signal for Tx channel 2.
 */
#define H264_DMA_OUTFIFO_FULL_L2_CH2    (BIT(0))
#define H264_DMA_OUTFIFO_FULL_L2_CH2_M  (H264_DMA_OUTFIFO_FULL_L2_CH2_V << H264_DMA_OUTFIFO_FULL_L2_CH2_S)
#define H264_DMA_OUTFIFO_FULL_L2_CH2_V  0x00000001U
#define H264_DMA_OUTFIFO_FULL_L2_CH2_S  0
/** H264_DMA_OUTFIFO_EMPTY_L2_CH2 : RO; bitpos: [1]; default: 1;
 *  Tx FIFO empty signal for Tx channel 2.
 */
#define H264_DMA_OUTFIFO_EMPTY_L2_CH2    (BIT(1))
#define H264_DMA_OUTFIFO_EMPTY_L2_CH2_M  (H264_DMA_OUTFIFO_EMPTY_L2_CH2_V << H264_DMA_OUTFIFO_EMPTY_L2_CH2_S)
#define H264_DMA_OUTFIFO_EMPTY_L2_CH2_V  0x00000001U
#define H264_DMA_OUTFIFO_EMPTY_L2_CH2_S  1
/** H264_DMA_OUTFIFO_CNT_L2_CH2 : RO; bitpos: [5:2]; default: 0;
 *  The register stores the byte number of the data in Tx FIFO for Tx channel 2.
 */
#define H264_DMA_OUTFIFO_CNT_L2_CH2    0x0000000FU
#define H264_DMA_OUTFIFO_CNT_L2_CH2_M  (H264_DMA_OUTFIFO_CNT_L2_CH2_V << H264_DMA_OUTFIFO_CNT_L2_CH2_S)
#define H264_DMA_OUTFIFO_CNT_L2_CH2_V  0x0000000FU
#define H264_DMA_OUTFIFO_CNT_L2_CH2_S  2
/** H264_DMA_OUTFIFO_FULL_L1_CH2 : RO; bitpos: [6]; default: 0;
 *  Tx FIFO full signal for Tx channel 2.
 */
#define H264_DMA_OUTFIFO_FULL_L1_CH2    (BIT(6))
#define H264_DMA_OUTFIFO_FULL_L1_CH2_M  (H264_DMA_OUTFIFO_FULL_L1_CH2_V << H264_DMA_OUTFIFO_FULL_L1_CH2_S)
#define H264_DMA_OUTFIFO_FULL_L1_CH2_V  0x00000001U
#define H264_DMA_OUTFIFO_FULL_L1_CH2_S  6
/** H264_DMA_OUTFIFO_EMPTY_L1_CH2 : RO; bitpos: [7]; default: 1;
 *  Tx FIFO empty signal for Tx channel 2.
 */
#define H264_DMA_OUTFIFO_EMPTY_L1_CH2    (BIT(7))
#define H264_DMA_OUTFIFO_EMPTY_L1_CH2_M  (H264_DMA_OUTFIFO_EMPTY_L1_CH2_V << H264_DMA_OUTFIFO_EMPTY_L1_CH2_S)
#define H264_DMA_OUTFIFO_EMPTY_L1_CH2_V  0x00000001U
#define H264_DMA_OUTFIFO_EMPTY_L1_CH2_S  7
/** H264_DMA_OUTFIFO_CNT_L1_CH2 : RO; bitpos: [12:8]; default: 0;
 *  The register stores the byte number of the data in Tx FIFO for Tx channel 2.
 */
#define H264_DMA_OUTFIFO_CNT_L1_CH2    0x0000001FU
#define H264_DMA_OUTFIFO_CNT_L1_CH2_M  (H264_DMA_OUTFIFO_CNT_L1_CH2_V << H264_DMA_OUTFIFO_CNT_L1_CH2_S)
#define H264_DMA_OUTFIFO_CNT_L1_CH2_V  0x0000001FU
#define H264_DMA_OUTFIFO_CNT_L1_CH2_S  8
/** H264_DMA_OUTFIFO_FULL_L3_CH2 : RO; bitpos: [16]; default: 0;
 *  Tx FIFO full signal for Tx channel 2.
 */
#define H264_DMA_OUTFIFO_FULL_L3_CH2    (BIT(16))
#define H264_DMA_OUTFIFO_FULL_L3_CH2_M  (H264_DMA_OUTFIFO_FULL_L3_CH2_V << H264_DMA_OUTFIFO_FULL_L3_CH2_S)
#define H264_DMA_OUTFIFO_FULL_L3_CH2_V  0x00000001U
#define H264_DMA_OUTFIFO_FULL_L3_CH2_S  16
/** H264_DMA_OUTFIFO_EMPTY_L3_CH2 : RO; bitpos: [17]; default: 1;
 *  Tx FIFO empty signal for Tx channel 2.
 */
#define H264_DMA_OUTFIFO_EMPTY_L3_CH2    (BIT(17))
#define H264_DMA_OUTFIFO_EMPTY_L3_CH2_M  (H264_DMA_OUTFIFO_EMPTY_L3_CH2_V << H264_DMA_OUTFIFO_EMPTY_L3_CH2_S)
#define H264_DMA_OUTFIFO_EMPTY_L3_CH2_V  0x00000001U
#define H264_DMA_OUTFIFO_EMPTY_L3_CH2_S  17
/** H264_DMA_OUTFIFO_CNT_L3_CH2 : RO; bitpos: [19:18]; default: 0;
 *  The register stores the byte number of the data in Tx FIFO for Tx channel 2.
 */
#define H264_DMA_OUTFIFO_CNT_L3_CH2    0x00000003U
#define H264_DMA_OUTFIFO_CNT_L3_CH2_M  (H264_DMA_OUTFIFO_CNT_L3_CH2_V << H264_DMA_OUTFIFO_CNT_L3_CH2_S)
#define H264_DMA_OUTFIFO_CNT_L3_CH2_V  0x00000003U
#define H264_DMA_OUTFIFO_CNT_L3_CH2_S  18

/** H264_DMA_OUT_PUSH_CH2_REG register
 *  TX CH2 outfifo push register
 */
#define H264_DMA_OUT_PUSH_CH2_REG (DR_REG_H264_DMA_BASE + 0x218)
/** H264_DMA_OUTFIFO_WDATA_CH2 : R/W; bitpos: [9:0]; default: 0;
 *  This register stores the data that need to be pushed into DMA Tx FIFO.
 */
#define H264_DMA_OUTFIFO_WDATA_CH2    0x000003FFU
#define H264_DMA_OUTFIFO_WDATA_CH2_M  (H264_DMA_OUTFIFO_WDATA_CH2_V << H264_DMA_OUTFIFO_WDATA_CH2_S)
#define H264_DMA_OUTFIFO_WDATA_CH2_V  0x000003FFU
#define H264_DMA_OUTFIFO_WDATA_CH2_S  0
/** H264_DMA_OUTFIFO_PUSH_CH2 : R/W/SC; bitpos: [10]; default: 0;
 *  Set this bit to push data into DMA Tx FIFO.
 */
#define H264_DMA_OUTFIFO_PUSH_CH2    (BIT(10))
#define H264_DMA_OUTFIFO_PUSH_CH2_M  (H264_DMA_OUTFIFO_PUSH_CH2_V << H264_DMA_OUTFIFO_PUSH_CH2_S)
#define H264_DMA_OUTFIFO_PUSH_CH2_V  0x00000001U
#define H264_DMA_OUTFIFO_PUSH_CH2_S  10

/** H264_DMA_OUT_LINK_CONF_CH2_REG register
 *  TX CH2 out_link dscr ctrl register
 */
#define H264_DMA_OUT_LINK_CONF_CH2_REG (DR_REG_H264_DMA_BASE + 0x21c)
/** H264_DMA_OUTLINK_STOP_CH2 : R/W/SC; bitpos: [20]; default: 0;
 *  Set this bit to stop dealing with the outlink descriptors.
 */
#define H264_DMA_OUTLINK_STOP_CH2    (BIT(20))
#define H264_DMA_OUTLINK_STOP_CH2_M  (H264_DMA_OUTLINK_STOP_CH2_V << H264_DMA_OUTLINK_STOP_CH2_S)
#define H264_DMA_OUTLINK_STOP_CH2_V  0x00000001U
#define H264_DMA_OUTLINK_STOP_CH2_S  20
/** H264_DMA_OUTLINK_START_CH2 : R/W/SC; bitpos: [21]; default: 0;
 *  Set this bit to start dealing with the outlink descriptors.
 */
#define H264_DMA_OUTLINK_START_CH2    (BIT(21))
#define H264_DMA_OUTLINK_START_CH2_M  (H264_DMA_OUTLINK_START_CH2_V << H264_DMA_OUTLINK_START_CH2_S)
#define H264_DMA_OUTLINK_START_CH2_V  0x00000001U
#define H264_DMA_OUTLINK_START_CH2_S  21
/** H264_DMA_OUTLINK_RESTART_CH2 : R/W/SC; bitpos: [22]; default: 0;
 *  Set this bit to restart a new outlink from the last address.
 */
#define H264_DMA_OUTLINK_RESTART_CH2    (BIT(22))
#define H264_DMA_OUTLINK_RESTART_CH2_M  (H264_DMA_OUTLINK_RESTART_CH2_V << H264_DMA_OUTLINK_RESTART_CH2_S)
#define H264_DMA_OUTLINK_RESTART_CH2_V  0x00000001U
#define H264_DMA_OUTLINK_RESTART_CH2_S  22
/** H264_DMA_OUTLINK_PARK_CH2 : RO; bitpos: [23]; default: 1;
 *  1: the outlink descriptor's FSM is in idle state.  0: the outlink descriptor's FSM
 *  is working.
 */
#define H264_DMA_OUTLINK_PARK_CH2    (BIT(23))
#define H264_DMA_OUTLINK_PARK_CH2_M  (H264_DMA_OUTLINK_PARK_CH2_V << H264_DMA_OUTLINK_PARK_CH2_S)
#define H264_DMA_OUTLINK_PARK_CH2_V  0x00000001U
#define H264_DMA_OUTLINK_PARK_CH2_S  23

/** H264_DMA_OUT_LINK_ADDR_CH2_REG register
 *  TX CH2 out_link dscr addr register
 */
#define H264_DMA_OUT_LINK_ADDR_CH2_REG (DR_REG_H264_DMA_BASE + 0x220)
/** H264_DMA_OUTLINK_ADDR_CH2 : R/W; bitpos: [31:0]; default: 0;
 *  This register stores the first outlink descriptor's address.
 */
#define H264_DMA_OUTLINK_ADDR_CH2    0xFFFFFFFFU
#define H264_DMA_OUTLINK_ADDR_CH2_M  (H264_DMA_OUTLINK_ADDR_CH2_V << H264_DMA_OUTLINK_ADDR_CH2_S)
#define H264_DMA_OUTLINK_ADDR_CH2_V  0xFFFFFFFFU
#define H264_DMA_OUTLINK_ADDR_CH2_S  0

