espressif/esp-idf/components/soc/esp32p4/register/hw_ver1/soc/h264_dma_reg.h
/** H264_DMA_OUT_LINK_ADDR_CH3_REG register
 *  TX CH3 out_link dscr addr register
 */
#define H264_DMA_OUT_LINK_ADDR_CH3_REG (DR_REG_H264_DMA_BASE + 0x320)
/** H264_DMA_OUTLINK_ADDR_CH3 : R/W; bitpos: [31:0]; default: 0;
 *  This register stores the first outlink descriptor's address.
 */
#define H264_DMA_OUTLINK_ADDR_CH3    0xFFFFFFFFU
#define H264_DMA_OUTLINK_ADDR_CH3_M  (H264_DMA_OUTLINK_ADDR_CH3_V << H264_DMA_OUTLINK_ADDR_CH3_S)
#define H264_DMA_OUTLINK_ADDR_CH3_V  0xFFFFFFFFU
#define H264_DMA_OUTLINK_ADDR_CH3_S  0

/** H264_DMA_OUT_STATE_CH3_REG register
 *  TX CH3 state register
 */
#define H264_DMA_OUT_STATE_CH3_REG (DR_REG_H264_DMA_BASE + 0x324)
/** H264_DMA_OUTLINK_DSCR_ADDR_CH3 : RO; bitpos: [17:0]; default: 0;
 *  This register stores the current outlink descriptor's address.
 */
#define H264_DMA_OUTLINK_DSCR_ADDR_CH3    0x0003FFFFU
#define H264_DMA_OUTLINK_DSCR_ADDR_CH3_M  (H264_DMA_OUTLINK_DSCR_ADDR_CH3_V << H264_DMA_OUTLINK_DSCR_ADDR_CH3_S)
#define H264_DMA_OUTLINK_DSCR_ADDR_CH3_V  0x0003FFFFU
#define H264_DMA_OUTLINK_DSCR_ADDR_CH3_S  0
/** H264_DMA_OUT_DSCR_STATE_CH3 : RO; bitpos: [19:18]; default: 0;
 *  This register stores the current descriptor state machine state.
 */
#define H264_DMA_OUT_DSCR_STATE_CH3    0x00000003U
#define H264_DMA_OUT_DSCR_STATE_CH3_M  (H264_DMA_OUT_DSCR_STATE_CH3_V << H264_DMA_OUT_DSCR_STATE_CH3_S)
#define H264_DMA_OUT_DSCR_STATE_CH3_V  0x00000003U
#define H264_DMA_OUT_DSCR_STATE_CH3_S  18
/** H264_DMA_OUT_STATE_CH3 : RO; bitpos: [23:20]; default: 0;
 *  This register stores the current control module state machine state.
 */
#define H264_DMA_OUT_STATE_CH3    0x0000000FU
#define H264_DMA_OUT_STATE_CH3_M  (H264_DMA_OUT_STATE_CH3_V << H264_DMA_OUT_STATE_CH3_S)
#define H264_DMA_OUT_STATE_CH3_V  0x0000000FU
#define H264_DMA_OUT_STATE_CH3_S  20

/** H264_DMA_OUT_EOF_DES_ADDR_CH3_REG register
 *  TX CH3 eof des addr register
 */
#define H264_DMA_OUT_EOF_DES_ADDR_CH3_REG (DR_REG_H264_DMA_BASE + 0x328)
/** H264_DMA_OUT_EOF_DES_ADDR_CH3 : RO; bitpos: [31:0]; default: 0;
 *  This register stores the address of the inlink descriptor when the EOF bit in this
 *  descriptor is 1.
 */
#define H264_DMA_OUT_EOF_DES_ADDR_CH3    0xFFFFFFFFU
#define H264_DMA_OUT_EOF_DES_ADDR_CH3_M  (H264_DMA_OUT_EOF_DES_ADDR_CH3_V << H264_DMA_OUT_EOF_DES_ADDR_CH3_S)
#define H264_DMA_OUT_EOF_DES_ADDR_CH3_V  0xFFFFFFFFU
#define H264_DMA_OUT_EOF_DES_ADDR_CH3_S  0

/** H264_DMA_OUT_DSCR_CH3_REG register
 *  TX CH3 next dscr addr register
 */
#define H264_DMA_OUT_DSCR_CH3_REG (DR_REG_H264_DMA_BASE + 0x32c)
/** H264_DMA_OUTLINK_DSCR_CH3 : RO; bitpos: [31:0]; default: 0;
 *  The address of the next outlink descriptor address y.
 */
#define H264_DMA_OUTLINK_DSCR_CH3    0xFFFFFFFFU
#define H264_DMA_OUTLINK_DSCR_CH3_M  (H264_DMA_OUTLINK_DSCR_CH3_V << H264_DMA_OUTLINK_DSCR_CH3_S)
#define H264_DMA_OUTLINK_DSCR_CH3_V  0xFFFFFFFFU
#define H264_DMA_OUTLINK_DSCR_CH3_S  0

/** H264_DMA_OUT_DSCR_BF0_CH3_REG register
 *  TX CH3 last dscr addr register
 */
#define H264_DMA_OUT_DSCR_BF0_CH3_REG (DR_REG_H264_DMA_BASE + 0x330)
/** H264_DMA_OUTLINK_DSCR_BF0_CH3 : RO; bitpos: [31:0]; default: 0;
 *  The address of the last outlink descriptor's next address y-1.
 */
#define H264_DMA_OUTLINK_DSCR_BF0_CH3    0xFFFFFFFFU
#define H264_DMA_OUTLINK_DSCR_BF0_CH3_M  (H264_DMA_OUTLINK_DSCR_BF0_CH3_V << H264_DMA_OUTLINK_DSCR_BF0_CH3_S)
#define H264_DMA_OUTLINK_DSCR_BF0_CH3_V  0xFFFFFFFFU
#define H264_DMA_OUTLINK_DSCR_BF0_CH3_S  0

/** H264_DMA_OUT_DSCR_BF1_CH3_REG register
 *  TX CH3 second-to-last dscr addr register
 */
#define H264_DMA_OUT_DSCR_BF1_CH3_REG (DR_REG_H264_DMA_BASE + 0x334)
/** H264_DMA_OUTLINK_DSCR_BF1_CH3 : RO; bitpos: [31:0]; default: 0;
 *  The address of the second-to-last outlink descriptor's next address y-2.
 */
#define H264_DMA_OUTLINK_DSCR_BF1_CH3    0xFFFFFFFFU
#define H264_DMA_OUTLINK_DSCR_BF1_CH3_M  (H264_DMA_OUTLINK_DSCR_BF1_CH3_V << H264_DMA_OUTLINK_DSCR_BF1_CH3_S)
#define H264_DMA_OUTLINK_DSCR_BF1_CH3_V  0xFFFFFFFFU
#define H264_DMA_OUTLINK_DSCR_BF1_CH3_S  0

/** H264_DMA_OUT_ARB_CH3_REG register
 *  TX CH3 arb register
 */
#define H264_DMA_OUT_ARB_CH3_REG (DR_REG_H264_DMA_BASE + 0x33c)
/** H264_DMA_OUT_ARB_TOKEN_NUM_CH3 : R/W; bitpos: [3:0]; default: 1;
 *  Set the max number of token count of arbiter
 */
#define H264_DMA_OUT_ARB_TOKEN_NUM_CH3    0x0000000FU
#define H264_DMA_OUT_ARB_TOKEN_NUM_CH3_M  (H264_DMA_OUT_ARB_TOKEN_NUM_CH3_V << H264_DMA_OUT_ARB_TOKEN_NUM_CH3_S)
#define H264_DMA_OUT_ARB_TOKEN_NUM_CH3_V  0x0000000FU
#define H264_DMA_OUT_ARB_TOKEN_NUM_CH3_S  0
/** H264_DMA_EXTER_OUT_ARB_PRIORITY_CH3 : R/W; bitpos: [5:4]; default: 1;
 *  Set the priority of channel
 */
#define H264_DMA_EXTER_OUT_ARB_PRIORITY_CH3    0x00000003U
#define H264_DMA_EXTER_OUT_ARB_PRIORITY_CH3_M  (H264_DMA_EXTER_OUT_ARB_PRIORITY_CH3_V << H264_DMA_EXTER_OUT_ARB_PRIORITY_CH3_S)
#define H264_DMA_EXTER_OUT_ARB_PRIORITY_CH3_V  0x00000003U
#define H264_DMA_EXTER_OUT_ARB_PRIORITY_CH3_S  4

/** H264_DMA_OUT_ETM_CONF_CH3_REG register
 *  TX CH3 ETM config register
 */
#define H264_DMA_OUT_ETM_CONF_CH3_REG (DR_REG_H264_DMA_BASE + 0x368)
/** H264_DMA_OUT_ETM_EN_CH3 : R/W; bitpos: [0]; default: 0;
 *  Set this bit to 1 to enable ETM task function
 */
#define H264_DMA_OUT_ETM_EN_CH3    (BIT(0))
#define H264_DMA_OUT_ETM_EN_CH3_M  (H264_DMA_OUT_ETM_EN_CH3_V << H264_DMA_OUT_ETM_EN_CH3_S)
#define H264_DMA_OUT_ETM_EN_CH3_V  0x00000001U
#define H264_DMA_OUT_ETM_EN_CH3_S  0
/** H264_DMA_OUT_ETM_LOOP_EN_CH3 : R/W; bitpos: [1]; default: 0;
 *  when this bit is 1, dscr can be processed after receiving a task
 */
#define H264_DMA_OUT_ETM_LOOP_EN_CH3    (BIT(1))
#define H264_DMA_OUT_ETM_LOOP_EN_CH3_M  (H264_DMA_OUT_ETM_LOOP_EN_CH3_V << H264_DMA_OUT_ETM_LOOP_EN_CH3_S)
#define H264_DMA_OUT_ETM_LOOP_EN_CH3_V  0x00000001U
#define H264_DMA_OUT_ETM_LOOP_EN_CH3_S  1
/** H264_DMA_OUT_DSCR_TASK_MAK_CH3 : R/W; bitpos: [3:2]; default: 1;
 *  ETM dscr_ready maximum cache numbers
 */
#define H264_DMA_OUT_DSCR_TASK_MAK_CH3    0x00000003U
#define H264_DMA_OUT_DSCR_TASK_MAK_CH3_M  (H264_DMA_OUT_DSCR_TASK_MAK_CH3_V << H264_DMA_OUT_DSCR_TASK_MAK_CH3_S)
#define H264_DMA_OUT_DSCR_TASK_MAK_CH3_V  0x00000003U
#define H264_DMA_OUT_DSCR_TASK_MAK_CH3_S  2

/** H264_DMA_OUT_BUF_LEN_CH3_REG register
 *  tx CH3 buf len register
 */
#define H264_DMA_OUT_BUF_LEN_CH3_REG (DR_REG_H264_DMA_BASE + 0x370)
/** H264_DMA_OUT_CMDFIFO_BUF_LEN_HB_CH3 : RO; bitpos: [12:0]; default: 0;
 *  only for debug
 */
#define H264_DMA_OUT_CMDFIFO_BUF_LEN_HB_CH3    0x00001FFFU
#define H264_DMA_OUT_CMDFIFO_BUF_LEN_HB_CH3_M  (H264_DMA_OUT_CMDFIFO_BUF_LEN_HB_CH3_V << H264_DMA_OUT_CMDFIFO_BUF_LEN_HB_CH3_S)
#define H264_DMA_OUT_CMDFIFO_BUF_LEN_HB_CH3_V  0x00001FFFU
#define H264_DMA_OUT_CMDFIFO_BUF_LEN_HB_CH3_S  0

/** H264_DMA_OUT_FIFO_BCNT_CH3_REG register
 *  tx CH3 fifo byte cnt register
 */
#define H264_DMA_OUT_FIFO_BCNT_CH3_REG (DR_REG_H264_DMA_BASE + 0x374)
/** H264_DMA_OUT_CMDFIFO_OUTFIFO_BCNT_CH3 : RO; bitpos: [9:0]; default: 0;
 *  only for debug
 */
#define H264_DMA_OUT_CMDFIFO_OUTFIFO_BCNT_CH3    0x000003FFU
#define H264_DMA_OUT_CMDFIFO_OUTFIFO_BCNT_CH3_M  (H264_DMA_OUT_CMDFIFO_OUTFIFO_BCNT_CH3_V << H264_DMA_OUT_CMDFIFO_OUTFIFO_BCNT_CH3_S)
#define H264_DMA_OUT_CMDFIFO_OUTFIFO_BCNT_CH3_V  0x000003FFU
#define H264_DMA_OUT_CMDFIFO_OUTFIFO_BCNT_CH3_S  0

/** H264_DMA_OUT_PUSH_BYTECNT_CH3_REG register
 *  tx CH3 push byte cnt register
 */
#define H264_DMA_OUT_PUSH_BYTECNT_CH3_REG (DR_REG_H264_DMA_BASE + 0x378)
/** H264_DMA_OUT_CMDFIFO_PUSH_BYTECNT_CH3 : RO; bitpos: [7:0]; default: 63;
 *  only for debug
 */
#define H264_DMA_OUT_CMDFIFO_PUSH_BYTECNT_CH3    0x000000FFU
#define H264_DMA_OUT_CMDFIFO_PUSH_BYTECNT_CH3_M  (H264_DMA_OUT_CMDFIFO_PUSH_BYTECNT_CH3_V << H264_DMA_OUT_CMDFIFO_PUSH_BYTECNT_CH3_S)
#define H264_DMA_OUT_CMDFIFO_PUSH_BYTECNT_CH3_V  0x000000FFU
#define H264_DMA_OUT_CMDFIFO_PUSH_BYTECNT_CH3_S  0

