espressif/esp-idf/components/soc/esp32p4/register/hw_ver1/soc/h264_dma_reg.h
/** H264_DMA_OUT_XADDR_CH3_REG register
 *  tx CH3 xaddr register
 */
#define H264_DMA_OUT_XADDR_CH3_REG (DR_REG_H264_DMA_BASE + 0x37c)
/** H264_DMA_OUT_CMDFIFO_XADDR_CH3 : RO; bitpos: [31:0]; default: 0;
 *  only for debug
 */
#define H264_DMA_OUT_CMDFIFO_XADDR_CH3    0xFFFFFFFFU
#define H264_DMA_OUT_CMDFIFO_XADDR_CH3_M  (H264_DMA_OUT_CMDFIFO_XADDR_CH3_V << H264_DMA_OUT_CMDFIFO_XADDR_CH3_S)
#define H264_DMA_OUT_CMDFIFO_XADDR_CH3_V  0xFFFFFFFFU
#define H264_DMA_OUT_CMDFIFO_XADDR_CH3_S  0

/** H264_DMA_OUT_BLOCK_BUF_LEN_CH3_REG register
 *  tx CH3 block buf len register
 */
#define H264_DMA_OUT_BLOCK_BUF_LEN_CH3_REG (DR_REG_H264_DMA_BASE + 0x380)
/** H264_DMA_OUT_BLOCK_BUF_LEN_CH3 : RO; bitpos: [27:0]; default: 0;
 *  only for debug
 */
#define H264_DMA_OUT_BLOCK_BUF_LEN_CH3    0x0FFFFFFFU
#define H264_DMA_OUT_BLOCK_BUF_LEN_CH3_M  (H264_DMA_OUT_BLOCK_BUF_LEN_CH3_V << H264_DMA_OUT_BLOCK_BUF_LEN_CH3_S)
#define H264_DMA_OUT_BLOCK_BUF_LEN_CH3_V  0x0FFFFFFFU
#define H264_DMA_OUT_BLOCK_BUF_LEN_CH3_S  0

/** H264_DMA_OUT_CONF0_CH4_REG register
 *  TX CH4 config0 register
 */
#define H264_DMA_OUT_CONF0_CH4_REG (DR_REG_H264_DMA_BASE + 0x400)
/** H264_DMA_OUT_AUTO_WRBACK_CH4 : R/W; bitpos: [0]; default: 0;
 *  Set this bit to enable automatic outlink-writeback when all the data pointed by
 *  outlink descriptor has been received.
 */
#define H264_DMA_OUT_AUTO_WRBACK_CH4    (BIT(0))
#define H264_DMA_OUT_AUTO_WRBACK_CH4_M  (H264_DMA_OUT_AUTO_WRBACK_CH4_V << H264_DMA_OUT_AUTO_WRBACK_CH4_S)
#define H264_DMA_OUT_AUTO_WRBACK_CH4_V  0x00000001U
#define H264_DMA_OUT_AUTO_WRBACK_CH4_S  0
/** H264_DMA_OUT_EOF_MODE_CH4 : R/W; bitpos: [1]; default: 1;
 *  EOF flag generation mode when receiving data. 1: EOF flag for Tx channel 0 is
 *  generated when data need to read has been popped from FIFO in DMA
 */
#define H264_DMA_OUT_EOF_MODE_CH4    (BIT(1))
#define H264_DMA_OUT_EOF_MODE_CH4_M  (H264_DMA_OUT_EOF_MODE_CH4_V << H264_DMA_OUT_EOF_MODE_CH4_S)
#define H264_DMA_OUT_EOF_MODE_CH4_V  0x00000001U
#define H264_DMA_OUT_EOF_MODE_CH4_S  1
/** H264_DMA_OUTDSCR_BURST_EN_CH4 : R/W; bitpos: [2]; default: 0;
 *  Set this bit to 1 to enable INCR burst transfer for Tx channel 0 reading link
 *  descriptor when accessing internal SRAM.
 */
#define H264_DMA_OUTDSCR_BURST_EN_CH4    (BIT(2))
#define H264_DMA_OUTDSCR_BURST_EN_CH4_M  (H264_DMA_OUTDSCR_BURST_EN_CH4_V << H264_DMA_OUTDSCR_BURST_EN_CH4_S)
#define H264_DMA_OUTDSCR_BURST_EN_CH4_V  0x00000001U
#define H264_DMA_OUTDSCR_BURST_EN_CH4_S  2
/** H264_DMA_OUT_ECC_AES_EN_CH4 : R/W; bitpos: [3]; default: 0;
 *  When access address space is ecc/aes area, this bit should be set to 1. In this
 *  case, the start address of square should be 16-bit aligned. The width of square
 *  multiply byte number of one pixel should be 16-bit aligned.
 */
#define H264_DMA_OUT_ECC_AES_EN_CH4    (BIT(3))
#define H264_DMA_OUT_ECC_AES_EN_CH4_M  (H264_DMA_OUT_ECC_AES_EN_CH4_V << H264_DMA_OUT_ECC_AES_EN_CH4_S)
#define H264_DMA_OUT_ECC_AES_EN_CH4_V  0x00000001U
#define H264_DMA_OUT_ECC_AES_EN_CH4_S  3
/** H264_DMA_OUT_CHECK_OWNER_CH4 : R/W; bitpos: [4]; default: 0;
 *  Set this bit to enable checking the owner attribute of the link descriptor.
 */
#define H264_DMA_OUT_CHECK_OWNER_CH4    (BIT(4))
#define H264_DMA_OUT_CHECK_OWNER_CH4_M  (H264_DMA_OUT_CHECK_OWNER_CH4_V << H264_DMA_OUT_CHECK_OWNER_CH4_S)
#define H264_DMA_OUT_CHECK_OWNER_CH4_V  0x00000001U
#define H264_DMA_OUT_CHECK_OWNER_CH4_S  4
/** H264_DMA_OUT_MEM_BURST_LENGTH_CH4 : R/W; bitpos: [8:6]; default: 0;
 *  Block size of Tx channel 4. 0: single      1: 16 bytes      2: 32 bytes    3: 64
 *  bytes    4: 128 bytes
 */
#define H264_DMA_OUT_MEM_BURST_LENGTH_CH4    0x00000007U
#define H264_DMA_OUT_MEM_BURST_LENGTH_CH4_M  (H264_DMA_OUT_MEM_BURST_LENGTH_CH4_V << H264_DMA_OUT_MEM_BURST_LENGTH_CH4_S)
#define H264_DMA_OUT_MEM_BURST_LENGTH_CH4_V  0x00000007U
#define H264_DMA_OUT_MEM_BURST_LENGTH_CH4_S  6
/** H264_DMA_OUT_PAGE_BOUND_EN_CH4 : R/W; bitpos: [12]; default: 0;
 *  Set this bit to 1 to make sure AXI read data don't cross the address boundary which
 *  define by mem_burst_length
 */
#define H264_DMA_OUT_PAGE_BOUND_EN_CH4    (BIT(12))
#define H264_DMA_OUT_PAGE_BOUND_EN_CH4_M  (H264_DMA_OUT_PAGE_BOUND_EN_CH4_V << H264_DMA_OUT_PAGE_BOUND_EN_CH4_S)
#define H264_DMA_OUT_PAGE_BOUND_EN_CH4_V  0x00000001U
#define H264_DMA_OUT_PAGE_BOUND_EN_CH4_S  12
/** H264_DMA_OUT_ARB_WEIGHT_OPT_DIS_CH4 : R/W; bitpos: [26]; default: 0;
 *  Set this bit to 1 to disable arbiter optimum weight function.
 */
#define H264_DMA_OUT_ARB_WEIGHT_OPT_DIS_CH4    (BIT(26))
#define H264_DMA_OUT_ARB_WEIGHT_OPT_DIS_CH4_M  (H264_DMA_OUT_ARB_WEIGHT_OPT_DIS_CH4_V << H264_DMA_OUT_ARB_WEIGHT_OPT_DIS_CH4_S)
#define H264_DMA_OUT_ARB_WEIGHT_OPT_DIS_CH4_V  0x00000001U
#define H264_DMA_OUT_ARB_WEIGHT_OPT_DIS_CH4_S  26

/** H264_DMA_OUT_INT_RAW_CH4_REG register
 *  TX CH4  interrupt raw register
 */
#define H264_DMA_OUT_INT_RAW_CH4_REG (DR_REG_H264_DMA_BASE + 0x404)
/** H264_DMA_OUT_DONE_CH4_INT_RAW : R/WTC/SS; bitpos: [0]; default: 0;
 *  The raw interrupt bit turns to high level when the last data pointed by one outlink
 *  descriptor has been transmitted to peripherals for Tx channel 0.
 */
#define H264_DMA_OUT_DONE_CH4_INT_RAW    (BIT(0))
#define H264_DMA_OUT_DONE_CH4_INT_RAW_M  (H264_DMA_OUT_DONE_CH4_INT_RAW_V << H264_DMA_OUT_DONE_CH4_INT_RAW_S)
#define H264_DMA_OUT_DONE_CH4_INT_RAW_V  0x00000001U
#define H264_DMA_OUT_DONE_CH4_INT_RAW_S  0
/** H264_DMA_OUT_EOF_CH4_INT_RAW : R/WTC/SS; bitpos: [1]; default: 0;
 *  The raw interrupt bit turns to high level when the last data pointed by one outlink
 *  descriptor has been read from memory for Tx channel 0.
 */
#define H264_DMA_OUT_EOF_CH4_INT_RAW    (BIT(1))
#define H264_DMA_OUT_EOF_CH4_INT_RAW_M  (H264_DMA_OUT_EOF_CH4_INT_RAW_V << H264_DMA_OUT_EOF_CH4_INT_RAW_S)
#define H264_DMA_OUT_EOF_CH4_INT_RAW_V  0x00000001U
#define H264_DMA_OUT_EOF_CH4_INT_RAW_S  1
/** H264_DMA_OUT_DSCR_ERR_CH4_INT_RAW : R/WTC/SS; bitpos: [2]; default: 0;
 *  The raw interrupt bit turns to high level when detecting outlink descriptor error,
 *  including owner error, the second and third word error of outlink descriptor for Tx
 *  channel 0.
 */
#define H264_DMA_OUT_DSCR_ERR_CH4_INT_RAW    (BIT(2))
#define H264_DMA_OUT_DSCR_ERR_CH4_INT_RAW_M  (H264_DMA_OUT_DSCR_ERR_CH4_INT_RAW_V << H264_DMA_OUT_DSCR_ERR_CH4_INT_RAW_S)
#define H264_DMA_OUT_DSCR_ERR_CH4_INT_RAW_V  0x00000001U
#define H264_DMA_OUT_DSCR_ERR_CH4_INT_RAW_S  2
/** H264_DMA_OUT_TOTAL_EOF_CH4_INT_RAW : R/WTC/SS; bitpos: [3]; default: 0;
 *  The raw interrupt bit turns to high level when data corresponding a outlink
 *  (includes one link descriptor or few link descriptors) is transmitted out for Tx
 *  channel 0.
 */
#define H264_DMA_OUT_TOTAL_EOF_CH4_INT_RAW    (BIT(3))
#define H264_DMA_OUT_TOTAL_EOF_CH4_INT_RAW_M  (H264_DMA_OUT_TOTAL_EOF_CH4_INT_RAW_V << H264_DMA_OUT_TOTAL_EOF_CH4_INT_RAW_S)
#define H264_DMA_OUT_TOTAL_EOF_CH4_INT_RAW_V  0x00000001U
#define H264_DMA_OUT_TOTAL_EOF_CH4_INT_RAW_S  3
/** H264_DMA_OUTFIFO_OVF_L1_CH4_INT_RAW : R/WTC/SS; bitpos: [4]; default: 0;
 *  The raw interrupt bit turns to high level when fifo is overflow.
 */
#define H264_DMA_OUTFIFO_OVF_L1_CH4_INT_RAW    (BIT(4))
#define H264_DMA_OUTFIFO_OVF_L1_CH4_INT_RAW_M  (H264_DMA_OUTFIFO_OVF_L1_CH4_INT_RAW_V << H264_DMA_OUTFIFO_OVF_L1_CH4_INT_RAW_S)
#define H264_DMA_OUTFIFO_OVF_L1_CH4_INT_RAW_V  0x00000001U
#define H264_DMA_OUTFIFO_OVF_L1_CH4_INT_RAW_S  4
/** H264_DMA_OUTFIFO_UDF_L1_CH4_INT_RAW : R/WTC/SS; bitpos: [5]; default: 0;
 *  The raw interrupt bit turns to high level when fifo is underflow.
 */
#define H264_DMA_OUTFIFO_UDF_L1_CH4_INT_RAW    (BIT(5))
#define H264_DMA_OUTFIFO_UDF_L1_CH4_INT_RAW_M  (H264_DMA_OUTFIFO_UDF_L1_CH4_INT_RAW_V << H264_DMA_OUTFIFO_UDF_L1_CH4_INT_RAW_S)
#define H264_DMA_OUTFIFO_UDF_L1_CH4_INT_RAW_V  0x00000001U
#define H264_DMA_OUTFIFO_UDF_L1_CH4_INT_RAW_S  5
/** H264_DMA_OUTFIFO_OVF_L2_CH4_INT_RAW : R/WTC/SS; bitpos: [6]; default: 0;
 *  The raw interrupt bit turns to high level when fifo is overflow.
 */
#define H264_DMA_OUTFIFO_OVF_L2_CH4_INT_RAW    (BIT(6))
#define H264_DMA_OUTFIFO_OVF_L2_CH4_INT_RAW_M  (H264_DMA_OUTFIFO_OVF_L2_CH4_INT_RAW_V << H264_DMA_OUTFIFO_OVF_L2_CH4_INT_RAW_S)
#define H264_DMA_OUTFIFO_OVF_L2_CH4_INT_RAW_V  0x00000001U
#define H264_DMA_OUTFIFO_OVF_L2_CH4_INT_RAW_S  6
/** H264_DMA_OUTFIFO_UDF_L2_CH4_INT_RAW : R/WTC/SS; bitpos: [7]; default: 0;
 *  The raw interrupt bit turns to high level when fifo is underflow.
 */
#define H264_DMA_OUTFIFO_UDF_L2_CH4_INT_RAW    (BIT(7))
#define H264_DMA_OUTFIFO_UDF_L2_CH4_INT_RAW_M  (H264_DMA_OUTFIFO_UDF_L2_CH4_INT_RAW_V << H264_DMA_OUTFIFO_UDF_L2_CH4_INT_RAW_S)
#define H264_DMA_OUTFIFO_UDF_L2_CH4_INT_RAW_V  0x00000001U
#define H264_DMA_OUTFIFO_UDF_L2_CH4_INT_RAW_S  7
/** H264_DMA_OUT_DSCR_TASK_OVF_CH4_INT_RAW : R/WTC/SS; bitpos: [8]; default: 0;
 *  The raw interrupt bit turns to high level when dscr ready task fifo is overflow.
 */
#define H264_DMA_OUT_DSCR_TASK_OVF_CH4_INT_RAW    (BIT(8))
#define H264_DMA_OUT_DSCR_TASK_OVF_CH4_INT_RAW_M  (H264_DMA_OUT_DSCR_TASK_OVF_CH4_INT_RAW_V << H264_DMA_OUT_DSCR_TASK_OVF_CH4_INT_RAW_S)
#define H264_DMA_OUT_DSCR_TASK_OVF_CH4_INT_RAW_V  0x00000001U
#define H264_DMA_OUT_DSCR_TASK_OVF_CH4_INT_RAW_S  8

/** H264_DMA_OUT_INT_ENA_CH4_REG register
 *  TX CH4  interrupt ena register
 */
#define H264_DMA_OUT_INT_ENA_CH4_REG (DR_REG_H264_DMA_BASE + 0x408)
/** H264_DMA_OUT_DONE_CH4_INT_ENA : R/W; bitpos: [0]; default: 0;
 *  The interrupt enable bit for the OUT_DONE_CH_INT interrupt.
 */
#define H264_DMA_OUT_DONE_CH4_INT_ENA    (BIT(0))
#define H264_DMA_OUT_DONE_CH4_INT_ENA_M  (H264_DMA_OUT_DONE_CH4_INT_ENA_V << H264_DMA_OUT_DONE_CH4_INT_ENA_S)
#define H264_DMA_OUT_DONE_CH4_INT_ENA_V  0x00000001U
#define H264_DMA_OUT_DONE_CH4_INT_ENA_S  0
/** H264_DMA_OUT_EOF_CH4_INT_ENA : R/W; bitpos: [1]; default: 0;
 *  The interrupt enable bit for the OUT_EOF_CH_INT interrupt.
 */
#define H264_DMA_OUT_EOF_CH4_INT_ENA    (BIT(1))
#define H264_DMA_OUT_EOF_CH4_INT_ENA_M  (H264_DMA_OUT_EOF_CH4_INT_ENA_V << H264_DMA_OUT_EOF_CH4_INT_ENA_S)
#define H264_DMA_OUT_EOF_CH4_INT_ENA_V  0x00000001U
#define H264_DMA_OUT_EOF_CH4_INT_ENA_S  1
/** H264_DMA_OUT_DSCR_ERR_CH4_INT_ENA : R/W; bitpos: [2]; default: 0;
 *  The interrupt enable bit for the OUT_DSCR_ERR_CH_INT interrupt.
 */
#define H264_DMA_OUT_DSCR_ERR_CH4_INT_ENA    (BIT(2))
#define H264_DMA_OUT_DSCR_ERR_CH4_INT_ENA_M  (H264_DMA_OUT_DSCR_ERR_CH4_INT_ENA_V << H264_DMA_OUT_DSCR_ERR_CH4_INT_ENA_S)
#define H264_DMA_OUT_DSCR_ERR_CH4_INT_ENA_V  0x00000001U
#define H264_DMA_OUT_DSCR_ERR_CH4_INT_ENA_S  2
/** H264_DMA_OUT_TOTAL_EOF_CH4_INT_ENA : R/W; bitpos: [3]; default: 0;
 *  The interrupt enable bit for the OUT_TOTAL_EOF_CH_INT interrupt.
 */
#define H264_DMA_OUT_TOTAL_EOF_CH4_INT_ENA    (BIT(3))
#define H264_DMA_OUT_TOTAL_EOF_CH4_INT_ENA_M  (H264_DMA_OUT_TOTAL_EOF_CH4_INT_ENA_V << H264_DMA_OUT_TOTAL_EOF_CH4_INT_ENA_S)
#define H264_DMA_OUT_TOTAL_EOF_CH4_INT_ENA_V  0x00000001U
#define H264_DMA_OUT_TOTAL_EOF_CH4_INT_ENA_S  3
/** H264_DMA_OUTFIFO_OVF_L1_CH4_INT_ENA : R/W; bitpos: [4]; default: 0;
 *  The interrupt enable bit for the OUTFIFO_OVF_L1_CH_INT interrupt.
 */
#define H264_DMA_OUTFIFO_OVF_L1_CH4_INT_ENA    (BIT(4))
#define H264_DMA_OUTFIFO_OVF_L1_CH4_INT_ENA_M  (H264_DMA_OUTFIFO_OVF_L1_CH4_INT_ENA_V << H264_DMA_OUTFIFO_OVF_L1_CH4_INT_ENA_S)
#define H264_DMA_OUTFIFO_OVF_L1_CH4_INT_ENA_V  0x00000001U
#define H264_DMA_OUTFIFO_OVF_L1_CH4_INT_ENA_S  4
/** H264_DMA_OUTFIFO_UDF_L1_CH4_INT_ENA : R/W; bitpos: [5]; default: 0;
 *  The interrupt enable bit for the OUTFIFO_UDF_L1_CH_INT interrupt.
 */
#define H264_DMA_OUTFIFO_UDF_L1_CH4_INT_ENA    (BIT(5))
#define H264_DMA_OUTFIFO_UDF_L1_CH4_INT_ENA_M  (H264_DMA_OUTFIFO_UDF_L1_CH4_INT_ENA_V << H264_DMA_OUTFIFO_UDF_L1_CH4_INT_ENA_S)
#define H264_DMA_OUTFIFO_UDF_L1_CH4_INT_ENA_V  0x00000001U
#define H264_DMA_OUTFIFO_UDF_L1_CH4_INT_ENA_S  5
/** H264_DMA_OUTFIFO_OVF_L2_CH4_INT_ENA : R/W; bitpos: [6]; default: 0;
 *  The interrupt enable bit for the OUTFIFO_OVF_L2_CH_INT interrupt.
 */
#define H264_DMA_OUTFIFO_OVF_L2_CH4_INT_ENA    (BIT(6))
#define H264_DMA_OUTFIFO_OVF_L2_CH4_INT_ENA_M  (H264_DMA_OUTFIFO_OVF_L2_CH4_INT_ENA_V << H264_DMA_OUTFIFO_OVF_L2_CH4_INT_ENA_S)
#define H264_DMA_OUTFIFO_OVF_L2_CH4_INT_ENA_V  0x00000001U
#define H264_DMA_OUTFIFO_OVF_L2_CH4_INT_ENA_S  6
/** H264_DMA_OUTFIFO_UDF_L2_CH4_INT_ENA : R/W; bitpos: [7]; default: 0;
 *  The interrupt enable bit for the OUTFIFO_UDF_L2_CH_INT interrupt.
 */
#define H264_DMA_OUTFIFO_UDF_L2_CH4_INT_ENA    (BIT(7))
#define H264_DMA_OUTFIFO_UDF_L2_CH4_INT_ENA_M  (H264_DMA_OUTFIFO_UDF_L2_CH4_INT_ENA_V << H264_DMA_OUTFIFO_UDF_L2_CH4_INT_ENA_S)
#define H264_DMA_OUTFIFO_UDF_L2_CH4_INT_ENA_V  0x00000001U
#define H264_DMA_OUTFIFO_UDF_L2_CH4_INT_ENA_S  7
/** H264_DMA_OUT_DSCR_TASK_OVF_CH4_INT_ENA : R/W; bitpos: [8]; default: 0;
 *  The interrupt enable bit for the OUT_DSCR_TASK_OVF_CH_INT interrupt.
 */
#define H264_DMA_OUT_DSCR_TASK_OVF_CH4_INT_ENA    (BIT(8))
#define H264_DMA_OUT_DSCR_TASK_OVF_CH4_INT_ENA_M  (H264_DMA_OUT_DSCR_TASK_OVF_CH4_INT_ENA_V << H264_DMA_OUT_DSCR_TASK_OVF_CH4_INT_ENA_S)
#define H264_DMA_OUT_DSCR_TASK_OVF_CH4_INT_ENA_V  0x00000001U
#define H264_DMA_OUT_DSCR_TASK_OVF_CH4_INT_ENA_S  8

/** H264_DMA_OUT_INT_ST_CH4_REG register
 *  TX CH4  interrupt st register
 */
#define H264_DMA_OUT_INT_ST_CH4_REG (DR_REG_H264_DMA_BASE + 0x40c)
/** H264_DMA_OUT_DONE_CH4_INT_ST : RO; bitpos: [0]; default: 0;
 *  The raw interrupt status bit for the OUT_DONE_CH_INT interrupt.
 */
#define H264_DMA_OUT_DONE_CH4_INT_ST    (BIT(0))
#define H264_DMA_OUT_DONE_CH4_INT_ST_M  (H264_DMA_OUT_DONE_CH4_INT_ST_V << H264_DMA_OUT_DONE_CH4_INT_ST_S)
#define H264_DMA_OUT_DONE_CH4_INT_ST_V  0x00000001U
#define H264_DMA_OUT_DONE_CH4_INT_ST_S  0
/** H264_DMA_OUT_EOF_CH4_INT_ST : RO; bitpos: [1]; default: 0;
 *  The raw interrupt status bit for the OUT_EOF_CH_INT interrupt.
 */
#define H264_DMA_OUT_EOF_CH4_INT_ST    (BIT(1))
#define H264_DMA_OUT_EOF_CH4_INT_ST_M  (H264_DMA_OUT_EOF_CH4_INT_ST_V << H264_DMA_OUT_EOF_CH4_INT_ST_S)
#define H264_DMA_OUT_EOF_CH4_INT_ST_V  0x00000001U
#define H264_DMA_OUT_EOF_CH4_INT_ST_S  1
/** H264_DMA_OUT_DSCR_ERR_CH4_INT_ST : RO; bitpos: [2]; default: 0;
 *  The raw interrupt status bit for the OUT_DSCR_ERR_CH_INT interrupt.
 */
#define H264_DMA_OUT_DSCR_ERR_CH4_INT_ST    (BIT(2))
#define H264_DMA_OUT_DSCR_ERR_CH4_INT_ST_M  (H264_DMA_OUT_DSCR_ERR_CH4_INT_ST_V << H264_DMA_OUT_DSCR_ERR_CH4_INT_ST_S)
#define H264_DMA_OUT_DSCR_ERR_CH4_INT_ST_V  0x00000001U
#define H264_DMA_OUT_DSCR_ERR_CH4_INT_ST_S  2
/** H264_DMA_OUT_TOTAL_EOF_CH4_INT_ST : RO; bitpos: [3]; default: 0;
 *  The raw interrupt status bit for the OUT_TOTAL_EOF_CH_INT interrupt.
 */
#define H264_DMA_OUT_TOTAL_EOF_CH4_INT_ST    (BIT(3))
#define H264_DMA_OUT_TOTAL_EOF_CH4_INT_ST_M  (H264_DMA_OUT_TOTAL_EOF_CH4_INT_ST_V << H264_DMA_OUT_TOTAL_EOF_CH4_INT_ST_S)
#define H264_DMA_OUT_TOTAL_EOF_CH4_INT_ST_V  0x00000001U
#define H264_DMA_OUT_TOTAL_EOF_CH4_INT_ST_S  3
/** H264_DMA_OUTFIFO_OVF_L1_CH4_INT_ST : RO; bitpos: [4]; default: 0;
 *  The raw interrupt status bit for the OUTFIFO_OVF_L1_CH_INT interrupt.
 */
#define H264_DMA_OUTFIFO_OVF_L1_CH4_INT_ST    (BIT(4))
#define H264_DMA_OUTFIFO_OVF_L1_CH4_INT_ST_M  (H264_DMA_OUTFIFO_OVF_L1_CH4_INT_ST_V << H264_DMA_OUTFIFO_OVF_L1_CH4_INT_ST_S)
#define H264_DMA_OUTFIFO_OVF_L1_CH4_INT_ST_V  0x00000001U
#define H264_DMA_OUTFIFO_OVF_L1_CH4_INT_ST_S  4
/** H264_DMA_OUTFIFO_UDF_L1_CH4_INT_ST : RO; bitpos: [5]; default: 0;
 *  The raw interrupt status bit for the OUTFIFO_UDF_L1_CH_INT interrupt.
 */
#define H264_DMA_OUTFIFO_UDF_L1_CH4_INT_ST    (BIT(5))
#define H264_DMA_OUTFIFO_UDF_L1_CH4_INT_ST_M  (H264_DMA_OUTFIFO_UDF_L1_CH4_INT_ST_V << H264_DMA_OUTFIFO_UDF_L1_CH4_INT_ST_S)
#define H264_DMA_OUTFIFO_UDF_L1_CH4_INT_ST_V  0x00000001U
#define H264_DMA_OUTFIFO_UDF_L1_CH4_INT_ST_S  5
/** H264_DMA_OUTFIFO_OVF_L2_CH4_INT_ST : RO; bitpos: [6]; default: 0;
 *  The raw interrupt status bit for the OUTFIFO_OVF_L2_CH_INT interrupt.
 */
#define H264_DMA_OUTFIFO_OVF_L2_CH4_INT_ST    (BIT(6))
#define H264_DMA_OUTFIFO_OVF_L2_CH4_INT_ST_M  (H264_DMA_OUTFIFO_OVF_L2_CH4_INT_ST_V << H264_DMA_OUTFIFO_OVF_L2_CH4_INT_ST_S)
#define H264_DMA_OUTFIFO_OVF_L2_CH4_INT_ST_V  0x00000001U
#define H264_DMA_OUTFIFO_OVF_L2_CH4_INT_ST_S  6
/** H264_DMA_OUTFIFO_UDF_L2_CH4_INT_ST : RO; bitpos: [7]; default: 0;
 *  The raw interrupt status bit for the OUTFIFO_UDF_L2_CH_INT interrupt.
 */
#define H264_DMA_OUTFIFO_UDF_L2_CH4_INT_ST    (BIT(7))
#define H264_DMA_OUTFIFO_UDF_L2_CH4_INT_ST_M  (H264_DMA_OUTFIFO_UDF_L2_CH4_INT_ST_V << H264_DMA_OUTFIFO_UDF_L2_CH4_INT_ST_S)
#define H264_DMA_OUTFIFO_UDF_L2_CH4_INT_ST_V  0x00000001U
#define H264_DMA_OUTFIFO_UDF_L2_CH4_INT_ST_S  7
/** H264_DMA_OUT_DSCR_TASK_OVF_CH4_INT_ST : RO; bitpos: [8]; default: 0;
 *  The raw interrupt status bit for the OUT_DSCR_TASK_OVF_CH_INT interrupt.
 */
#define H264_DMA_OUT_DSCR_TASK_OVF_CH4_INT_ST    (BIT(8))
#define H264_DMA_OUT_DSCR_TASK_OVF_CH4_INT_ST_M  (H264_DMA_OUT_DSCR_TASK_OVF_CH4_INT_ST_V << H264_DMA_OUT_DSCR_TASK_OVF_CH4_INT_ST_S)
#define H264_DMA_OUT_DSCR_TASK_OVF_CH4_INT_ST_V  0x00000001U
#define H264_DMA_OUT_DSCR_TASK_OVF_CH4_INT_ST_S  8

/** H264_DMA_OUT_INT_CLR_CH4_REG register
 *  TX CH4  interrupt clr register
 */
#define H264_DMA_OUT_INT_CLR_CH4_REG (DR_REG_H264_DMA_BASE + 0x410)
/** H264_DMA_OUT_DONE_CH4_INT_CLR : WT; bitpos: [0]; default: 0;
 *  Set this bit to clear the OUT_DONE_CH_INT interrupt.
 */
#define H264_DMA_OUT_DONE_CH4_INT_CLR    (BIT(0))
#define H264_DMA_OUT_DONE_CH4_INT_CLR_M  (H264_DMA_OUT_DONE_CH4_INT_CLR_V << H264_DMA_OUT_DONE_CH4_INT_CLR_S)
#define H264_DMA_OUT_DONE_CH4_INT_CLR_V  0x00000001U
#define H264_DMA_OUT_DONE_CH4_INT_CLR_S  0
/** H264_DMA_OUT_EOF_CH4_INT_CLR : WT; bitpos: [1]; default: 0;
 *  Set this bit to clear the OUT_EOF_CH_INT interrupt.
 */
#define H264_DMA_OUT_EOF_CH4_INT_CLR    (BIT(1))
#define H264_DMA_OUT_EOF_CH4_INT_CLR_M  (H264_DMA_OUT_EOF_CH4_INT_CLR_V << H264_DMA_OUT_EOF_CH4_INT_CLR_S)
#define H264_DMA_OUT_EOF_CH4_INT_CLR_V  0x00000001U
#define H264_DMA_OUT_EOF_CH4_INT_CLR_S  1
/** H264_DMA_OUT_DSCR_ERR_CH4_INT_CLR : WT; bitpos: [2]; default: 0;
 *  Set this bit to clear the OUT_DSCR_ERR_CH_INT interrupt.
 */
#define H264_DMA_OUT_DSCR_ERR_CH4_INT_CLR    (BIT(2))
#define H264_DMA_OUT_DSCR_ERR_CH4_INT_CLR_M  (H264_DMA_OUT_DSCR_ERR_CH4_INT_CLR_V << H264_DMA_OUT_DSCR_ERR_CH4_INT_CLR_S)
#define H264_DMA_OUT_DSCR_ERR_CH4_INT_CLR_V  0x00000001U
#define H264_DMA_OUT_DSCR_ERR_CH4_INT_CLR_S  2
/** H264_DMA_OUT_TOTAL_EOF_CH4_INT_CLR : WT; bitpos: [3]; default: 0;
 *  Set this bit to clear the OUT_TOTAL_EOF_CH_INT interrupt.
 */
#define H264_DMA_OUT_TOTAL_EOF_CH4_INT_CLR    (BIT(3))
#define H264_DMA_OUT_TOTAL_EOF_CH4_INT_CLR_M  (H264_DMA_OUT_TOTAL_EOF_CH4_INT_CLR_V << H264_DMA_OUT_TOTAL_EOF_CH4_INT_CLR_S)
#define H264_DMA_OUT_TOTAL_EOF_CH4_INT_CLR_V  0x00000001U
#define H264_DMA_OUT_TOTAL_EOF_CH4_INT_CLR_S  3
/** H264_DMA_OUTFIFO_OVF_L1_CH4_INT_CLR : WT; bitpos: [4]; default: 0;
 *  Set this bit to clear the OUTFIFO_OVF_L1_CH_INT interrupt.
 */
#define H264_DMA_OUTFIFO_OVF_L1_CH4_INT_CLR    (BIT(4))
#define H264_DMA_OUTFIFO_OVF_L1_CH4_INT_CLR_M  (H264_DMA_OUTFIFO_OVF_L1_CH4_INT_CLR_V << H264_DMA_OUTFIFO_OVF_L1_CH4_INT_CLR_S)
#define H264_DMA_OUTFIFO_OVF_L1_CH4_INT_CLR_V  0x00000001U
#define H264_DMA_OUTFIFO_OVF_L1_CH4_INT_CLR_S  4
/** H264_DMA_OUTFIFO_UDF_L1_CH4_INT_CLR : WT; bitpos: [5]; default: 0;
 *  Set this bit to clear the OUTFIFO_UDF_L1_CH_INT interrupt.
 */
#define H264_DMA_OUTFIFO_UDF_L1_CH4_INT_CLR    (BIT(5))
#define H264_DMA_OUTFIFO_UDF_L1_CH4_INT_CLR_M  (H264_DMA_OUTFIFO_UDF_L1_CH4_INT_CLR_V << H264_DMA_OUTFIFO_UDF_L1_CH4_INT_CLR_S)
#define H264_DMA_OUTFIFO_UDF_L1_CH4_INT_CLR_V  0x00000001U
#define H264_DMA_OUTFIFO_UDF_L1_CH4_INT_CLR_S  5
/** H264_DMA_OUTFIFO_OVF_L2_CH4_INT_CLR : WT; bitpos: [6]; default: 0;
 *  Set this bit to clear the OUTFIFO_OVF_L2_CH_INT interrupt.
 */
#define H264_DMA_OUTFIFO_OVF_L2_CH4_INT_CLR    (BIT(6))
#define H264_DMA_OUTFIFO_OVF_L2_CH4_INT_CLR_M  (H264_DMA_OUTFIFO_OVF_L2_CH4_INT_CLR_V << H264_DMA_OUTFIFO_OVF_L2_CH4_INT_CLR_S)
#define H264_DMA_OUTFIFO_OVF_L2_CH4_INT_CLR_V  0x00000001U
#define H264_DMA_OUTFIFO_OVF_L2_CH4_INT_CLR_S  6
/** H264_DMA_OUTFIFO_UDF_L2_CH4_INT_CLR : WT; bitpos: [7]; default: 0;
 *  Set this bit to clear the OUTFIFO_UDF_L2_CH_INT interrupt.
 */
#define H264_DMA_OUTFIFO_UDF_L2_CH4_INT_CLR    (BIT(7))
#define H264_DMA_OUTFIFO_UDF_L2_CH4_INT_CLR_M  (H264_DMA_OUTFIFO_UDF_L2_CH4_INT_CLR_V << H264_DMA_OUTFIFO_UDF_L2_CH4_INT_CLR_S)
#define H264_DMA_OUTFIFO_UDF_L2_CH4_INT_CLR_V  0x00000001U
#define H264_DMA_OUTFIFO_UDF_L2_CH4_INT_CLR_S  7
/** H264_DMA_OUT_DSCR_TASK_OVF_CH4_INT_CLR : WT; bitpos: [8]; default: 0;
 *  Set this bit to clear the OUT_DSCR_TASK_OVF_CH_INT interrupt.
 */
#define H264_DMA_OUT_DSCR_TASK_OVF_CH4_INT_CLR    (BIT(8))
#define H264_DMA_OUT_DSCR_TASK_OVF_CH4_INT_CLR_M  (H264_DMA_OUT_DSCR_TASK_OVF_CH4_INT_CLR_V << H264_DMA_OUT_DSCR_TASK_OVF_CH4_INT_CLR_S)
#define H264_DMA_OUT_DSCR_TASK_OVF_CH4_INT_CLR_V  0x00000001U
#define H264_DMA_OUT_DSCR_TASK_OVF_CH4_INT_CLR_S  8

