espressif/esp-idf/components/soc/esp32p4/register/hw_ver1/soc/h264_dma_reg.h
/** H264_DMA_OUTFIFO_STATUS_CH4_REG register
 *  TX CH4 outfifo status register
 */
#define H264_DMA_OUTFIFO_STATUS_CH4_REG (DR_REG_H264_DMA_BASE + 0x414)
/** H264_DMA_OUTFIFO_FULL_L2_CH4 : RO; bitpos: [0]; default: 0;
 *  Tx FIFO full signal for Tx channel 2.
 */
#define H264_DMA_OUTFIFO_FULL_L2_CH4    (BIT(0))
#define H264_DMA_OUTFIFO_FULL_L2_CH4_M  (H264_DMA_OUTFIFO_FULL_L2_CH4_V << H264_DMA_OUTFIFO_FULL_L2_CH4_S)
#define H264_DMA_OUTFIFO_FULL_L2_CH4_V  0x00000001U
#define H264_DMA_OUTFIFO_FULL_L2_CH4_S  0
/** H264_DMA_OUTFIFO_EMPTY_L2_CH4 : RO; bitpos: [1]; default: 1;
 *  Tx FIFO empty signal for Tx channel 2.
 */
#define H264_DMA_OUTFIFO_EMPTY_L2_CH4    (BIT(1))
#define H264_DMA_OUTFIFO_EMPTY_L2_CH4_M  (H264_DMA_OUTFIFO_EMPTY_L2_CH4_V << H264_DMA_OUTFIFO_EMPTY_L2_CH4_S)
#define H264_DMA_OUTFIFO_EMPTY_L2_CH4_V  0x00000001U
#define H264_DMA_OUTFIFO_EMPTY_L2_CH4_S  1
/** H264_DMA_OUTFIFO_CNT_L2_CH4 : RO; bitpos: [5:2]; default: 0;
 *  The register stores the byte number of the data in Tx FIFO for Tx channel 2.
 */
#define H264_DMA_OUTFIFO_CNT_L2_CH4    0x0000000FU
#define H264_DMA_OUTFIFO_CNT_L2_CH4_M  (H264_DMA_OUTFIFO_CNT_L2_CH4_V << H264_DMA_OUTFIFO_CNT_L2_CH4_S)
#define H264_DMA_OUTFIFO_CNT_L2_CH4_V  0x0000000FU
#define H264_DMA_OUTFIFO_CNT_L2_CH4_S  2
/** H264_DMA_OUTFIFO_FULL_L1_CH4 : RO; bitpos: [6]; default: 0;
 *  Tx FIFO full signal for Tx channel 2.
 */
#define H264_DMA_OUTFIFO_FULL_L1_CH4    (BIT(6))
#define H264_DMA_OUTFIFO_FULL_L1_CH4_M  (H264_DMA_OUTFIFO_FULL_L1_CH4_V << H264_DMA_OUTFIFO_FULL_L1_CH4_S)
#define H264_DMA_OUTFIFO_FULL_L1_CH4_V  0x00000001U
#define H264_DMA_OUTFIFO_FULL_L1_CH4_S  6
/** H264_DMA_OUTFIFO_EMPTY_L1_CH4 : RO; bitpos: [7]; default: 1;
 *  Tx FIFO empty signal for Tx channel 2.
 */
#define H264_DMA_OUTFIFO_EMPTY_L1_CH4    (BIT(7))
#define H264_DMA_OUTFIFO_EMPTY_L1_CH4_M  (H264_DMA_OUTFIFO_EMPTY_L1_CH4_V << H264_DMA_OUTFIFO_EMPTY_L1_CH4_S)
#define H264_DMA_OUTFIFO_EMPTY_L1_CH4_V  0x00000001U
#define H264_DMA_OUTFIFO_EMPTY_L1_CH4_S  7
/** H264_DMA_OUTFIFO_CNT_L1_CH4 : RO; bitpos: [12:8]; default: 0;
 *  The register stores the byte number of the data in Tx FIFO for Tx channel 2.
 */
#define H264_DMA_OUTFIFO_CNT_L1_CH4    0x0000001FU
#define H264_DMA_OUTFIFO_CNT_L1_CH4_M  (H264_DMA_OUTFIFO_CNT_L1_CH4_V << H264_DMA_OUTFIFO_CNT_L1_CH4_S)
#define H264_DMA_OUTFIFO_CNT_L1_CH4_V  0x0000001FU
#define H264_DMA_OUTFIFO_CNT_L1_CH4_S  8
/** H264_DMA_OUTFIFO_FULL_L3_CH4 : RO; bitpos: [16]; default: 0;
 *  Tx FIFO full signal for Tx channel 2.
 */
#define H264_DMA_OUTFIFO_FULL_L3_CH4    (BIT(16))
#define H264_DMA_OUTFIFO_FULL_L3_CH4_M  (H264_DMA_OUTFIFO_FULL_L3_CH4_V << H264_DMA_OUTFIFO_FULL_L3_CH4_S)
#define H264_DMA_OUTFIFO_FULL_L3_CH4_V  0x00000001U
#define H264_DMA_OUTFIFO_FULL_L3_CH4_S  16
/** H264_DMA_OUTFIFO_EMPTY_L3_CH4 : RO; bitpos: [17]; default: 1;
 *  Tx FIFO empty signal for Tx channel 2.
 */
#define H264_DMA_OUTFIFO_EMPTY_L3_CH4    (BIT(17))
#define H264_DMA_OUTFIFO_EMPTY_L3_CH4_M  (H264_DMA_OUTFIFO_EMPTY_L3_CH4_V << H264_DMA_OUTFIFO_EMPTY_L3_CH4_S)
#define H264_DMA_OUTFIFO_EMPTY_L3_CH4_V  0x00000001U
#define H264_DMA_OUTFIFO_EMPTY_L3_CH4_S  17
/** H264_DMA_OUTFIFO_CNT_L3_CH4 : RO; bitpos: [19:18]; default: 0;
 *  The register stores the byte number of the data in Tx FIFO for Tx channel 2.
 */
#define H264_DMA_OUTFIFO_CNT_L3_CH4    0x00000003U
#define H264_DMA_OUTFIFO_CNT_L3_CH4_M  (H264_DMA_OUTFIFO_CNT_L3_CH4_V << H264_DMA_OUTFIFO_CNT_L3_CH4_S)
#define H264_DMA_OUTFIFO_CNT_L3_CH4_V  0x00000003U
#define H264_DMA_OUTFIFO_CNT_L3_CH4_S  18

/** H264_DMA_OUT_PUSH_CH4_REG register
 *  TX CH4 outfifo push register
 */
#define H264_DMA_OUT_PUSH_CH4_REG (DR_REG_H264_DMA_BASE + 0x418)
/** H264_DMA_OUTFIFO_WDATA_CH4 : R/W; bitpos: [9:0]; default: 0;
 *  This register stores the data that need to be pushed into DMA Tx FIFO.
 */
#define H264_DMA_OUTFIFO_WDATA_CH4    0x000003FFU
#define H264_DMA_OUTFIFO_WDATA_CH4_M  (H264_DMA_OUTFIFO_WDATA_CH4_V << H264_DMA_OUTFIFO_WDATA_CH4_S)
#define H264_DMA_OUTFIFO_WDATA_CH4_V  0x000003FFU
#define H264_DMA_OUTFIFO_WDATA_CH4_S  0
/** H264_DMA_OUTFIFO_PUSH_CH4 : R/W/SC; bitpos: [10]; default: 0;
 *  Set this bit to push data into DMA Tx FIFO.
 */
#define H264_DMA_OUTFIFO_PUSH_CH4    (BIT(10))
#define H264_DMA_OUTFIFO_PUSH_CH4_M  (H264_DMA_OUTFIFO_PUSH_CH4_V << H264_DMA_OUTFIFO_PUSH_CH4_S)
#define H264_DMA_OUTFIFO_PUSH_CH4_V  0x00000001U
#define H264_DMA_OUTFIFO_PUSH_CH4_S  10

/** H264_DMA_OUT_LINK_CONF_CH4_REG register
 *  TX CH4 out_link dscr ctrl register
 */
#define H264_DMA_OUT_LINK_CONF_CH4_REG (DR_REG_H264_DMA_BASE + 0x41c)
/** H264_DMA_OUTLINK_STOP_CH4 : R/W/SC; bitpos: [20]; default: 0;
 *  Set this bit to stop dealing with the outlink descriptors.
 */
#define H264_DMA_OUTLINK_STOP_CH4    (BIT(20))
#define H264_DMA_OUTLINK_STOP_CH4_M  (H264_DMA_OUTLINK_STOP_CH4_V << H264_DMA_OUTLINK_STOP_CH4_S)
#define H264_DMA_OUTLINK_STOP_CH4_V  0x00000001U
#define H264_DMA_OUTLINK_STOP_CH4_S  20
/** H264_DMA_OUTLINK_START_CH4 : R/W/SC; bitpos: [21]; default: 0;
 *  Set this bit to start dealing with the outlink descriptors.
 */
#define H264_DMA_OUTLINK_START_CH4    (BIT(21))
#define H264_DMA_OUTLINK_START_CH4_M  (H264_DMA_OUTLINK_START_CH4_V << H264_DMA_OUTLINK_START_CH4_S)
#define H264_DMA_OUTLINK_START_CH4_V  0x00000001U
#define H264_DMA_OUTLINK_START_CH4_S  21
/** H264_DMA_OUTLINK_RESTART_CH4 : R/W/SC; bitpos: [22]; default: 0;
 *  Set this bit to restart a new outlink from the last address.
 */
#define H264_DMA_OUTLINK_RESTART_CH4    (BIT(22))
#define H264_DMA_OUTLINK_RESTART_CH4_M  (H264_DMA_OUTLINK_RESTART_CH4_V << H264_DMA_OUTLINK_RESTART_CH4_S)
#define H264_DMA_OUTLINK_RESTART_CH4_V  0x00000001U
#define H264_DMA_OUTLINK_RESTART_CH4_S  22
/** H264_DMA_OUTLINK_PARK_CH4 : RO; bitpos: [23]; default: 1;
 *  1: the outlink descriptor's FSM is in idle state.  0: the outlink descriptor's FSM
 *  is working.
 */
#define H264_DMA_OUTLINK_PARK_CH4    (BIT(23))
#define H264_DMA_OUTLINK_PARK_CH4_M  (H264_DMA_OUTLINK_PARK_CH4_V << H264_DMA_OUTLINK_PARK_CH4_S)
#define H264_DMA_OUTLINK_PARK_CH4_V  0x00000001U
#define H264_DMA_OUTLINK_PARK_CH4_S  23

