espressif/esp-idf/components/soc/esp32p4/register/hw_ver1/soc/h264_dma_reg.h
/** H264_DMA_OUT_XADDR_CH4_REG register
 *  tx CH4 xaddr register
 */
#define H264_DMA_OUT_XADDR_CH4_REG (DR_REG_H264_DMA_BASE + 0x47c)
/** H264_DMA_OUT_CMDFIFO_XADDR_CH4 : RO; bitpos: [31:0]; default: 0;
 *  only for debug
 */
#define H264_DMA_OUT_CMDFIFO_XADDR_CH4    0xFFFFFFFFU
#define H264_DMA_OUT_CMDFIFO_XADDR_CH4_M  (H264_DMA_OUT_CMDFIFO_XADDR_CH4_V << H264_DMA_OUT_CMDFIFO_XADDR_CH4_S)
#define H264_DMA_OUT_CMDFIFO_XADDR_CH4_V  0xFFFFFFFFU
#define H264_DMA_OUT_CMDFIFO_XADDR_CH4_S  0

/** H264_DMA_OUT_BLOCK_BUF_LEN_CH4_REG register
 *  tx CH4 block buf len register
 */
#define H264_DMA_OUT_BLOCK_BUF_LEN_CH4_REG (DR_REG_H264_DMA_BASE + 0x480)
/** H264_DMA_OUT_BLOCK_BUF_LEN_CH4 : RO; bitpos: [27:0]; default: 0;
 *  only for debug
 */
#define H264_DMA_OUT_BLOCK_BUF_LEN_CH4    0x0FFFFFFFU
#define H264_DMA_OUT_BLOCK_BUF_LEN_CH4_M  (H264_DMA_OUT_BLOCK_BUF_LEN_CH4_V << H264_DMA_OUT_BLOCK_BUF_LEN_CH4_S)
#define H264_DMA_OUT_BLOCK_BUF_LEN_CH4_V  0x0FFFFFFFU
#define H264_DMA_OUT_BLOCK_BUF_LEN_CH4_S  0

/** H264_DMA_IN_CONF0_CH0_REG register
 *  RX CH0 config0 register
 */
#define H264_DMA_IN_CONF0_CH0_REG (DR_REG_H264_DMA_BASE + 0x500)
/** H264_DMA_INDSCR_BURST_EN_CH0 : R/W; bitpos: [2]; default: 0;
 *  Set this bit to 1 to enable INCR burst transfer for Rx transmitting link descriptor
 *  when accessing SRAM.
 */
#define H264_DMA_INDSCR_BURST_EN_CH0    (BIT(2))
#define H264_DMA_INDSCR_BURST_EN_CH0_M  (H264_DMA_INDSCR_BURST_EN_CH0_V << H264_DMA_INDSCR_BURST_EN_CH0_S)
#define H264_DMA_INDSCR_BURST_EN_CH0_V  0x00000001U
#define H264_DMA_INDSCR_BURST_EN_CH0_S  2
/** H264_DMA_IN_ECC_AES_EN_CH0 : R/W; bitpos: [3]; default: 0;
 *  When access address space is ecc/aes area, this bit should be set to 1. In this
 *  case, the start address of square should be 16-bit aligned. The width of square
 *  multiply byte number of one pixel should be 16-bit aligned.
 */
#define H264_DMA_IN_ECC_AES_EN_CH0    (BIT(3))
#define H264_DMA_IN_ECC_AES_EN_CH0_M  (H264_DMA_IN_ECC_AES_EN_CH0_V << H264_DMA_IN_ECC_AES_EN_CH0_S)
#define H264_DMA_IN_ECC_AES_EN_CH0_V  0x00000001U
#define H264_DMA_IN_ECC_AES_EN_CH0_S  3
/** H264_DMA_IN_CHECK_OWNER_CH0 : R/W; bitpos: [4]; default: 0;
 *  Set this bit to enable checking the owner attribute of the link descriptor.
 */
#define H264_DMA_IN_CHECK_OWNER_CH0    (BIT(4))
#define H264_DMA_IN_CHECK_OWNER_CH0_M  (H264_DMA_IN_CHECK_OWNER_CH0_V << H264_DMA_IN_CHECK_OWNER_CH0_S)
#define H264_DMA_IN_CHECK_OWNER_CH0_V  0x00000001U
#define H264_DMA_IN_CHECK_OWNER_CH0_S  4
/** H264_DMA_IN_MEM_BURST_LENGTH_CH0 : R/W; bitpos: [8:6]; default: 0;
 *  Block size of Rx channel 0. 0: single      1: 16 bytes      2: 32 bytes    3: 64
 *  bytes    4: 128 bytes
 */
#define H264_DMA_IN_MEM_BURST_LENGTH_CH0    0x00000007U
#define H264_DMA_IN_MEM_BURST_LENGTH_CH0_M  (H264_DMA_IN_MEM_BURST_LENGTH_CH0_V << H264_DMA_IN_MEM_BURST_LENGTH_CH0_S)
#define H264_DMA_IN_MEM_BURST_LENGTH_CH0_V  0x00000007U
#define H264_DMA_IN_MEM_BURST_LENGTH_CH0_S  6
/** H264_DMA_IN_PAGE_BOUND_EN_CH0 : R/W; bitpos: [12]; default: 0;
 *  Set this bit to 1 to make sure AXI write data don't cross the address boundary
 *  which define by mem_burst_length
 */
#define H264_DMA_IN_PAGE_BOUND_EN_CH0    (BIT(12))
#define H264_DMA_IN_PAGE_BOUND_EN_CH0_M  (H264_DMA_IN_PAGE_BOUND_EN_CH0_V << H264_DMA_IN_PAGE_BOUND_EN_CH0_S)
#define H264_DMA_IN_PAGE_BOUND_EN_CH0_V  0x00000001U
#define H264_DMA_IN_PAGE_BOUND_EN_CH0_S  12
/** H264_DMA_IN_RST_CH0 : R/W; bitpos: [24]; default: 0;
 *  Write 1 then write 0 to this bit to reset Rx channel
 */
#define H264_DMA_IN_RST_CH0    (BIT(24))
#define H264_DMA_IN_RST_CH0_M  (H264_DMA_IN_RST_CH0_V << H264_DMA_IN_RST_CH0_S)
#define H264_DMA_IN_RST_CH0_V  0x00000001U
#define H264_DMA_IN_RST_CH0_S  24
/** H264_DMA_IN_CMD_DISABLE_CH0 : R/W; bitpos: [25]; default: 0;
 *  Write 1 before reset and write 0 after reset
 */
#define H264_DMA_IN_CMD_DISABLE_CH0    (BIT(25))
#define H264_DMA_IN_CMD_DISABLE_CH0_M  (H264_DMA_IN_CMD_DISABLE_CH0_V << H264_DMA_IN_CMD_DISABLE_CH0_S)
#define H264_DMA_IN_CMD_DISABLE_CH0_V  0x00000001U
#define H264_DMA_IN_CMD_DISABLE_CH0_S  25
/** H264_DMA_IN_ARB_WEIGHT_OPT_DIS_CH0 : R/W; bitpos: [26]; default: 0;
 *  Set this bit to 1 to disable arbiter optimum weight function.
 */
#define H264_DMA_IN_ARB_WEIGHT_OPT_DIS_CH0    (BIT(26))
#define H264_DMA_IN_ARB_WEIGHT_OPT_DIS_CH0_M  (H264_DMA_IN_ARB_WEIGHT_OPT_DIS_CH0_V << H264_DMA_IN_ARB_WEIGHT_OPT_DIS_CH0_S)
#define H264_DMA_IN_ARB_WEIGHT_OPT_DIS_CH0_V  0x00000001U
#define H264_DMA_IN_ARB_WEIGHT_OPT_DIS_CH0_S  26

/** H264_DMA_IN_INT_RAW_CH0_REG register
 *  RX CH0  interrupt raw register
 */
#define H264_DMA_IN_INT_RAW_CH0_REG (DR_REG_H264_DMA_BASE + 0x504)
/** H264_DMA_IN_DONE_CH0_INT_RAW : R/WTC/SS; bitpos: [0]; default: 0;
 *  The raw interrupt bit turns to high level when the last data pointed by one inlink
 *  descriptor has been transmitted to peripherals for Rx channel 0.
 */
#define H264_DMA_IN_DONE_CH0_INT_RAW    (BIT(0))
#define H264_DMA_IN_DONE_CH0_INT_RAW_M  (H264_DMA_IN_DONE_CH0_INT_RAW_V << H264_DMA_IN_DONE_CH0_INT_RAW_S)
#define H264_DMA_IN_DONE_CH0_INT_RAW_V  0x00000001U
#define H264_DMA_IN_DONE_CH0_INT_RAW_S  0
/** H264_DMA_IN_SUC_EOF_CH0_INT_RAW : R/WTC/SS; bitpos: [1]; default: 0;
 *  The raw interrupt bit turns to high level when the last data pointed by one inlink
 *  descriptor has been received and no data error is detected for Rx channel 0.
 */
#define H264_DMA_IN_SUC_EOF_CH0_INT_RAW    (BIT(1))
#define H264_DMA_IN_SUC_EOF_CH0_INT_RAW_M  (H264_DMA_IN_SUC_EOF_CH0_INT_RAW_V << H264_DMA_IN_SUC_EOF_CH0_INT_RAW_S)
#define H264_DMA_IN_SUC_EOF_CH0_INT_RAW_V  0x00000001U
#define H264_DMA_IN_SUC_EOF_CH0_INT_RAW_S  1
/** H264_DMA_IN_ERR_EOF_CH0_INT_RAW : R/WTC/SS; bitpos: [2]; default: 0;
 *  The raw interrupt bit turns to high level when the last data pointed by one inlink
 *  descriptor has been received and data error is detected
 */
#define H264_DMA_IN_ERR_EOF_CH0_INT_RAW    (BIT(2))
#define H264_DMA_IN_ERR_EOF_CH0_INT_RAW_M  (H264_DMA_IN_ERR_EOF_CH0_INT_RAW_V << H264_DMA_IN_ERR_EOF_CH0_INT_RAW_S)
#define H264_DMA_IN_ERR_EOF_CH0_INT_RAW_V  0x00000001U
#define H264_DMA_IN_ERR_EOF_CH0_INT_RAW_S  2
/** H264_DMA_IN_DSCR_ERR_CH0_INT_RAW : R/WTC/SS; bitpos: [3]; default: 0;
 *  The raw interrupt bit turns to high level when detecting inlink descriptor error,
 *  including owner error, the second and third word error of inlink descriptor for Rx
 *  channel 0.
 */
#define H264_DMA_IN_DSCR_ERR_CH0_INT_RAW    (BIT(3))
#define H264_DMA_IN_DSCR_ERR_CH0_INT_RAW_M  (H264_DMA_IN_DSCR_ERR_CH0_INT_RAW_V << H264_DMA_IN_DSCR_ERR_CH0_INT_RAW_S)
#define H264_DMA_IN_DSCR_ERR_CH0_INT_RAW_V  0x00000001U
#define H264_DMA_IN_DSCR_ERR_CH0_INT_RAW_S  3
/** H264_DMA_INFIFO_OVF_L1_CH0_INT_RAW : R/WTC/SS; bitpos: [4]; default: 0;
 *  The raw interrupt bit turns to high level when fifo of Rx channel is overflow.
 */
#define H264_DMA_INFIFO_OVF_L1_CH0_INT_RAW    (BIT(4))
#define H264_DMA_INFIFO_OVF_L1_CH0_INT_RAW_M  (H264_DMA_INFIFO_OVF_L1_CH0_INT_RAW_V << H264_DMA_INFIFO_OVF_L1_CH0_INT_RAW_S)
#define H264_DMA_INFIFO_OVF_L1_CH0_INT_RAW_V  0x00000001U
#define H264_DMA_INFIFO_OVF_L1_CH0_INT_RAW_S  4
/** H264_DMA_INFIFO_UDF_L1_CH0_INT_RAW : R/WTC/SS; bitpos: [5]; default: 0;
 *  The raw interrupt bit turns to high level when fifo of Rx channel is underflow.
 */
#define H264_DMA_INFIFO_UDF_L1_CH0_INT_RAW    (BIT(5))
#define H264_DMA_INFIFO_UDF_L1_CH0_INT_RAW_M  (H264_DMA_INFIFO_UDF_L1_CH0_INT_RAW_V << H264_DMA_INFIFO_UDF_L1_CH0_INT_RAW_S)
#define H264_DMA_INFIFO_UDF_L1_CH0_INT_RAW_V  0x00000001U
#define H264_DMA_INFIFO_UDF_L1_CH0_INT_RAW_S  5
/** H264_DMA_INFIFO_OVF_L2_CH0_INT_RAW : R/WTC/SS; bitpos: [6]; default: 0;
 *  The raw interrupt bit turns to high level when fifo of Rx channel is overflow.
 */
#define H264_DMA_INFIFO_OVF_L2_CH0_INT_RAW    (BIT(6))
#define H264_DMA_INFIFO_OVF_L2_CH0_INT_RAW_M  (H264_DMA_INFIFO_OVF_L2_CH0_INT_RAW_V << H264_DMA_INFIFO_OVF_L2_CH0_INT_RAW_S)
#define H264_DMA_INFIFO_OVF_L2_CH0_INT_RAW_V  0x00000001U
#define H264_DMA_INFIFO_OVF_L2_CH0_INT_RAW_S  6
/** H264_DMA_INFIFO_UDF_L2_CH0_INT_RAW : R/WTC/SS; bitpos: [7]; default: 0;
 *  The raw interrupt bit turns to high level when fifo of Rx channel is underflow.
 */
#define H264_DMA_INFIFO_UDF_L2_CH0_INT_RAW    (BIT(7))
#define H264_DMA_INFIFO_UDF_L2_CH0_INT_RAW_M  (H264_DMA_INFIFO_UDF_L2_CH0_INT_RAW_V << H264_DMA_INFIFO_UDF_L2_CH0_INT_RAW_S)
#define H264_DMA_INFIFO_UDF_L2_CH0_INT_RAW_V  0x00000001U
#define H264_DMA_INFIFO_UDF_L2_CH0_INT_RAW_S  7
/** H264_DMA_IN_DSCR_EMPTY_CH0_INT_RAW : R/WTC/SS; bitpos: [8]; default: 0;
 *  The raw interrupt bit turns to high level when the last descriptor is done but fifo
 *  also remain data.
 */
#define H264_DMA_IN_DSCR_EMPTY_CH0_INT_RAW    (BIT(8))
#define H264_DMA_IN_DSCR_EMPTY_CH0_INT_RAW_M  (H264_DMA_IN_DSCR_EMPTY_CH0_INT_RAW_V << H264_DMA_IN_DSCR_EMPTY_CH0_INT_RAW_S)
#define H264_DMA_IN_DSCR_EMPTY_CH0_INT_RAW_V  0x00000001U
#define H264_DMA_IN_DSCR_EMPTY_CH0_INT_RAW_S  8
/** H264_DMA_IN_DSCR_TASK_OVF_CH0_INT_RAW : R/WTC/SS; bitpos: [9]; default: 0;
 *  The raw interrupt bit turns to high level when dscr ready task fifo is overflow.
 */
#define H264_DMA_IN_DSCR_TASK_OVF_CH0_INT_RAW    (BIT(9))
#define H264_DMA_IN_DSCR_TASK_OVF_CH0_INT_RAW_M  (H264_DMA_IN_DSCR_TASK_OVF_CH0_INT_RAW_V << H264_DMA_IN_DSCR_TASK_OVF_CH0_INT_RAW_S)
#define H264_DMA_IN_DSCR_TASK_OVF_CH0_INT_RAW_V  0x00000001U
#define H264_DMA_IN_DSCR_TASK_OVF_CH0_INT_RAW_S  9

/** H264_DMA_IN_INT_ENA_CH0_REG register
 *  RX CH0  interrupt ena register
 */
#define H264_DMA_IN_INT_ENA_CH0_REG (DR_REG_H264_DMA_BASE + 0x508)
/** H264_DMA_IN_DONE_CH0_INT_ENA : R/W; bitpos: [0]; default: 0;
 *  The interrupt enable bit for the IN_DONE_CH_INT interrupt.
 */
#define H264_DMA_IN_DONE_CH0_INT_ENA    (BIT(0))
#define H264_DMA_IN_DONE_CH0_INT_ENA_M  (H264_DMA_IN_DONE_CH0_INT_ENA_V << H264_DMA_IN_DONE_CH0_INT_ENA_S)
#define H264_DMA_IN_DONE_CH0_INT_ENA_V  0x00000001U
#define H264_DMA_IN_DONE_CH0_INT_ENA_S  0
/** H264_DMA_IN_SUC_EOF_CH0_INT_ENA : R/W; bitpos: [1]; default: 0;
 *  The interrupt enable bit for the IN_SUC_EOF_CH_INT interrupt.
 */
#define H264_DMA_IN_SUC_EOF_CH0_INT_ENA    (BIT(1))
#define H264_DMA_IN_SUC_EOF_CH0_INT_ENA_M  (H264_DMA_IN_SUC_EOF_CH0_INT_ENA_V << H264_DMA_IN_SUC_EOF_CH0_INT_ENA_S)
#define H264_DMA_IN_SUC_EOF_CH0_INT_ENA_V  0x00000001U
#define H264_DMA_IN_SUC_EOF_CH0_INT_ENA_S  1
/** H264_DMA_IN_ERR_EOF_CH0_INT_ENA : R/W; bitpos: [2]; default: 0;
 *  The interrupt enable bit for the IN_ERR_EOF_CH_INT interrupt.
 */
#define H264_DMA_IN_ERR_EOF_CH0_INT_ENA    (BIT(2))
#define H264_DMA_IN_ERR_EOF_CH0_INT_ENA_M  (H264_DMA_IN_ERR_EOF_CH0_INT_ENA_V << H264_DMA_IN_ERR_EOF_CH0_INT_ENA_S)
#define H264_DMA_IN_ERR_EOF_CH0_INT_ENA_V  0x00000001U
#define H264_DMA_IN_ERR_EOF_CH0_INT_ENA_S  2
/** H264_DMA_IN_DSCR_ERR_CH0_INT_ENA : R/W; bitpos: [3]; default: 0;
 *  The interrupt enable bit for the IN_DSCR_ERR_CH_INT interrupt.
 */
#define H264_DMA_IN_DSCR_ERR_CH0_INT_ENA    (BIT(3))
#define H264_DMA_IN_DSCR_ERR_CH0_INT_ENA_M  (H264_DMA_IN_DSCR_ERR_CH0_INT_ENA_V << H264_DMA_IN_DSCR_ERR_CH0_INT_ENA_S)
#define H264_DMA_IN_DSCR_ERR_CH0_INT_ENA_V  0x00000001U
#define H264_DMA_IN_DSCR_ERR_CH0_INT_ENA_S  3
/** H264_DMA_INFIFO_OVF_L1_CH0_INT_ENA : R/W; bitpos: [4]; default: 0;
 *  The interrupt enable bit for the INFIFO_OVF_L1_CH_INT interrupt.
 */
#define H264_DMA_INFIFO_OVF_L1_CH0_INT_ENA    (BIT(4))
#define H264_DMA_INFIFO_OVF_L1_CH0_INT_ENA_M  (H264_DMA_INFIFO_OVF_L1_CH0_INT_ENA_V << H264_DMA_INFIFO_OVF_L1_CH0_INT_ENA_S)
#define H264_DMA_INFIFO_OVF_L1_CH0_INT_ENA_V  0x00000001U
#define H264_DMA_INFIFO_OVF_L1_CH0_INT_ENA_S  4
/** H264_DMA_INFIFO_UDF_L1_CH0_INT_ENA : R/W; bitpos: [5]; default: 0;
 *  The interrupt enable bit for the INFIFO_UDF_L1_CH_INT interrupt.
 */
#define H264_DMA_INFIFO_UDF_L1_CH0_INT_ENA    (BIT(5))
#define H264_DMA_INFIFO_UDF_L1_CH0_INT_ENA_M  (H264_DMA_INFIFO_UDF_L1_CH0_INT_ENA_V << H264_DMA_INFIFO_UDF_L1_CH0_INT_ENA_S)
#define H264_DMA_INFIFO_UDF_L1_CH0_INT_ENA_V  0x00000001U
#define H264_DMA_INFIFO_UDF_L1_CH0_INT_ENA_S  5
/** H264_DMA_INFIFO_OVF_L2_CH0_INT_ENA : R/W; bitpos: [6]; default: 0;
 *  The interrupt enable bit for the INFIFO_OVF_L2_CH_INT interrupt.
 */
#define H264_DMA_INFIFO_OVF_L2_CH0_INT_ENA    (BIT(6))
#define H264_DMA_INFIFO_OVF_L2_CH0_INT_ENA_M  (H264_DMA_INFIFO_OVF_L2_CH0_INT_ENA_V << H264_DMA_INFIFO_OVF_L2_CH0_INT_ENA_S)
#define H264_DMA_INFIFO_OVF_L2_CH0_INT_ENA_V  0x00000001U
#define H264_DMA_INFIFO_OVF_L2_CH0_INT_ENA_S  6
/** H264_DMA_INFIFO_UDF_L2_CH0_INT_ENA : R/W; bitpos: [7]; default: 0;
 *  The interrupt enable bit for the INFIFO_UDF_L2_CH_INT interrupt.
 */
#define H264_DMA_INFIFO_UDF_L2_CH0_INT_ENA    (BIT(7))
#define H264_DMA_INFIFO_UDF_L2_CH0_INT_ENA_M  (H264_DMA_INFIFO_UDF_L2_CH0_INT_ENA_V << H264_DMA_INFIFO_UDF_L2_CH0_INT_ENA_S)
#define H264_DMA_INFIFO_UDF_L2_CH0_INT_ENA_V  0x00000001U
#define H264_DMA_INFIFO_UDF_L2_CH0_INT_ENA_S  7
/** H264_DMA_IN_DSCR_EMPTY_CH0_INT_ENA : R/W; bitpos: [8]; default: 0;
 *  The interrupt enable bit for the IN_DSCR_EMPTY_CH_INT interrupt.
 */
#define H264_DMA_IN_DSCR_EMPTY_CH0_INT_ENA    (BIT(8))
#define H264_DMA_IN_DSCR_EMPTY_CH0_INT_ENA_M  (H264_DMA_IN_DSCR_EMPTY_CH0_INT_ENA_V << H264_DMA_IN_DSCR_EMPTY_CH0_INT_ENA_S)
#define H264_DMA_IN_DSCR_EMPTY_CH0_INT_ENA_V  0x00000001U
#define H264_DMA_IN_DSCR_EMPTY_CH0_INT_ENA_S  8
/** H264_DMA_IN_DSCR_TASK_OVF_CH0_INT_ENA : R/W; bitpos: [9]; default: 0;
 *  The interrupt enable bit for the IN_DSCR_TASK_OVF_CH_INT interrupt.
 */
#define H264_DMA_IN_DSCR_TASK_OVF_CH0_INT_ENA    (BIT(9))
#define H264_DMA_IN_DSCR_TASK_OVF_CH0_INT_ENA_M  (H264_DMA_IN_DSCR_TASK_OVF_CH0_INT_ENA_V << H264_DMA_IN_DSCR_TASK_OVF_CH0_INT_ENA_S)
#define H264_DMA_IN_DSCR_TASK_OVF_CH0_INT_ENA_V  0x00000001U
#define H264_DMA_IN_DSCR_TASK_OVF_CH0_INT_ENA_S  9

/** H264_DMA_IN_INT_ST_CH0_REG register
 *  RX CH0  interrupt st register
 */
#define H264_DMA_IN_INT_ST_CH0_REG (DR_REG_H264_DMA_BASE + 0x50c)
/** H264_DMA_IN_DONE_CH0_INT_ST : RO; bitpos: [0]; default: 0;
 *  The raw interrupt status bit for the IN_DONE_CH_INT interrupt.
 */
#define H264_DMA_IN_DONE_CH0_INT_ST    (BIT(0))
#define H264_DMA_IN_DONE_CH0_INT_ST_M  (H264_DMA_IN_DONE_CH0_INT_ST_V << H264_DMA_IN_DONE_CH0_INT_ST_S)
#define H264_DMA_IN_DONE_CH0_INT_ST_V  0x00000001U
#define H264_DMA_IN_DONE_CH0_INT_ST_S  0
/** H264_DMA_IN_SUC_EOF_CH0_INT_ST : RO; bitpos: [1]; default: 0;
 *  The raw interrupt status bit for the IN_SUC_EOF_CH_INT interrupt.
 */
#define H264_DMA_IN_SUC_EOF_CH0_INT_ST    (BIT(1))
#define H264_DMA_IN_SUC_EOF_CH0_INT_ST_M  (H264_DMA_IN_SUC_EOF_CH0_INT_ST_V << H264_DMA_IN_SUC_EOF_CH0_INT_ST_S)
#define H264_DMA_IN_SUC_EOF_CH0_INT_ST_V  0x00000001U
#define H264_DMA_IN_SUC_EOF_CH0_INT_ST_S  1
/** H264_DMA_IN_ERR_EOF_CH0_INT_ST : RO; bitpos: [2]; default: 0;
 *  The raw interrupt status bit for the IN_ERR_EOF_CH_INT interrupt.
 */
#define H264_DMA_IN_ERR_EOF_CH0_INT_ST    (BIT(2))
#define H264_DMA_IN_ERR_EOF_CH0_INT_ST_M  (H264_DMA_IN_ERR_EOF_CH0_INT_ST_V << H264_DMA_IN_ERR_EOF_CH0_INT_ST_S)
#define H264_DMA_IN_ERR_EOF_CH0_INT_ST_V  0x00000001U
#define H264_DMA_IN_ERR_EOF_CH0_INT_ST_S  2
/** H264_DMA_IN_DSCR_ERR_CH0_INT_ST : RO; bitpos: [3]; default: 0;
 *  The raw interrupt status bit for the IN_DSCR_ERR_CH_INT interrupt.
 */
#define H264_DMA_IN_DSCR_ERR_CH0_INT_ST    (BIT(3))
#define H264_DMA_IN_DSCR_ERR_CH0_INT_ST_M  (H264_DMA_IN_DSCR_ERR_CH0_INT_ST_V << H264_DMA_IN_DSCR_ERR_CH0_INT_ST_S)
#define H264_DMA_IN_DSCR_ERR_CH0_INT_ST_V  0x00000001U
#define H264_DMA_IN_DSCR_ERR_CH0_INT_ST_S  3
/** H264_DMA_INFIFO_OVF_L1_CH0_INT_ST : RO; bitpos: [4]; default: 0;
 *  The raw interrupt status bit for the INFIFO_OVF_L1_CH_INT interrupt.
 */
#define H264_DMA_INFIFO_OVF_L1_CH0_INT_ST    (BIT(4))
#define H264_DMA_INFIFO_OVF_L1_CH0_INT_ST_M  (H264_DMA_INFIFO_OVF_L1_CH0_INT_ST_V << H264_DMA_INFIFO_OVF_L1_CH0_INT_ST_S)
#define H264_DMA_INFIFO_OVF_L1_CH0_INT_ST_V  0x00000001U
#define H264_DMA_INFIFO_OVF_L1_CH0_INT_ST_S  4
/** H264_DMA_INFIFO_UDF_L1_CH0_INT_ST : RO; bitpos: [5]; default: 0;
 *  The raw interrupt status bit for the INFIFO_UDF_L1_CH_INT interrupt.
 */
#define H264_DMA_INFIFO_UDF_L1_CH0_INT_ST    (BIT(5))
#define H264_DMA_INFIFO_UDF_L1_CH0_INT_ST_M  (H264_DMA_INFIFO_UDF_L1_CH0_INT_ST_V << H264_DMA_INFIFO_UDF_L1_CH0_INT_ST_S)
#define H264_DMA_INFIFO_UDF_L1_CH0_INT_ST_V  0x00000001U
#define H264_DMA_INFIFO_UDF_L1_CH0_INT_ST_S  5
/** H264_DMA_INFIFO_OVF_L2_CH0_INT_ST : RO; bitpos: [6]; default: 0;
 *  The raw interrupt status bit for the INFIFO_OVF_L2_CH_INT interrupt.
 */
#define H264_DMA_INFIFO_OVF_L2_CH0_INT_ST    (BIT(6))
#define H264_DMA_INFIFO_OVF_L2_CH0_INT_ST_M  (H264_DMA_INFIFO_OVF_L2_CH0_INT_ST_V << H264_DMA_INFIFO_OVF_L2_CH0_INT_ST_S)
#define H264_DMA_INFIFO_OVF_L2_CH0_INT_ST_V  0x00000001U
#define H264_DMA_INFIFO_OVF_L2_CH0_INT_ST_S  6
/** H264_DMA_INFIFO_UDF_L2_CH0_INT_ST : RO; bitpos: [7]; default: 0;
 *  The raw interrupt status bit for the INFIFO_UDF_L2_CH_INT interrupt.
 */
#define H264_DMA_INFIFO_UDF_L2_CH0_INT_ST    (BIT(7))
#define H264_DMA_INFIFO_UDF_L2_CH0_INT_ST_M  (H264_DMA_INFIFO_UDF_L2_CH0_INT_ST_V << H264_DMA_INFIFO_UDF_L2_CH0_INT_ST_S)
#define H264_DMA_INFIFO_UDF_L2_CH0_INT_ST_V  0x00000001U
#define H264_DMA_INFIFO_UDF_L2_CH0_INT_ST_S  7
/** H264_DMA_IN_DSCR_EMPTY_CH0_INT_ST : RO; bitpos: [8]; default: 0;
 *  The raw interrupt status bit for the IN_DSCR_EMPTY_CH_INT interrupt.
 */
#define H264_DMA_IN_DSCR_EMPTY_CH0_INT_ST    (BIT(8))
#define H264_DMA_IN_DSCR_EMPTY_CH0_INT_ST_M  (H264_DMA_IN_DSCR_EMPTY_CH0_INT_ST_V << H264_DMA_IN_DSCR_EMPTY_CH0_INT_ST_S)
#define H264_DMA_IN_DSCR_EMPTY_CH0_INT_ST_V  0x00000001U
#define H264_DMA_IN_DSCR_EMPTY_CH0_INT_ST_S  8
/** H264_DMA_IN_DSCR_TASK_OVF_CH0_INT_ST : RO; bitpos: [9]; default: 0;
 *  The raw interrupt status bit for the IN_DSCR_TASK_OVF_CH_INT interrupt.
 */
#define H264_DMA_IN_DSCR_TASK_OVF_CH0_INT_ST    (BIT(9))
#define H264_DMA_IN_DSCR_TASK_OVF_CH0_INT_ST_M  (H264_DMA_IN_DSCR_TASK_OVF_CH0_INT_ST_V << H264_DMA_IN_DSCR_TASK_OVF_CH0_INT_ST_S)
#define H264_DMA_IN_DSCR_TASK_OVF_CH0_INT_ST_V  0x00000001U
#define H264_DMA_IN_DSCR_TASK_OVF_CH0_INT_ST_S  9

/** H264_DMA_IN_INT_CLR_CH0_REG register
 *  RX CH0  interrupt clr register
 */
#define H264_DMA_IN_INT_CLR_CH0_REG (DR_REG_H264_DMA_BASE + 0x510)
/** H264_DMA_IN_DONE_CH0_INT_CLR : WT; bitpos: [0]; default: 0;
 *  Set this bit to clear the IN_DONE_CH_INT interrupt.
 */
#define H264_DMA_IN_DONE_CH0_INT_CLR    (BIT(0))
#define H264_DMA_IN_DONE_CH0_INT_CLR_M  (H264_DMA_IN_DONE_CH0_INT_CLR_V << H264_DMA_IN_DONE_CH0_INT_CLR_S)
#define H264_DMA_IN_DONE_CH0_INT_CLR_V  0x00000001U
#define H264_DMA_IN_DONE_CH0_INT_CLR_S  0
/** H264_DMA_IN_SUC_EOF_CH0_INT_CLR : WT; bitpos: [1]; default: 0;
 *  Set this bit to clear the IN_SUC_EOF_CH_INT interrupt.
 */
#define H264_DMA_IN_SUC_EOF_CH0_INT_CLR    (BIT(1))
#define H264_DMA_IN_SUC_EOF_CH0_INT_CLR_M  (H264_DMA_IN_SUC_EOF_CH0_INT_CLR_V << H264_DMA_IN_SUC_EOF_CH0_INT_CLR_S)
#define H264_DMA_IN_SUC_EOF_CH0_INT_CLR_V  0x00000001U
#define H264_DMA_IN_SUC_EOF_CH0_INT_CLR_S  1
/** H264_DMA_IN_ERR_EOF_CH0_INT_CLR : WT; bitpos: [2]; default: 0;
 *  Set this bit to clear the IN_ERR_EOF_CH_INT interrupt.
 */
#define H264_DMA_IN_ERR_EOF_CH0_INT_CLR    (BIT(2))
#define H264_DMA_IN_ERR_EOF_CH0_INT_CLR_M  (H264_DMA_IN_ERR_EOF_CH0_INT_CLR_V << H264_DMA_IN_ERR_EOF_CH0_INT_CLR_S)
#define H264_DMA_IN_ERR_EOF_CH0_INT_CLR_V  0x00000001U
#define H264_DMA_IN_ERR_EOF_CH0_INT_CLR_S  2
/** H264_DMA_IN_DSCR_ERR_CH0_INT_CLR : WT; bitpos: [3]; default: 0;
 *  Set this bit to clear the INDSCR_ERR_CH_INT interrupt.
 */
#define H264_DMA_IN_DSCR_ERR_CH0_INT_CLR    (BIT(3))
#define H264_DMA_IN_DSCR_ERR_CH0_INT_CLR_M  (H264_DMA_IN_DSCR_ERR_CH0_INT_CLR_V << H264_DMA_IN_DSCR_ERR_CH0_INT_CLR_S)
#define H264_DMA_IN_DSCR_ERR_CH0_INT_CLR_V  0x00000001U
#define H264_DMA_IN_DSCR_ERR_CH0_INT_CLR_S  3
/** H264_DMA_INFIFO_OVF_L1_CH0_INT_CLR : WT; bitpos: [4]; default: 0;
 *  Set this bit to clear the INFIFO_OVF_L1_CH_INT interrupt.
 */
#define H264_DMA_INFIFO_OVF_L1_CH0_INT_CLR    (BIT(4))
#define H264_DMA_INFIFO_OVF_L1_CH0_INT_CLR_M  (H264_DMA_INFIFO_OVF_L1_CH0_INT_CLR_V << H264_DMA_INFIFO_OVF_L1_CH0_INT_CLR_S)
#define H264_DMA_INFIFO_OVF_L1_CH0_INT_CLR_V  0x00000001U
#define H264_DMA_INFIFO_OVF_L1_CH0_INT_CLR_S  4
/** H264_DMA_INFIFO_UDF_L1_CH0_INT_CLR : WT; bitpos: [5]; default: 0;
 *  Set this bit to clear the INFIFO_UDF_L1_CH_INT interrupt.
 */
#define H264_DMA_INFIFO_UDF_L1_CH0_INT_CLR    (BIT(5))
#define H264_DMA_INFIFO_UDF_L1_CH0_INT_CLR_M  (H264_DMA_INFIFO_UDF_L1_CH0_INT_CLR_V << H264_DMA_INFIFO_UDF_L1_CH0_INT_CLR_S)
#define H264_DMA_INFIFO_UDF_L1_CH0_INT_CLR_V  0x00000001U
#define H264_DMA_INFIFO_UDF_L1_CH0_INT_CLR_S  5
/** H264_DMA_INFIFO_OVF_L2_CH0_INT_CLR : WT; bitpos: [6]; default: 0;
 *  Set this bit to clear the INFIFO_OVF_L2_CH_INT interrupt.
 */
#define H264_DMA_INFIFO_OVF_L2_CH0_INT_CLR    (BIT(6))
#define H264_DMA_INFIFO_OVF_L2_CH0_INT_CLR_M  (H264_DMA_INFIFO_OVF_L2_CH0_INT_CLR_V << H264_DMA_INFIFO_OVF_L2_CH0_INT_CLR_S)
#define H264_DMA_INFIFO_OVF_L2_CH0_INT_CLR_V  0x00000001U
#define H264_DMA_INFIFO_OVF_L2_CH0_INT_CLR_S  6
/** H264_DMA_INFIFO_UDF_L2_CH0_INT_CLR : WT; bitpos: [7]; default: 0;
 *  Set this bit to clear the INFIFO_UDF_L2_CH_INT interrupt.
 */
#define H264_DMA_INFIFO_UDF_L2_CH0_INT_CLR    (BIT(7))
#define H264_DMA_INFIFO_UDF_L2_CH0_INT_CLR_M  (H264_DMA_INFIFO_UDF_L2_CH0_INT_CLR_V << H264_DMA_INFIFO_UDF_L2_CH0_INT_CLR_S)
#define H264_DMA_INFIFO_UDF_L2_CH0_INT_CLR_V  0x00000001U
#define H264_DMA_INFIFO_UDF_L2_CH0_INT_CLR_S  7
/** H264_DMA_IN_DSCR_EMPTY_CH0_INT_CLR : WT; bitpos: [8]; default: 0;
 *  Set this bit to clear the IN_DSCR_EMPTY_CH_INT interrupt.
 */
#define H264_DMA_IN_DSCR_EMPTY_CH0_INT_CLR    (BIT(8))
#define H264_DMA_IN_DSCR_EMPTY_CH0_INT_CLR_M  (H264_DMA_IN_DSCR_EMPTY_CH0_INT_CLR_V << H264_DMA_IN_DSCR_EMPTY_CH0_INT_CLR_S)
#define H264_DMA_IN_DSCR_EMPTY_CH0_INT_CLR_V  0x00000001U
#define H264_DMA_IN_DSCR_EMPTY_CH0_INT_CLR_S  8
/** H264_DMA_IN_DSCR_TASK_OVF_CH0_INT_CLR : WT; bitpos: [9]; default: 0;
 *  Set this bit to clear the IN_DSCR_TASK_OVF_CH_INT interrupt.
 */
#define H264_DMA_IN_DSCR_TASK_OVF_CH0_INT_CLR    (BIT(9))
#define H264_DMA_IN_DSCR_TASK_OVF_CH0_INT_CLR_M  (H264_DMA_IN_DSCR_TASK_OVF_CH0_INT_CLR_V << H264_DMA_IN_DSCR_TASK_OVF_CH0_INT_CLR_S)
#define H264_DMA_IN_DSCR_TASK_OVF_CH0_INT_CLR_V  0x00000001U
#define H264_DMA_IN_DSCR_TASK_OVF_CH0_INT_CLR_S  9

