espressif/esp-idf/components/soc/esp32p4/register/hw_ver1/soc/h264_dma_reg.h
/** H264_DMA_INFIFO_STATUS_CH0_REG register
 *  RX CH0 INFIFO status register
 */
#define H264_DMA_INFIFO_STATUS_CH0_REG (DR_REG_H264_DMA_BASE + 0x514)
/** H264_DMA_INFIFO_FULL_L2_CH0 : RO; bitpos: [0]; default: 0;
 *  Rx FIFO full signal for Rx channel.
 */
#define H264_DMA_INFIFO_FULL_L2_CH0    (BIT(0))
#define H264_DMA_INFIFO_FULL_L2_CH0_M  (H264_DMA_INFIFO_FULL_L2_CH0_V << H264_DMA_INFIFO_FULL_L2_CH0_S)
#define H264_DMA_INFIFO_FULL_L2_CH0_V  0x00000001U
#define H264_DMA_INFIFO_FULL_L2_CH0_S  0
/** H264_DMA_INFIFO_EMPTY_L2_CH0 : RO; bitpos: [1]; default: 1;
 *  Rx FIFO empty signal for Rx channel.
 */
#define H264_DMA_INFIFO_EMPTY_L2_CH0    (BIT(1))
#define H264_DMA_INFIFO_EMPTY_L2_CH0_M  (H264_DMA_INFIFO_EMPTY_L2_CH0_V << H264_DMA_INFIFO_EMPTY_L2_CH0_S)
#define H264_DMA_INFIFO_EMPTY_L2_CH0_V  0x00000001U
#define H264_DMA_INFIFO_EMPTY_L2_CH0_S  1
/** H264_DMA_INFIFO_CNT_L2_CH0 : RO; bitpos: [5:2]; default: 0;
 *  The register stores the byte number of the data in Rx FIFO for Rx channel.
 */
#define H264_DMA_INFIFO_CNT_L2_CH0    0x0000000FU
#define H264_DMA_INFIFO_CNT_L2_CH0_M  (H264_DMA_INFIFO_CNT_L2_CH0_V << H264_DMA_INFIFO_CNT_L2_CH0_S)
#define H264_DMA_INFIFO_CNT_L2_CH0_V  0x0000000FU
#define H264_DMA_INFIFO_CNT_L2_CH0_S  2
/** H264_DMA_INFIFO_FULL_L1_CH0 : RO; bitpos: [6]; default: 0;
 *  Tx FIFO full signal for Tx channel 0.
 */
#define H264_DMA_INFIFO_FULL_L1_CH0    (BIT(6))
#define H264_DMA_INFIFO_FULL_L1_CH0_M  (H264_DMA_INFIFO_FULL_L1_CH0_V << H264_DMA_INFIFO_FULL_L1_CH0_S)
#define H264_DMA_INFIFO_FULL_L1_CH0_V  0x00000001U
#define H264_DMA_INFIFO_FULL_L1_CH0_S  6
/** H264_DMA_INFIFO_EMPTY_L1_CH0 : RO; bitpos: [7]; default: 1;
 *  Tx FIFO empty signal for Tx channel 0.
 */
#define H264_DMA_INFIFO_EMPTY_L1_CH0    (BIT(7))
#define H264_DMA_INFIFO_EMPTY_L1_CH0_M  (H264_DMA_INFIFO_EMPTY_L1_CH0_V << H264_DMA_INFIFO_EMPTY_L1_CH0_S)
#define H264_DMA_INFIFO_EMPTY_L1_CH0_V  0x00000001U
#define H264_DMA_INFIFO_EMPTY_L1_CH0_S  7
/** H264_DMA_INFIFO_CNT_L1_CH0 : RO; bitpos: [12:8]; default: 0;
 *  The register stores the byte number of the data in Tx FIFO for Tx channel 0.
 */
#define H264_DMA_INFIFO_CNT_L1_CH0    0x0000001FU
#define H264_DMA_INFIFO_CNT_L1_CH0_M  (H264_DMA_INFIFO_CNT_L1_CH0_V << H264_DMA_INFIFO_CNT_L1_CH0_S)
#define H264_DMA_INFIFO_CNT_L1_CH0_V  0x0000001FU
#define H264_DMA_INFIFO_CNT_L1_CH0_S  8
/** H264_DMA_INFIFO_FULL_L3_CH0 : RO; bitpos: [16]; default: 0;
 *  Tx FIFO full signal for Tx channel 0.
 */
#define H264_DMA_INFIFO_FULL_L3_CH0    (BIT(16))
#define H264_DMA_INFIFO_FULL_L3_CH0_M  (H264_DMA_INFIFO_FULL_L3_CH0_V << H264_DMA_INFIFO_FULL_L3_CH0_S)
#define H264_DMA_INFIFO_FULL_L3_CH0_V  0x00000001U
#define H264_DMA_INFIFO_FULL_L3_CH0_S  16
/** H264_DMA_INFIFO_EMPTY_L3_CH0 : RO; bitpos: [17]; default: 1;
 *  Tx FIFO empty signal for Tx channel 0.
 */
#define H264_DMA_INFIFO_EMPTY_L3_CH0    (BIT(17))
#define H264_DMA_INFIFO_EMPTY_L3_CH0_M  (H264_DMA_INFIFO_EMPTY_L3_CH0_V << H264_DMA_INFIFO_EMPTY_L3_CH0_S)
#define H264_DMA_INFIFO_EMPTY_L3_CH0_V  0x00000001U
#define H264_DMA_INFIFO_EMPTY_L3_CH0_S  17
/** H264_DMA_INFIFO_CNT_L3_CH0 : RO; bitpos: [19:18]; default: 0;
 *  The register stores the 8byte number of the data in Tx FIFO for Tx channel 0.
 */
#define H264_DMA_INFIFO_CNT_L3_CH0    0x00000003U
#define H264_DMA_INFIFO_CNT_L3_CH0_M  (H264_DMA_INFIFO_CNT_L3_CH0_V << H264_DMA_INFIFO_CNT_L3_CH0_S)
#define H264_DMA_INFIFO_CNT_L3_CH0_V  0x00000003U
#define H264_DMA_INFIFO_CNT_L3_CH0_S  18

/** H264_DMA_IN_POP_CH0_REG register
 *  RX CH0 INFIFO pop register
 */
#define H264_DMA_IN_POP_CH0_REG (DR_REG_H264_DMA_BASE + 0x518)
/** H264_DMA_INFIFO_RDATA_CH0 : RO; bitpos: [10:0]; default: 1024;
 *  This register stores the data popping from DMA Rx FIFO.
 */
#define H264_DMA_INFIFO_RDATA_CH0    0x000007FFU
#define H264_DMA_INFIFO_RDATA_CH0_M  (H264_DMA_INFIFO_RDATA_CH0_V << H264_DMA_INFIFO_RDATA_CH0_S)
#define H264_DMA_INFIFO_RDATA_CH0_V  0x000007FFU
#define H264_DMA_INFIFO_RDATA_CH0_S  0
/** H264_DMA_INFIFO_POP_CH0 : R/W/SC; bitpos: [11]; default: 0;
 *  Set this bit to pop data from DMA Rx FIFO.
 */
#define H264_DMA_INFIFO_POP_CH0    (BIT(11))
#define H264_DMA_INFIFO_POP_CH0_M  (H264_DMA_INFIFO_POP_CH0_V << H264_DMA_INFIFO_POP_CH0_S)
#define H264_DMA_INFIFO_POP_CH0_V  0x00000001U
#define H264_DMA_INFIFO_POP_CH0_S  11

/** H264_DMA_IN_LINK_CONF_CH0_REG register
 *  RX CH0 in_link dscr ctrl register
 */
#define H264_DMA_IN_LINK_CONF_CH0_REG (DR_REG_H264_DMA_BASE + 0x51c)
/** H264_DMA_INLINK_AUTO_RET_CH0 : R/W; bitpos: [20]; default: 1;
 *  Set this bit to return to current inlink descriptor's address, when there are some
 *  errors in current receiving data.
 */
#define H264_DMA_INLINK_AUTO_RET_CH0    (BIT(20))
#define H264_DMA_INLINK_AUTO_RET_CH0_M  (H264_DMA_INLINK_AUTO_RET_CH0_V << H264_DMA_INLINK_AUTO_RET_CH0_S)
#define H264_DMA_INLINK_AUTO_RET_CH0_V  0x00000001U
#define H264_DMA_INLINK_AUTO_RET_CH0_S  20
/** H264_DMA_INLINK_STOP_CH0 : R/W/SC; bitpos: [21]; default: 0;
 *  Set this bit to stop dealing with the inlink descriptors.
 */
#define H264_DMA_INLINK_STOP_CH0    (BIT(21))
#define H264_DMA_INLINK_STOP_CH0_M  (H264_DMA_INLINK_STOP_CH0_V << H264_DMA_INLINK_STOP_CH0_S)
#define H264_DMA_INLINK_STOP_CH0_V  0x00000001U
#define H264_DMA_INLINK_STOP_CH0_S  21
/** H264_DMA_INLINK_START_CH0 : R/W/SC; bitpos: [22]; default: 0;
 *  Set this bit to start dealing with the inlink descriptors.
 */
#define H264_DMA_INLINK_START_CH0    (BIT(22))
#define H264_DMA_INLINK_START_CH0_M  (H264_DMA_INLINK_START_CH0_V << H264_DMA_INLINK_START_CH0_S)
#define H264_DMA_INLINK_START_CH0_V  0x00000001U
#define H264_DMA_INLINK_START_CH0_S  22
/** H264_DMA_INLINK_RESTART_CH0 : R/W/SC; bitpos: [23]; default: 0;
 *  Set this bit to mount a new inlink descriptor.
 */
#define H264_DMA_INLINK_RESTART_CH0    (BIT(23))
#define H264_DMA_INLINK_RESTART_CH0_M  (H264_DMA_INLINK_RESTART_CH0_V << H264_DMA_INLINK_RESTART_CH0_S)
#define H264_DMA_INLINK_RESTART_CH0_V  0x00000001U
#define H264_DMA_INLINK_RESTART_CH0_S  23
/** H264_DMA_INLINK_PARK_CH0 : RO; bitpos: [24]; default: 1;
 *  1: the inlink descriptor's FSM is in idle state.  0: the inlink descriptor's FSM is
 *  working.
 */
#define H264_DMA_INLINK_PARK_CH0    (BIT(24))
#define H264_DMA_INLINK_PARK_CH0_M  (H264_DMA_INLINK_PARK_CH0_V << H264_DMA_INLINK_PARK_CH0_S)
#define H264_DMA_INLINK_PARK_CH0_V  0x00000001U
#define H264_DMA_INLINK_PARK_CH0_S  24

