espressif/esp-idf/components/soc/esp32p4/register/hw_ver1/soc/h264_dma_reg.h
/** H264_DMA_IN_LINK_ADDR_CH0_REG register
 *  RX CH0 in_link dscr addr register
 */
#define H264_DMA_IN_LINK_ADDR_CH0_REG (DR_REG_H264_DMA_BASE + 0x520)
/** H264_DMA_INLINK_ADDR_CH0 : R/W; bitpos: [31:0]; default: 0;
 *  This register stores the first inlink descriptor's address.
 */
#define H264_DMA_INLINK_ADDR_CH0    0xFFFFFFFFU
#define H264_DMA_INLINK_ADDR_CH0_M  (H264_DMA_INLINK_ADDR_CH0_V << H264_DMA_INLINK_ADDR_CH0_S)
#define H264_DMA_INLINK_ADDR_CH0_V  0xFFFFFFFFU
#define H264_DMA_INLINK_ADDR_CH0_S  0

/** H264_DMA_IN_STATE_CH0_REG register
 *  RX CH0 state register
 */
#define H264_DMA_IN_STATE_CH0_REG (DR_REG_H264_DMA_BASE + 0x524)
/** H264_DMA_INLINK_DSCR_ADDR_CH0 : RO; bitpos: [17:0]; default: 0;
 *  This register stores the current inlink descriptor's address.
 */
#define H264_DMA_INLINK_DSCR_ADDR_CH0    0x0003FFFFU
#define H264_DMA_INLINK_DSCR_ADDR_CH0_M  (H264_DMA_INLINK_DSCR_ADDR_CH0_V << H264_DMA_INLINK_DSCR_ADDR_CH0_S)
#define H264_DMA_INLINK_DSCR_ADDR_CH0_V  0x0003FFFFU
#define H264_DMA_INLINK_DSCR_ADDR_CH0_S  0
/** H264_DMA_IN_DSCR_STATE_CH0 : RO; bitpos: [19:18]; default: 0;
 *  This register stores the current descriptor state machine state.
 */
#define H264_DMA_IN_DSCR_STATE_CH0    0x00000003U
#define H264_DMA_IN_DSCR_STATE_CH0_M  (H264_DMA_IN_DSCR_STATE_CH0_V << H264_DMA_IN_DSCR_STATE_CH0_S)
#define H264_DMA_IN_DSCR_STATE_CH0_V  0x00000003U
#define H264_DMA_IN_DSCR_STATE_CH0_S  18
/** H264_DMA_IN_STATE_CH0 : RO; bitpos: [22:20]; default: 0;
 *  This register stores the current control module state machine state.
 */
#define H264_DMA_IN_STATE_CH0    0x00000007U
#define H264_DMA_IN_STATE_CH0_M  (H264_DMA_IN_STATE_CH0_V << H264_DMA_IN_STATE_CH0_S)
#define H264_DMA_IN_STATE_CH0_V  0x00000007U
#define H264_DMA_IN_STATE_CH0_S  20
/** H264_DMA_IN_RESET_AVAIL_CH0 : RO; bitpos: [23]; default: 1;
 *  This register indicate that if the channel reset is safety.
 */
#define H264_DMA_IN_RESET_AVAIL_CH0    (BIT(23))
#define H264_DMA_IN_RESET_AVAIL_CH0_M  (H264_DMA_IN_RESET_AVAIL_CH0_V << H264_DMA_IN_RESET_AVAIL_CH0_S)
#define H264_DMA_IN_RESET_AVAIL_CH0_V  0x00000001U
#define H264_DMA_IN_RESET_AVAIL_CH0_S  23

/** H264_DMA_IN_SUC_EOF_DES_ADDR_CH0_REG register
 *  RX CH0 eof des addr register
 */
#define H264_DMA_IN_SUC_EOF_DES_ADDR_CH0_REG (DR_REG_H264_DMA_BASE + 0x528)
/** H264_DMA_IN_SUC_EOF_DES_ADDR_CH0 : RO; bitpos: [31:0]; default: 0;
 *  This register stores the address of the inlink descriptor when the EOF bit in this
 *  descriptor is 1.
 */
#define H264_DMA_IN_SUC_EOF_DES_ADDR_CH0    0xFFFFFFFFU
#define H264_DMA_IN_SUC_EOF_DES_ADDR_CH0_M  (H264_DMA_IN_SUC_EOF_DES_ADDR_CH0_V << H264_DMA_IN_SUC_EOF_DES_ADDR_CH0_S)
#define H264_DMA_IN_SUC_EOF_DES_ADDR_CH0_V  0xFFFFFFFFU
#define H264_DMA_IN_SUC_EOF_DES_ADDR_CH0_S  0

/** H264_DMA_IN_ERR_EOF_DES_ADDR_CH0_REG register
 *  RX CH0 err eof des addr register
 */
#define H264_DMA_IN_ERR_EOF_DES_ADDR_CH0_REG (DR_REG_H264_DMA_BASE + 0x52c)
/** H264_DMA_IN_ERR_EOF_DES_ADDR_CH0 : RO; bitpos: [31:0]; default: 0;
 *  This register stores the address of the inlink descriptor when there are some
 *  errors in current receiving data.
 */
#define H264_DMA_IN_ERR_EOF_DES_ADDR_CH0    0xFFFFFFFFU
#define H264_DMA_IN_ERR_EOF_DES_ADDR_CH0_M  (H264_DMA_IN_ERR_EOF_DES_ADDR_CH0_V << H264_DMA_IN_ERR_EOF_DES_ADDR_CH0_S)
#define H264_DMA_IN_ERR_EOF_DES_ADDR_CH0_V  0xFFFFFFFFU
#define H264_DMA_IN_ERR_EOF_DES_ADDR_CH0_S  0

/** H264_DMA_IN_DSCR_CH0_REG register
 *  RX CH0 next dscr addr register
 */
#define H264_DMA_IN_DSCR_CH0_REG (DR_REG_H264_DMA_BASE + 0x530)
/** H264_DMA_INLINK_DSCR_CH0 : RO; bitpos: [31:0]; default: 0;
 *  The address of the next inlink descriptor address x.
 */
#define H264_DMA_INLINK_DSCR_CH0    0xFFFFFFFFU
#define H264_DMA_INLINK_DSCR_CH0_M  (H264_DMA_INLINK_DSCR_CH0_V << H264_DMA_INLINK_DSCR_CH0_S)
#define H264_DMA_INLINK_DSCR_CH0_V  0xFFFFFFFFU
#define H264_DMA_INLINK_DSCR_CH0_S  0

/** H264_DMA_IN_DSCR_BF0_CH0_REG register
 *  RX CH0 last dscr addr register
 */
#define H264_DMA_IN_DSCR_BF0_CH0_REG (DR_REG_H264_DMA_BASE + 0x534)
/** H264_DMA_INLINK_DSCR_BF0_CH0 : RO; bitpos: [31:0]; default: 0;
 *  The address of the last inlink descriptor's next address x-1.
 */
#define H264_DMA_INLINK_DSCR_BF0_CH0    0xFFFFFFFFU
#define H264_DMA_INLINK_DSCR_BF0_CH0_M  (H264_DMA_INLINK_DSCR_BF0_CH0_V << H264_DMA_INLINK_DSCR_BF0_CH0_S)
#define H264_DMA_INLINK_DSCR_BF0_CH0_V  0xFFFFFFFFU
#define H264_DMA_INLINK_DSCR_BF0_CH0_S  0

/** H264_DMA_IN_DSCR_BF1_CH0_REG register
 *  RX CH0 second-to-last dscr addr register
 */
#define H264_DMA_IN_DSCR_BF1_CH0_REG (DR_REG_H264_DMA_BASE + 0x538)
/** H264_DMA_INLINK_DSCR_BF1_CH0 : RO; bitpos: [31:0]; default: 0;
 *  The address of the second-to-last inlink descriptor's next address x-2.
 */
#define H264_DMA_INLINK_DSCR_BF1_CH0    0xFFFFFFFFU
#define H264_DMA_INLINK_DSCR_BF1_CH0_M  (H264_DMA_INLINK_DSCR_BF1_CH0_V << H264_DMA_INLINK_DSCR_BF1_CH0_S)
#define H264_DMA_INLINK_DSCR_BF1_CH0_V  0xFFFFFFFFU
#define H264_DMA_INLINK_DSCR_BF1_CH0_S  0

/** H264_DMA_IN_ARB_CH0_REG register
 *  RX CH0 arb register
 */
#define H264_DMA_IN_ARB_CH0_REG (DR_REG_H264_DMA_BASE + 0x540)
/** H264_DMA_IN_ARB_TOKEN_NUM_CH0 : R/W; bitpos: [3:0]; default: 1;
 *  Set the max number of token count of arbiter
 */
#define H264_DMA_IN_ARB_TOKEN_NUM_CH0    0x0000000FU
#define H264_DMA_IN_ARB_TOKEN_NUM_CH0_M  (H264_DMA_IN_ARB_TOKEN_NUM_CH0_V << H264_DMA_IN_ARB_TOKEN_NUM_CH0_S)
#define H264_DMA_IN_ARB_TOKEN_NUM_CH0_V  0x0000000FU
#define H264_DMA_IN_ARB_TOKEN_NUM_CH0_S  0
/** H264_DMA_EXTER_IN_ARB_PRIORITY_CH0 : R/W; bitpos: [5:4]; default: 1;
 *  Set the priority of channel
 */
#define H264_DMA_EXTER_IN_ARB_PRIORITY_CH0    0x00000003U
#define H264_DMA_EXTER_IN_ARB_PRIORITY_CH0_M  (H264_DMA_EXTER_IN_ARB_PRIORITY_CH0_V << H264_DMA_EXTER_IN_ARB_PRIORITY_CH0_S)
#define H264_DMA_EXTER_IN_ARB_PRIORITY_CH0_V  0x00000003U
#define H264_DMA_EXTER_IN_ARB_PRIORITY_CH0_S  4
/** H264_DMA_INTER_IN_ARB_PRIORITY_CH0 : R/W; bitpos: [8:6]; default: 1;
 *  Set the priority of channel
 */
#define H264_DMA_INTER_IN_ARB_PRIORITY_CH0    0x00000007U
#define H264_DMA_INTER_IN_ARB_PRIORITY_CH0_M  (H264_DMA_INTER_IN_ARB_PRIORITY_CH0_V << H264_DMA_INTER_IN_ARB_PRIORITY_CH0_S)
#define H264_DMA_INTER_IN_ARB_PRIORITY_CH0_V  0x00000007U
#define H264_DMA_INTER_IN_ARB_PRIORITY_CH0_S  6

/** H264_DMA_IN_RO_PD_CONF_CH0_REG register
 *  RX CH0 reorder power config register
 */
#define H264_DMA_IN_RO_PD_CONF_CH0_REG (DR_REG_H264_DMA_BASE + 0x548)
/** H264_DMA_IN_RO_RAM_CLK_FO_CH0 : R/W; bitpos: [6]; default: 0;
 *  1: Force to open the clock and bypass the gate-clock when accessing the RAM in DMA.
 *  0: A gate-clock will be used when accessing the RAM in DMA.
 */
#define H264_DMA_IN_RO_RAM_CLK_FO_CH0    (BIT(6))
#define H264_DMA_IN_RO_RAM_CLK_FO_CH0_M  (H264_DMA_IN_RO_RAM_CLK_FO_CH0_V << H264_DMA_IN_RO_RAM_CLK_FO_CH0_S)
#define H264_DMA_IN_RO_RAM_CLK_FO_CH0_V  0x00000001U
#define H264_DMA_IN_RO_RAM_CLK_FO_CH0_S  6

/** H264_DMA_IN_ETM_CONF_CH0_REG register
 *  RX CH0 ETM config register
 */
#define H264_DMA_IN_ETM_CONF_CH0_REG (DR_REG_H264_DMA_BASE + 0x56c)
/** H264_DMA_IN_ETM_EN_CH0 : R/W; bitpos: [0]; default: 0;
 *  Set this bit to 1 to enable ETM task function
 */
#define H264_DMA_IN_ETM_EN_CH0    (BIT(0))
#define H264_DMA_IN_ETM_EN_CH0_M  (H264_DMA_IN_ETM_EN_CH0_V << H264_DMA_IN_ETM_EN_CH0_S)
#define H264_DMA_IN_ETM_EN_CH0_V  0x00000001U
#define H264_DMA_IN_ETM_EN_CH0_S  0
/** H264_DMA_IN_ETM_LOOP_EN_CH0 : R/W; bitpos: [1]; default: 0;
 *  when this bit is 1, dscr can be processed after receiving a task
 */
#define H264_DMA_IN_ETM_LOOP_EN_CH0    (BIT(1))
#define H264_DMA_IN_ETM_LOOP_EN_CH0_M  (H264_DMA_IN_ETM_LOOP_EN_CH0_V << H264_DMA_IN_ETM_LOOP_EN_CH0_S)
#define H264_DMA_IN_ETM_LOOP_EN_CH0_V  0x00000001U
#define H264_DMA_IN_ETM_LOOP_EN_CH0_S  1
/** H264_DMA_IN_DSCR_TASK_MAK_CH0 : R/W; bitpos: [3:2]; default: 1;
 *  ETM dscr_ready maximum cache numbers
 */
#define H264_DMA_IN_DSCR_TASK_MAK_CH0    0x00000003U
#define H264_DMA_IN_DSCR_TASK_MAK_CH0_M  (H264_DMA_IN_DSCR_TASK_MAK_CH0_V << H264_DMA_IN_DSCR_TASK_MAK_CH0_S)
#define H264_DMA_IN_DSCR_TASK_MAK_CH0_V  0x00000003U
#define H264_DMA_IN_DSCR_TASK_MAK_CH0_S  2

