espressif/esp-idf/components/soc/esp32p4/register/hw_ver1/soc/h264_dma_reg.h
/** H264_DMA_IN_DSCR_BF0_CH1_REG register
 *  RX CH1 last dscr addr register
 */
#define H264_DMA_IN_DSCR_BF0_CH1_REG (DR_REG_H264_DMA_BASE + 0x634)
/** H264_DMA_INLINK_DSCR_BF0_CH1 : RO; bitpos: [31:0]; default: 0;
 *  The address of the last inlink descriptor's next address x-1.
 */
#define H264_DMA_INLINK_DSCR_BF0_CH1    0xFFFFFFFFU
#define H264_DMA_INLINK_DSCR_BF0_CH1_M  (H264_DMA_INLINK_DSCR_BF0_CH1_V << H264_DMA_INLINK_DSCR_BF0_CH1_S)
#define H264_DMA_INLINK_DSCR_BF0_CH1_V  0xFFFFFFFFU
#define H264_DMA_INLINK_DSCR_BF0_CH1_S  0

/** H264_DMA_IN_DSCR_BF1_CH1_REG register
 *  RX CH1 second-to-last dscr addr register
 */
#define H264_DMA_IN_DSCR_BF1_CH1_REG (DR_REG_H264_DMA_BASE + 0x638)
/** H264_DMA_INLINK_DSCR_BF1_CH1 : RO; bitpos: [31:0]; default: 0;
 *  The address of the second-to-last inlink descriptor's next address x-2.
 */
#define H264_DMA_INLINK_DSCR_BF1_CH1    0xFFFFFFFFU
#define H264_DMA_INLINK_DSCR_BF1_CH1_M  (H264_DMA_INLINK_DSCR_BF1_CH1_V << H264_DMA_INLINK_DSCR_BF1_CH1_S)
#define H264_DMA_INLINK_DSCR_BF1_CH1_V  0xFFFFFFFFU
#define H264_DMA_INLINK_DSCR_BF1_CH1_S  0

/** H264_DMA_IN_ARB_CH1_REG register
 *  RX CH1 arb register
 */
#define H264_DMA_IN_ARB_CH1_REG (DR_REG_H264_DMA_BASE + 0x640)
/** H264_DMA_IN_ARB_TOKEN_NUM_CH1 : R/W; bitpos: [3:0]; default: 1;
 *  Set the max number of token count of arbiter
 */
#define H264_DMA_IN_ARB_TOKEN_NUM_CH1    0x0000000FU
#define H264_DMA_IN_ARB_TOKEN_NUM_CH1_M  (H264_DMA_IN_ARB_TOKEN_NUM_CH1_V << H264_DMA_IN_ARB_TOKEN_NUM_CH1_S)
#define H264_DMA_IN_ARB_TOKEN_NUM_CH1_V  0x0000000FU
#define H264_DMA_IN_ARB_TOKEN_NUM_CH1_S  0
/** H264_DMA_EXTER_IN_ARB_PRIORITY_CH1 : R/W; bitpos: [5:4]; default: 1;
 *  Set the priority of channel
 */
#define H264_DMA_EXTER_IN_ARB_PRIORITY_CH1    0x00000003U
#define H264_DMA_EXTER_IN_ARB_PRIORITY_CH1_M  (H264_DMA_EXTER_IN_ARB_PRIORITY_CH1_V << H264_DMA_EXTER_IN_ARB_PRIORITY_CH1_S)
#define H264_DMA_EXTER_IN_ARB_PRIORITY_CH1_V  0x00000003U
#define H264_DMA_EXTER_IN_ARB_PRIORITY_CH1_S  4
/** H264_DMA_INTER_IN_ARB_PRIORITY_CH1 : R/W; bitpos: [8:6]; default: 1;
 *  Set the priority of channel
 */
#define H264_DMA_INTER_IN_ARB_PRIORITY_CH1    0x00000007U
#define H264_DMA_INTER_IN_ARB_PRIORITY_CH1_M  (H264_DMA_INTER_IN_ARB_PRIORITY_CH1_V << H264_DMA_INTER_IN_ARB_PRIORITY_CH1_S)
#define H264_DMA_INTER_IN_ARB_PRIORITY_CH1_V  0x00000007U
#define H264_DMA_INTER_IN_ARB_PRIORITY_CH1_S  6

/** H264_DMA_IN_ETM_CONF_CH1_REG register
 *  RX CH1 ETM config register
 */
#define H264_DMA_IN_ETM_CONF_CH1_REG (DR_REG_H264_DMA_BASE + 0x648)
/** H264_DMA_IN_ETM_EN_CH1 : R/W; bitpos: [0]; default: 0;
 *  Set this bit to 1 to enable ETM task function
 */
#define H264_DMA_IN_ETM_EN_CH1    (BIT(0))
#define H264_DMA_IN_ETM_EN_CH1_M  (H264_DMA_IN_ETM_EN_CH1_V << H264_DMA_IN_ETM_EN_CH1_S)
#define H264_DMA_IN_ETM_EN_CH1_V  0x00000001U
#define H264_DMA_IN_ETM_EN_CH1_S  0
/** H264_DMA_IN_ETM_LOOP_EN_CH1 : R/W; bitpos: [1]; default: 0;
 *  when this bit is 1, dscr can be processed after receiving a task
 */
#define H264_DMA_IN_ETM_LOOP_EN_CH1    (BIT(1))
#define H264_DMA_IN_ETM_LOOP_EN_CH1_M  (H264_DMA_IN_ETM_LOOP_EN_CH1_V << H264_DMA_IN_ETM_LOOP_EN_CH1_S)
#define H264_DMA_IN_ETM_LOOP_EN_CH1_V  0x00000001U
#define H264_DMA_IN_ETM_LOOP_EN_CH1_S  1
/** H264_DMA_IN_DSCR_TASK_MAK_CH1 : R/W; bitpos: [3:2]; default: 1;
 *  ETM dscr_ready maximum cache numbers
 */
#define H264_DMA_IN_DSCR_TASK_MAK_CH1    0x00000003U
#define H264_DMA_IN_DSCR_TASK_MAK_CH1_M  (H264_DMA_IN_DSCR_TASK_MAK_CH1_V << H264_DMA_IN_DSCR_TASK_MAK_CH1_S)
#define H264_DMA_IN_DSCR_TASK_MAK_CH1_V  0x00000003U
#define H264_DMA_IN_DSCR_TASK_MAK_CH1_S  2

/** H264_DMA_IN_FIFO_CNT_CH1_REG register
 *  rx CH1 fifo cnt register
 */
#define H264_DMA_IN_FIFO_CNT_CH1_REG (DR_REG_H264_DMA_BASE + 0x680)
/** H264_DMA_IN_CMDFIFO_INFIFO_CNT_CH1 : RO; bitpos: [9:0]; default: 0;
 *  only for debug
 */
#define H264_DMA_IN_CMDFIFO_INFIFO_CNT_CH1    0x000003FFU
#define H264_DMA_IN_CMDFIFO_INFIFO_CNT_CH1_M  (H264_DMA_IN_CMDFIFO_INFIFO_CNT_CH1_V << H264_DMA_IN_CMDFIFO_INFIFO_CNT_CH1_S)
#define H264_DMA_IN_CMDFIFO_INFIFO_CNT_CH1_V  0x000003FFU
#define H264_DMA_IN_CMDFIFO_INFIFO_CNT_CH1_S  0

/** H264_DMA_IN_POP_DATA_CNT_CH1_REG register
 *  rx CH1 pop data cnt register
 */
#define H264_DMA_IN_POP_DATA_CNT_CH1_REG (DR_REG_H264_DMA_BASE + 0x684)
/** H264_DMA_IN_CMDFIFO_POP_DATA_CNT_CH1 : RO; bitpos: [7:0]; default: 7;
 *  only for debug
 */
#define H264_DMA_IN_CMDFIFO_POP_DATA_CNT_CH1    0x000000FFU
#define H264_DMA_IN_CMDFIFO_POP_DATA_CNT_CH1_M  (H264_DMA_IN_CMDFIFO_POP_DATA_CNT_CH1_V << H264_DMA_IN_CMDFIFO_POP_DATA_CNT_CH1_S)
#define H264_DMA_IN_CMDFIFO_POP_DATA_CNT_CH1_V  0x000000FFU
#define H264_DMA_IN_CMDFIFO_POP_DATA_CNT_CH1_S  0

/** H264_DMA_IN_XADDR_CH1_REG register
 *  rx CH1 xaddr register
 */
#define H264_DMA_IN_XADDR_CH1_REG (DR_REG_H264_DMA_BASE + 0x688)
/** H264_DMA_IN_CMDFIFO_XADDR_CH1 : RO; bitpos: [31:0]; default: 0;
 *  only for debug
 */
#define H264_DMA_IN_CMDFIFO_XADDR_CH1    0xFFFFFFFFU
#define H264_DMA_IN_CMDFIFO_XADDR_CH1_M  (H264_DMA_IN_CMDFIFO_XADDR_CH1_V << H264_DMA_IN_CMDFIFO_XADDR_CH1_S)
#define H264_DMA_IN_CMDFIFO_XADDR_CH1_V  0xFFFFFFFFU
#define H264_DMA_IN_CMDFIFO_XADDR_CH1_S  0

/** H264_DMA_IN_BUF_HB_RCV_CH1_REG register
 *  rx CH1 buf len hb rcv register
 */
#define H264_DMA_IN_BUF_HB_RCV_CH1_REG (DR_REG_H264_DMA_BASE + 0x68c)
/** H264_DMA_IN_CMDFIFO_BUF_HB_RCV_CH1 : RO; bitpos: [28:0]; default: 0;
 *  only for debug
 */
#define H264_DMA_IN_CMDFIFO_BUF_HB_RCV_CH1    0x1FFFFFFFU
#define H264_DMA_IN_CMDFIFO_BUF_HB_RCV_CH1_M  (H264_DMA_IN_CMDFIFO_BUF_HB_RCV_CH1_V << H264_DMA_IN_CMDFIFO_BUF_HB_RCV_CH1_S)
#define H264_DMA_IN_CMDFIFO_BUF_HB_RCV_CH1_V  0x1FFFFFFFU
#define H264_DMA_IN_CMDFIFO_BUF_HB_RCV_CH1_S  0

/** H264_DMA_IN_CONF0_CH2_REG register
 *  RX CH2 config0 register
 */
#define H264_DMA_IN_CONF0_CH2_REG (DR_REG_H264_DMA_BASE + 0x700)
/** H264_DMA_INDSCR_BURST_EN_CH2 : R/W; bitpos: [2]; default: 0;
 *  Set this bit to 1 to enable INCR burst transfer for Rx transmitting link descriptor
 *  when accessing SRAM.
 */
#define H264_DMA_INDSCR_BURST_EN_CH2    (BIT(2))
#define H264_DMA_INDSCR_BURST_EN_CH2_M  (H264_DMA_INDSCR_BURST_EN_CH2_V << H264_DMA_INDSCR_BURST_EN_CH2_S)
#define H264_DMA_INDSCR_BURST_EN_CH2_V  0x00000001U
#define H264_DMA_INDSCR_BURST_EN_CH2_S  2
/** H264_DMA_IN_ECC_AES_EN_CH2 : R/W; bitpos: [3]; default: 0;
 *  When access address space is ecc/aes area, this bit should be set to 1. In this
 *  case, the start address of square should be 16-bit aligned. The width of square
 *  multiply byte number of one pixel should be 16-bit aligned.
 */
#define H264_DMA_IN_ECC_AES_EN_CH2    (BIT(3))
#define H264_DMA_IN_ECC_AES_EN_CH2_M  (H264_DMA_IN_ECC_AES_EN_CH2_V << H264_DMA_IN_ECC_AES_EN_CH2_S)
#define H264_DMA_IN_ECC_AES_EN_CH2_V  0x00000001U
#define H264_DMA_IN_ECC_AES_EN_CH2_S  3
/** H264_DMA_IN_CHECK_OWNER_CH2 : R/W; bitpos: [4]; default: 0;
 *  Set this bit to enable checking the owner attribute of the link descriptor.
 */
#define H264_DMA_IN_CHECK_OWNER_CH2    (BIT(4))
#define H264_DMA_IN_CHECK_OWNER_CH2_M  (H264_DMA_IN_CHECK_OWNER_CH2_V << H264_DMA_IN_CHECK_OWNER_CH2_S)
#define H264_DMA_IN_CHECK_OWNER_CH2_V  0x00000001U
#define H264_DMA_IN_CHECK_OWNER_CH2_S  4
/** H264_DMA_IN_MEM_BURST_LENGTH_CH2 : R/W; bitpos: [8:6]; default: 0;
 *  Block size of Rx channel 2. 0: single      1: 16 bytes      2: 32 bytes    3: 64
 *  bytes    4: 128 bytes
 */
#define H264_DMA_IN_MEM_BURST_LENGTH_CH2    0x00000007U
#define H264_DMA_IN_MEM_BURST_LENGTH_CH2_M  (H264_DMA_IN_MEM_BURST_LENGTH_CH2_V << H264_DMA_IN_MEM_BURST_LENGTH_CH2_S)
#define H264_DMA_IN_MEM_BURST_LENGTH_CH2_V  0x00000007U
#define H264_DMA_IN_MEM_BURST_LENGTH_CH2_S  6
/** H264_DMA_IN_PAGE_BOUND_EN_CH2 : R/W; bitpos: [12]; default: 0;
 *  Set this bit to 1 to make sure AXI write data don't cross the address boundary
 *  which define by mem_burst_length
 */
#define H264_DMA_IN_PAGE_BOUND_EN_CH2    (BIT(12))
#define H264_DMA_IN_PAGE_BOUND_EN_CH2_M  (H264_DMA_IN_PAGE_BOUND_EN_CH2_V << H264_DMA_IN_PAGE_BOUND_EN_CH2_S)
#define H264_DMA_IN_PAGE_BOUND_EN_CH2_V  0x00000001U
#define H264_DMA_IN_PAGE_BOUND_EN_CH2_S  12
/** H264_DMA_IN_RST_CH2 : R/W; bitpos: [24]; default: 0;
 *  Write 1 then write 0 to this bit to reset Rx channel
 */
#define H264_DMA_IN_RST_CH2    (BIT(24))
#define H264_DMA_IN_RST_CH2_M  (H264_DMA_IN_RST_CH2_V << H264_DMA_IN_RST_CH2_S)
#define H264_DMA_IN_RST_CH2_V  0x00000001U
#define H264_DMA_IN_RST_CH2_S  24
/** H264_DMA_IN_CMD_DISABLE_CH2 : R/W; bitpos: [25]; default: 0;
 *  Write 1 before reset and write 0 after reset
 */
#define H264_DMA_IN_CMD_DISABLE_CH2    (BIT(25))
#define H264_DMA_IN_CMD_DISABLE_CH2_M  (H264_DMA_IN_CMD_DISABLE_CH2_V << H264_DMA_IN_CMD_DISABLE_CH2_S)
#define H264_DMA_IN_CMD_DISABLE_CH2_V  0x00000001U
#define H264_DMA_IN_CMD_DISABLE_CH2_S  25
/** H264_DMA_IN_ARB_WEIGHT_OPT_DIS_CH2 : R/W; bitpos: [26]; default: 0;
 *  Set this bit to 1 to disable arbiter optimum weight function.
 */
#define H264_DMA_IN_ARB_WEIGHT_OPT_DIS_CH2    (BIT(26))
#define H264_DMA_IN_ARB_WEIGHT_OPT_DIS_CH2_M  (H264_DMA_IN_ARB_WEIGHT_OPT_DIS_CH2_V << H264_DMA_IN_ARB_WEIGHT_OPT_DIS_CH2_S)
#define H264_DMA_IN_ARB_WEIGHT_OPT_DIS_CH2_V  0x00000001U
#define H264_DMA_IN_ARB_WEIGHT_OPT_DIS_CH2_S  26

/** H264_DMA_IN_INT_RAW_CH2_REG register
 *  RX CH2  interrupt raw register
 */
#define H264_DMA_IN_INT_RAW_CH2_REG (DR_REG_H264_DMA_BASE + 0x704)
/** H264_DMA_IN_DONE_CH2_INT_RAW : R/WTC/SS; bitpos: [0]; default: 0;
 *  The raw interrupt bit turns to high level when the last data pointed by one inlink
 *  descriptor has been transmitted to peripherals for Rx channel 1.
 */
#define H264_DMA_IN_DONE_CH2_INT_RAW    (BIT(0))
#define H264_DMA_IN_DONE_CH2_INT_RAW_M  (H264_DMA_IN_DONE_CH2_INT_RAW_V << H264_DMA_IN_DONE_CH2_INT_RAW_S)
#define H264_DMA_IN_DONE_CH2_INT_RAW_V  0x00000001U
#define H264_DMA_IN_DONE_CH2_INT_RAW_S  0
/** H264_DMA_IN_SUC_EOF_CH2_INT_RAW : R/WTC/SS; bitpos: [1]; default: 0;
 *  The raw interrupt bit turns to high level when the last data pointed by one inlink
 *  descriptor has been received and no data error is detected for Rx channel 1.
 */
#define H264_DMA_IN_SUC_EOF_CH2_INT_RAW    (BIT(1))
#define H264_DMA_IN_SUC_EOF_CH2_INT_RAW_M  (H264_DMA_IN_SUC_EOF_CH2_INT_RAW_V << H264_DMA_IN_SUC_EOF_CH2_INT_RAW_S)
#define H264_DMA_IN_SUC_EOF_CH2_INT_RAW_V  0x00000001U
#define H264_DMA_IN_SUC_EOF_CH2_INT_RAW_S  1
/** H264_DMA_IN_ERR_EOF_CH2_INT_RAW : R/WTC/SS; bitpos: [2]; default: 0;
 *  The raw interrupt bit turns to high level when the last data pointed by one inlink
 *  descriptor has been received and data error is detected
 */
#define H264_DMA_IN_ERR_EOF_CH2_INT_RAW    (BIT(2))
#define H264_DMA_IN_ERR_EOF_CH2_INT_RAW_M  (H264_DMA_IN_ERR_EOF_CH2_INT_RAW_V << H264_DMA_IN_ERR_EOF_CH2_INT_RAW_S)
#define H264_DMA_IN_ERR_EOF_CH2_INT_RAW_V  0x00000001U
#define H264_DMA_IN_ERR_EOF_CH2_INT_RAW_S  2
/** H264_DMA_IN_DSCR_ERR_CH2_INT_RAW : R/WTC/SS; bitpos: [3]; default: 0;
 *  The raw interrupt bit turns to high level when detecting inlink descriptor error,
 *  including owner error, the second and third word error of inlink descriptor for Rx
 *  channel 1.
 */
#define H264_DMA_IN_DSCR_ERR_CH2_INT_RAW    (BIT(3))
#define H264_DMA_IN_DSCR_ERR_CH2_INT_RAW_M  (H264_DMA_IN_DSCR_ERR_CH2_INT_RAW_V << H264_DMA_IN_DSCR_ERR_CH2_INT_RAW_S)
#define H264_DMA_IN_DSCR_ERR_CH2_INT_RAW_V  0x00000001U
#define H264_DMA_IN_DSCR_ERR_CH2_INT_RAW_S  3
/** H264_DMA_INFIFO_OVF_L1_CH2_INT_RAW : R/WTC/SS; bitpos: [4]; default: 0;
 *  This raw interrupt bit turns to high level when fifo of Rx channel is overflow.
 */
#define H264_DMA_INFIFO_OVF_L1_CH2_INT_RAW    (BIT(4))
#define H264_DMA_INFIFO_OVF_L1_CH2_INT_RAW_M  (H264_DMA_INFIFO_OVF_L1_CH2_INT_RAW_V << H264_DMA_INFIFO_OVF_L1_CH2_INT_RAW_S)
#define H264_DMA_INFIFO_OVF_L1_CH2_INT_RAW_V  0x00000001U
#define H264_DMA_INFIFO_OVF_L1_CH2_INT_RAW_S  4
/** H264_DMA_INFIFO_UDF_L1_CH2_INT_RAW : R/WTC/SS; bitpos: [5]; default: 0;
 *  This raw interrupt bit turns to high level when fifo of Rx channel is underflow.
 */
#define H264_DMA_INFIFO_UDF_L1_CH2_INT_RAW    (BIT(5))
#define H264_DMA_INFIFO_UDF_L1_CH2_INT_RAW_M  (H264_DMA_INFIFO_UDF_L1_CH2_INT_RAW_V << H264_DMA_INFIFO_UDF_L1_CH2_INT_RAW_S)
#define H264_DMA_INFIFO_UDF_L1_CH2_INT_RAW_V  0x00000001U
#define H264_DMA_INFIFO_UDF_L1_CH2_INT_RAW_S  5
/** H264_DMA_INFIFO_OVF_L2_CH2_INT_RAW : R/WTC/SS; bitpos: [6]; default: 0;
 *  This raw interrupt bit turns to high level when fifo of Rx channel is overflow.
 */
#define H264_DMA_INFIFO_OVF_L2_CH2_INT_RAW    (BIT(6))
#define H264_DMA_INFIFO_OVF_L2_CH2_INT_RAW_M  (H264_DMA_INFIFO_OVF_L2_CH2_INT_RAW_V << H264_DMA_INFIFO_OVF_L2_CH2_INT_RAW_S)
#define H264_DMA_INFIFO_OVF_L2_CH2_INT_RAW_V  0x00000001U
#define H264_DMA_INFIFO_OVF_L2_CH2_INT_RAW_S  6
/** H264_DMA_INFIFO_UDF_L2_CH2_INT_RAW : R/WTC/SS; bitpos: [7]; default: 0;
 *  This raw interrupt bit turns to high level when fifo of Rx channel is underflow.
 */
#define H264_DMA_INFIFO_UDF_L2_CH2_INT_RAW    (BIT(7))
#define H264_DMA_INFIFO_UDF_L2_CH2_INT_RAW_M  (H264_DMA_INFIFO_UDF_L2_CH2_INT_RAW_V << H264_DMA_INFIFO_UDF_L2_CH2_INT_RAW_S)
#define H264_DMA_INFIFO_UDF_L2_CH2_INT_RAW_V  0x00000001U
#define H264_DMA_INFIFO_UDF_L2_CH2_INT_RAW_S  7
/** H264_DMA_IN_DSCR_EMPTY_CH2_INT_RAW : R/WTC/SS; bitpos: [8]; default: 0;
 *  The raw interrupt bit turns to high level when the last descriptor is done but fifo
 *  also remain data.
 */
#define H264_DMA_IN_DSCR_EMPTY_CH2_INT_RAW    (BIT(8))
#define H264_DMA_IN_DSCR_EMPTY_CH2_INT_RAW_M  (H264_DMA_IN_DSCR_EMPTY_CH2_INT_RAW_V << H264_DMA_IN_DSCR_EMPTY_CH2_INT_RAW_S)
#define H264_DMA_IN_DSCR_EMPTY_CH2_INT_RAW_V  0x00000001U
#define H264_DMA_IN_DSCR_EMPTY_CH2_INT_RAW_S  8
/** H264_DMA_IN_DSCR_TASK_OVF_CH2_INT_RAW : R/WTC/SS; bitpos: [9]; default: 0;
 *  The raw interrupt bit turns to high level when dscr ready task fifo is overflow.
 */
#define H264_DMA_IN_DSCR_TASK_OVF_CH2_INT_RAW    (BIT(9))
#define H264_DMA_IN_DSCR_TASK_OVF_CH2_INT_RAW_M  (H264_DMA_IN_DSCR_TASK_OVF_CH2_INT_RAW_V << H264_DMA_IN_DSCR_TASK_OVF_CH2_INT_RAW_S)
#define H264_DMA_IN_DSCR_TASK_OVF_CH2_INT_RAW_V  0x00000001U
#define H264_DMA_IN_DSCR_TASK_OVF_CH2_INT_RAW_S  9

/** H264_DMA_IN_INT_ENA_CH2_REG register
 *  RX CH2  interrupt ena register
 */
#define H264_DMA_IN_INT_ENA_CH2_REG (DR_REG_H264_DMA_BASE + 0x708)
/** H264_DMA_IN_DONE_CH2_INT_ENA : R/W; bitpos: [0]; default: 0;
 *  The interrupt enable bit for the IN_DONE_CH_INT interrupt.
 */
#define H264_DMA_IN_DONE_CH2_INT_ENA    (BIT(0))
#define H264_DMA_IN_DONE_CH2_INT_ENA_M  (H264_DMA_IN_DONE_CH2_INT_ENA_V << H264_DMA_IN_DONE_CH2_INT_ENA_S)
#define H264_DMA_IN_DONE_CH2_INT_ENA_V  0x00000001U
#define H264_DMA_IN_DONE_CH2_INT_ENA_S  0
/** H264_DMA_IN_SUC_EOF_CH2_INT_ENA : R/W; bitpos: [1]; default: 0;
 *  The interrupt enable bit for the IN_SUC_EOF_CH_INT interrupt.
 */
#define H264_DMA_IN_SUC_EOF_CH2_INT_ENA    (BIT(1))
#define H264_DMA_IN_SUC_EOF_CH2_INT_ENA_M  (H264_DMA_IN_SUC_EOF_CH2_INT_ENA_V << H264_DMA_IN_SUC_EOF_CH2_INT_ENA_S)
#define H264_DMA_IN_SUC_EOF_CH2_INT_ENA_V  0x00000001U
#define H264_DMA_IN_SUC_EOF_CH2_INT_ENA_S  1
/** H264_DMA_IN_ERR_EOF_CH2_INT_ENA : R/W; bitpos: [2]; default: 0;
 *  The interrupt enable bit for the IN_ERR_EOF_CH_INT interrupt.
 */
#define H264_DMA_IN_ERR_EOF_CH2_INT_ENA    (BIT(2))
#define H264_DMA_IN_ERR_EOF_CH2_INT_ENA_M  (H264_DMA_IN_ERR_EOF_CH2_INT_ENA_V << H264_DMA_IN_ERR_EOF_CH2_INT_ENA_S)
#define H264_DMA_IN_ERR_EOF_CH2_INT_ENA_V  0x00000001U
#define H264_DMA_IN_ERR_EOF_CH2_INT_ENA_S  2
/** H264_DMA_IN_DSCR_ERR_CH2_INT_ENA : R/W; bitpos: [3]; default: 0;
 *  The interrupt enable bit for the IN_DSCR_ERR_CH_INT interrupt.
 */
#define H264_DMA_IN_DSCR_ERR_CH2_INT_ENA    (BIT(3))
#define H264_DMA_IN_DSCR_ERR_CH2_INT_ENA_M  (H264_DMA_IN_DSCR_ERR_CH2_INT_ENA_V << H264_DMA_IN_DSCR_ERR_CH2_INT_ENA_S)
#define H264_DMA_IN_DSCR_ERR_CH2_INT_ENA_V  0x00000001U
#define H264_DMA_IN_DSCR_ERR_CH2_INT_ENA_S  3
/** H264_DMA_INFIFO_OVF_L1_CH2_INT_ENA : R/W; bitpos: [4]; default: 0;
 *  The interrupt enable bit for the INFIFO_OVF_L1_CH_INT interrupt.
 */
#define H264_DMA_INFIFO_OVF_L1_CH2_INT_ENA    (BIT(4))
#define H264_DMA_INFIFO_OVF_L1_CH2_INT_ENA_M  (H264_DMA_INFIFO_OVF_L1_CH2_INT_ENA_V << H264_DMA_INFIFO_OVF_L1_CH2_INT_ENA_S)
#define H264_DMA_INFIFO_OVF_L1_CH2_INT_ENA_V  0x00000001U
#define H264_DMA_INFIFO_OVF_L1_CH2_INT_ENA_S  4
/** H264_DMA_INFIFO_UDF_L1_CH2_INT_ENA : R/W; bitpos: [5]; default: 0;
 *  The interrupt enable bit for the INFIFO_UDF_L1_CH_INT interrupt.
 */
#define H264_DMA_INFIFO_UDF_L1_CH2_INT_ENA    (BIT(5))
#define H264_DMA_INFIFO_UDF_L1_CH2_INT_ENA_M  (H264_DMA_INFIFO_UDF_L1_CH2_INT_ENA_V << H264_DMA_INFIFO_UDF_L1_CH2_INT_ENA_S)
#define H264_DMA_INFIFO_UDF_L1_CH2_INT_ENA_V  0x00000001U
#define H264_DMA_INFIFO_UDF_L1_CH2_INT_ENA_S  5
/** H264_DMA_INFIFO_OVF_L2_CH2_INT_ENA : R/W; bitpos: [6]; default: 0;
 *  The interrupt enable bit for the INFIFO_OVF_L2_CH_INT interrupt.
 */
#define H264_DMA_INFIFO_OVF_L2_CH2_INT_ENA    (BIT(6))
#define H264_DMA_INFIFO_OVF_L2_CH2_INT_ENA_M  (H264_DMA_INFIFO_OVF_L2_CH2_INT_ENA_V << H264_DMA_INFIFO_OVF_L2_CH2_INT_ENA_S)
#define H264_DMA_INFIFO_OVF_L2_CH2_INT_ENA_V  0x00000001U
#define H264_DMA_INFIFO_OVF_L2_CH2_INT_ENA_S  6
/** H264_DMA_INFIFO_UDF_L2_CH2_INT_ENA : R/W; bitpos: [7]; default: 0;
 *  The interrupt enable bit for the INFIFO_UDF_L2_CH_INT interrupt.
 */
#define H264_DMA_INFIFO_UDF_L2_CH2_INT_ENA    (BIT(7))
#define H264_DMA_INFIFO_UDF_L2_CH2_INT_ENA_M  (H264_DMA_INFIFO_UDF_L2_CH2_INT_ENA_V << H264_DMA_INFIFO_UDF_L2_CH2_INT_ENA_S)
#define H264_DMA_INFIFO_UDF_L2_CH2_INT_ENA_V  0x00000001U
#define H264_DMA_INFIFO_UDF_L2_CH2_INT_ENA_S  7
/** H264_DMA_IN_DSCR_EMPTY_CH2_INT_ENA : R/W; bitpos: [8]; default: 0;
 *  The interrupt enable bit for the IN_DSCR_EMPTY_CH_INT interrupt.
 */
#define H264_DMA_IN_DSCR_EMPTY_CH2_INT_ENA    (BIT(8))
#define H264_DMA_IN_DSCR_EMPTY_CH2_INT_ENA_M  (H264_DMA_IN_DSCR_EMPTY_CH2_INT_ENA_V << H264_DMA_IN_DSCR_EMPTY_CH2_INT_ENA_S)
#define H264_DMA_IN_DSCR_EMPTY_CH2_INT_ENA_V  0x00000001U
#define H264_DMA_IN_DSCR_EMPTY_CH2_INT_ENA_S  8
/** H264_DMA_IN_DSCR_TASK_OVF_CH2_INT_ENA : R/W; bitpos: [9]; default: 0;
 *  The interrupt enable bit for the IN_DSCR_TASK_OVF_CH_INT interrupt.
 */
#define H264_DMA_IN_DSCR_TASK_OVF_CH2_INT_ENA    (BIT(9))
#define H264_DMA_IN_DSCR_TASK_OVF_CH2_INT_ENA_M  (H264_DMA_IN_DSCR_TASK_OVF_CH2_INT_ENA_V << H264_DMA_IN_DSCR_TASK_OVF_CH2_INT_ENA_S)
#define H264_DMA_IN_DSCR_TASK_OVF_CH2_INT_ENA_V  0x00000001U
#define H264_DMA_IN_DSCR_TASK_OVF_CH2_INT_ENA_S  9

