espressif/esp-idf/components/soc/esp32p4/register/hw_ver1/soc/h264_dma_reg.h
/** H264_DMA_IN_INT_ST_CH2_REG register
 *  RX CH2  interrupt st register
 */
#define H264_DMA_IN_INT_ST_CH2_REG (DR_REG_H264_DMA_BASE + 0x70c)
/** H264_DMA_IN_DONE_CH2_INT_ST : RO; bitpos: [0]; default: 0;
 *  The raw interrupt status bit for the IN_DONE_CH_INT interrupt.
 */
#define H264_DMA_IN_DONE_CH2_INT_ST    (BIT(0))
#define H264_DMA_IN_DONE_CH2_INT_ST_M  (H264_DMA_IN_DONE_CH2_INT_ST_V << H264_DMA_IN_DONE_CH2_INT_ST_S)
#define H264_DMA_IN_DONE_CH2_INT_ST_V  0x00000001U
#define H264_DMA_IN_DONE_CH2_INT_ST_S  0
/** H264_DMA_IN_SUC_EOF_CH2_INT_ST : RO; bitpos: [1]; default: 0;
 *  The raw interrupt status bit for the IN_SUC_EOF_CH_INT interrupt.
 */
#define H264_DMA_IN_SUC_EOF_CH2_INT_ST    (BIT(1))
#define H264_DMA_IN_SUC_EOF_CH2_INT_ST_M  (H264_DMA_IN_SUC_EOF_CH2_INT_ST_V << H264_DMA_IN_SUC_EOF_CH2_INT_ST_S)
#define H264_DMA_IN_SUC_EOF_CH2_INT_ST_V  0x00000001U
#define H264_DMA_IN_SUC_EOF_CH2_INT_ST_S  1
/** H264_DMA_IN_ERR_EOF_CH2_INT_ST : RO; bitpos: [2]; default: 0;
 *  The raw interrupt status bit for the IN_ERR_EOF_CH_INT interrupt.
 */
#define H264_DMA_IN_ERR_EOF_CH2_INT_ST    (BIT(2))
#define H264_DMA_IN_ERR_EOF_CH2_INT_ST_M  (H264_DMA_IN_ERR_EOF_CH2_INT_ST_V << H264_DMA_IN_ERR_EOF_CH2_INT_ST_S)
#define H264_DMA_IN_ERR_EOF_CH2_INT_ST_V  0x00000001U
#define H264_DMA_IN_ERR_EOF_CH2_INT_ST_S  2
/** H264_DMA_IN_DSCR_ERR_CH2_INT_ST : RO; bitpos: [3]; default: 0;
 *  The raw interrupt status bit for the IN_DSCR_ERR_CH_INT interrupt.
 */
#define H264_DMA_IN_DSCR_ERR_CH2_INT_ST    (BIT(3))
#define H264_DMA_IN_DSCR_ERR_CH2_INT_ST_M  (H264_DMA_IN_DSCR_ERR_CH2_INT_ST_V << H264_DMA_IN_DSCR_ERR_CH2_INT_ST_S)
#define H264_DMA_IN_DSCR_ERR_CH2_INT_ST_V  0x00000001U
#define H264_DMA_IN_DSCR_ERR_CH2_INT_ST_S  3
/** H264_DMA_INFIFO_OVF_L1_CH2_INT_ST : RO; bitpos: [4]; default: 0;
 *  The raw interrupt status bit for the INFIFO_OVF_L1_CH_INT interrupt.
 */
#define H264_DMA_INFIFO_OVF_L1_CH2_INT_ST    (BIT(4))
#define H264_DMA_INFIFO_OVF_L1_CH2_INT_ST_M  (H264_DMA_INFIFO_OVF_L1_CH2_INT_ST_V << H264_DMA_INFIFO_OVF_L1_CH2_INT_ST_S)
#define H264_DMA_INFIFO_OVF_L1_CH2_INT_ST_V  0x00000001U
#define H264_DMA_INFIFO_OVF_L1_CH2_INT_ST_S  4
/** H264_DMA_INFIFO_UDF_L1_CH2_INT_ST : RO; bitpos: [5]; default: 0;
 *  The raw interrupt status bit for the INFIFO_UDF_L1_CH_INT interrupt.
 */
#define H264_DMA_INFIFO_UDF_L1_CH2_INT_ST    (BIT(5))
#define H264_DMA_INFIFO_UDF_L1_CH2_INT_ST_M  (H264_DMA_INFIFO_UDF_L1_CH2_INT_ST_V << H264_DMA_INFIFO_UDF_L1_CH2_INT_ST_S)
#define H264_DMA_INFIFO_UDF_L1_CH2_INT_ST_V  0x00000001U
#define H264_DMA_INFIFO_UDF_L1_CH2_INT_ST_S  5
/** H264_DMA_INFIFO_OVF_L2_CH2_INT_ST : RO; bitpos: [6]; default: 0;
 *  The raw interrupt status bit for the INFIFO_OVF_L2_CH_INT interrupt.
 */
#define H264_DMA_INFIFO_OVF_L2_CH2_INT_ST    (BIT(6))
#define H264_DMA_INFIFO_OVF_L2_CH2_INT_ST_M  (H264_DMA_INFIFO_OVF_L2_CH2_INT_ST_V << H264_DMA_INFIFO_OVF_L2_CH2_INT_ST_S)
#define H264_DMA_INFIFO_OVF_L2_CH2_INT_ST_V  0x00000001U
#define H264_DMA_INFIFO_OVF_L2_CH2_INT_ST_S  6
/** H264_DMA_INFIFO_UDF_L2_CH2_INT_ST : RO; bitpos: [7]; default: 0;
 *  The raw interrupt status bit for the INFIFO_UDF_L2_CH_INT interrupt.
 */
#define H264_DMA_INFIFO_UDF_L2_CH2_INT_ST    (BIT(7))
#define H264_DMA_INFIFO_UDF_L2_CH2_INT_ST_M  (H264_DMA_INFIFO_UDF_L2_CH2_INT_ST_V << H264_DMA_INFIFO_UDF_L2_CH2_INT_ST_S)
#define H264_DMA_INFIFO_UDF_L2_CH2_INT_ST_V  0x00000001U
#define H264_DMA_INFIFO_UDF_L2_CH2_INT_ST_S  7
/** H264_DMA_IN_DSCR_EMPTY_CH2_INT_ST : RO; bitpos: [8]; default: 0;
 *  The raw interrupt status bit for the IN_DSCR_EMPTY_CH_INT interrupt.
 */
#define H264_DMA_IN_DSCR_EMPTY_CH2_INT_ST    (BIT(8))
#define H264_DMA_IN_DSCR_EMPTY_CH2_INT_ST_M  (H264_DMA_IN_DSCR_EMPTY_CH2_INT_ST_V << H264_DMA_IN_DSCR_EMPTY_CH2_INT_ST_S)
#define H264_DMA_IN_DSCR_EMPTY_CH2_INT_ST_V  0x00000001U
#define H264_DMA_IN_DSCR_EMPTY_CH2_INT_ST_S  8
/** H264_DMA_IN_DSCR_TASK_OVF_CH2_INT_ST : RO; bitpos: [9]; default: 0;
 *  The raw interrupt status bit for the IN_DSCR_TASK_OVF_CH_INT interrupt.
 */
#define H264_DMA_IN_DSCR_TASK_OVF_CH2_INT_ST    (BIT(9))
#define H264_DMA_IN_DSCR_TASK_OVF_CH2_INT_ST_M  (H264_DMA_IN_DSCR_TASK_OVF_CH2_INT_ST_V << H264_DMA_IN_DSCR_TASK_OVF_CH2_INT_ST_S)
#define H264_DMA_IN_DSCR_TASK_OVF_CH2_INT_ST_V  0x00000001U
#define H264_DMA_IN_DSCR_TASK_OVF_CH2_INT_ST_S  9

/** H264_DMA_IN_INT_CLR_CH2_REG register
 *  RX CH2  interrupt clr register
 */
#define H264_DMA_IN_INT_CLR_CH2_REG (DR_REG_H264_DMA_BASE + 0x710)
/** H264_DMA_IN_DONE_CH2_INT_CLR : WT; bitpos: [0]; default: 0;
 *  Set this bit to clear the IN_DONE_CH_INT interrupt.
 */
#define H264_DMA_IN_DONE_CH2_INT_CLR    (BIT(0))
#define H264_DMA_IN_DONE_CH2_INT_CLR_M  (H264_DMA_IN_DONE_CH2_INT_CLR_V << H264_DMA_IN_DONE_CH2_INT_CLR_S)
#define H264_DMA_IN_DONE_CH2_INT_CLR_V  0x00000001U
#define H264_DMA_IN_DONE_CH2_INT_CLR_S  0
/** H264_DMA_IN_SUC_EOF_CH2_INT_CLR : WT; bitpos: [1]; default: 0;
 *  Set this bit to clear the IN_SUC_EOF_CH_INT interrupt.
 */
#define H264_DMA_IN_SUC_EOF_CH2_INT_CLR    (BIT(1))
#define H264_DMA_IN_SUC_EOF_CH2_INT_CLR_M  (H264_DMA_IN_SUC_EOF_CH2_INT_CLR_V << H264_DMA_IN_SUC_EOF_CH2_INT_CLR_S)
#define H264_DMA_IN_SUC_EOF_CH2_INT_CLR_V  0x00000001U
#define H264_DMA_IN_SUC_EOF_CH2_INT_CLR_S  1
/** H264_DMA_IN_ERR_EOF_CH2_INT_CLR : WT; bitpos: [2]; default: 0;
 *  Set this bit to clear the IN_ERR_EOF_CH_INT interrupt.
 */
#define H264_DMA_IN_ERR_EOF_CH2_INT_CLR    (BIT(2))
#define H264_DMA_IN_ERR_EOF_CH2_INT_CLR_M  (H264_DMA_IN_ERR_EOF_CH2_INT_CLR_V << H264_DMA_IN_ERR_EOF_CH2_INT_CLR_S)
#define H264_DMA_IN_ERR_EOF_CH2_INT_CLR_V  0x00000001U
#define H264_DMA_IN_ERR_EOF_CH2_INT_CLR_S  2
/** H264_DMA_IN_DSCR_ERR_CH2_INT_CLR : WT; bitpos: [3]; default: 0;
 *  Set this bit to clear the INDSCR_ERR_CH_INT interrupt.
 */
#define H264_DMA_IN_DSCR_ERR_CH2_INT_CLR    (BIT(3))
#define H264_DMA_IN_DSCR_ERR_CH2_INT_CLR_M  (H264_DMA_IN_DSCR_ERR_CH2_INT_CLR_V << H264_DMA_IN_DSCR_ERR_CH2_INT_CLR_S)
#define H264_DMA_IN_DSCR_ERR_CH2_INT_CLR_V  0x00000001U
#define H264_DMA_IN_DSCR_ERR_CH2_INT_CLR_S  3
/** H264_DMA_INFIFO_OVF_L1_CH2_INT_CLR : WT; bitpos: [4]; default: 0;
 *  Set this bit to clear the INFIFO_OVF_L1_CH_INT interrupt.
 */
#define H264_DMA_INFIFO_OVF_L1_CH2_INT_CLR    (BIT(4))
#define H264_DMA_INFIFO_OVF_L1_CH2_INT_CLR_M  (H264_DMA_INFIFO_OVF_L1_CH2_INT_CLR_V << H264_DMA_INFIFO_OVF_L1_CH2_INT_CLR_S)
#define H264_DMA_INFIFO_OVF_L1_CH2_INT_CLR_V  0x00000001U
#define H264_DMA_INFIFO_OVF_L1_CH2_INT_CLR_S  4
/** H264_DMA_INFIFO_UDF_L1_CH2_INT_CLR : WT; bitpos: [5]; default: 0;
 *  Set this bit to clear the INFIFO_UDF_L1_CH_INT interrupt.
 */
#define H264_DMA_INFIFO_UDF_L1_CH2_INT_CLR    (BIT(5))
#define H264_DMA_INFIFO_UDF_L1_CH2_INT_CLR_M  (H264_DMA_INFIFO_UDF_L1_CH2_INT_CLR_V << H264_DMA_INFIFO_UDF_L1_CH2_INT_CLR_S)
#define H264_DMA_INFIFO_UDF_L1_CH2_INT_CLR_V  0x00000001U
#define H264_DMA_INFIFO_UDF_L1_CH2_INT_CLR_S  5
/** H264_DMA_INFIFO_OVF_L2_CH2_INT_CLR : WT; bitpos: [6]; default: 0;
 *  Set this bit to clear the INFIFO_OVF_L2_CH_INT interrupt.
 */
#define H264_DMA_INFIFO_OVF_L2_CH2_INT_CLR    (BIT(6))
#define H264_DMA_INFIFO_OVF_L2_CH2_INT_CLR_M  (H264_DMA_INFIFO_OVF_L2_CH2_INT_CLR_V << H264_DMA_INFIFO_OVF_L2_CH2_INT_CLR_S)
#define H264_DMA_INFIFO_OVF_L2_CH2_INT_CLR_V  0x00000001U
#define H264_DMA_INFIFO_OVF_L2_CH2_INT_CLR_S  6
/** H264_DMA_INFIFO_UDF_L2_CH2_INT_CLR : WT; bitpos: [7]; default: 0;
 *  Set this bit to clear the INFIFO_UDF_L2_CH_INT interrupt.
 */
#define H264_DMA_INFIFO_UDF_L2_CH2_INT_CLR    (BIT(7))
#define H264_DMA_INFIFO_UDF_L2_CH2_INT_CLR_M  (H264_DMA_INFIFO_UDF_L2_CH2_INT_CLR_V << H264_DMA_INFIFO_UDF_L2_CH2_INT_CLR_S)
#define H264_DMA_INFIFO_UDF_L2_CH2_INT_CLR_V  0x00000001U
#define H264_DMA_INFIFO_UDF_L2_CH2_INT_CLR_S  7
/** H264_DMA_IN_DSCR_EMPTY_CH2_INT_CLR : WT; bitpos: [8]; default: 0;
 *  Set this bit to clear the IN_DSCR_EMPTY_CH_INT interrupt.
 */
#define H264_DMA_IN_DSCR_EMPTY_CH2_INT_CLR    (BIT(8))
#define H264_DMA_IN_DSCR_EMPTY_CH2_INT_CLR_M  (H264_DMA_IN_DSCR_EMPTY_CH2_INT_CLR_V << H264_DMA_IN_DSCR_EMPTY_CH2_INT_CLR_S)
#define H264_DMA_IN_DSCR_EMPTY_CH2_INT_CLR_V  0x00000001U
#define H264_DMA_IN_DSCR_EMPTY_CH2_INT_CLR_S  8
/** H264_DMA_IN_DSCR_TASK_OVF_CH2_INT_CLR : WT; bitpos: [9]; default: 0;
 *  Set this bit to clear the IN_DSCR_TASK_OVF_CH_INT interrupt.
 */
#define H264_DMA_IN_DSCR_TASK_OVF_CH2_INT_CLR    (BIT(9))
#define H264_DMA_IN_DSCR_TASK_OVF_CH2_INT_CLR_M  (H264_DMA_IN_DSCR_TASK_OVF_CH2_INT_CLR_V << H264_DMA_IN_DSCR_TASK_OVF_CH2_INT_CLR_S)
#define H264_DMA_IN_DSCR_TASK_OVF_CH2_INT_CLR_V  0x00000001U
#define H264_DMA_IN_DSCR_TASK_OVF_CH2_INT_CLR_S  9

/** H264_DMA_INFIFO_STATUS_CH2_REG register
 *  RX CH2 INFIFO status register
 */
#define H264_DMA_INFIFO_STATUS_CH2_REG (DR_REG_H264_DMA_BASE + 0x714)
/** H264_DMA_INFIFO_FULL_L2_CH2 : RO; bitpos: [0]; default: 0;
 *  Rx FIFO full signal for Rx channel.
 */
#define H264_DMA_INFIFO_FULL_L2_CH2    (BIT(0))
#define H264_DMA_INFIFO_FULL_L2_CH2_M  (H264_DMA_INFIFO_FULL_L2_CH2_V << H264_DMA_INFIFO_FULL_L2_CH2_S)
#define H264_DMA_INFIFO_FULL_L2_CH2_V  0x00000001U
#define H264_DMA_INFIFO_FULL_L2_CH2_S  0
/** H264_DMA_INFIFO_EMPTY_L2_CH2 : RO; bitpos: [1]; default: 1;
 *  Rx FIFO empty signal for Rx channel.
 */
#define H264_DMA_INFIFO_EMPTY_L2_CH2    (BIT(1))
#define H264_DMA_INFIFO_EMPTY_L2_CH2_M  (H264_DMA_INFIFO_EMPTY_L2_CH2_V << H264_DMA_INFIFO_EMPTY_L2_CH2_S)
#define H264_DMA_INFIFO_EMPTY_L2_CH2_V  0x00000001U
#define H264_DMA_INFIFO_EMPTY_L2_CH2_S  1
/** H264_DMA_INFIFO_CNT_L2_CH2 : RO; bitpos: [5:2]; default: 0;
 *  The register stores the byte number of the data in Rx FIFO for Rx channel.
 */
#define H264_DMA_INFIFO_CNT_L2_CH2    0x0000000FU
#define H264_DMA_INFIFO_CNT_L2_CH2_M  (H264_DMA_INFIFO_CNT_L2_CH2_V << H264_DMA_INFIFO_CNT_L2_CH2_S)
#define H264_DMA_INFIFO_CNT_L2_CH2_V  0x0000000FU
#define H264_DMA_INFIFO_CNT_L2_CH2_S  2
/** H264_DMA_INFIFO_FULL_L1_CH2 : RO; bitpos: [6]; default: 0;
 *  Tx FIFO full signal for Tx channel 1.
 */
#define H264_DMA_INFIFO_FULL_L1_CH2    (BIT(6))
#define H264_DMA_INFIFO_FULL_L1_CH2_M  (H264_DMA_INFIFO_FULL_L1_CH2_V << H264_DMA_INFIFO_FULL_L1_CH2_S)
#define H264_DMA_INFIFO_FULL_L1_CH2_V  0x00000001U
#define H264_DMA_INFIFO_FULL_L1_CH2_S  6
/** H264_DMA_INFIFO_EMPTY_L1_CH2 : RO; bitpos: [7]; default: 1;
 *  Tx FIFO empty signal for Tx channel 1.
 */
#define H264_DMA_INFIFO_EMPTY_L1_CH2    (BIT(7))
#define H264_DMA_INFIFO_EMPTY_L1_CH2_M  (H264_DMA_INFIFO_EMPTY_L1_CH2_V << H264_DMA_INFIFO_EMPTY_L1_CH2_S)
#define H264_DMA_INFIFO_EMPTY_L1_CH2_V  0x00000001U
#define H264_DMA_INFIFO_EMPTY_L1_CH2_S  7
/** H264_DMA_INFIFO_CNT_L1_CH2 : RO; bitpos: [12:8]; default: 0;
 *  The register stores the byte number of the data in Tx FIFO for Tx channel 1.
 */
#define H264_DMA_INFIFO_CNT_L1_CH2    0x0000001FU
#define H264_DMA_INFIFO_CNT_L1_CH2_M  (H264_DMA_INFIFO_CNT_L1_CH2_V << H264_DMA_INFIFO_CNT_L1_CH2_S)
#define H264_DMA_INFIFO_CNT_L1_CH2_V  0x0000001FU
#define H264_DMA_INFIFO_CNT_L1_CH2_S  8
/** H264_DMA_INFIFO_FULL_L3_CH2 : RO; bitpos: [16]; default: 0;
 *  Tx FIFO full signal for Tx channel 1.
 */
#define H264_DMA_INFIFO_FULL_L3_CH2    (BIT(16))
#define H264_DMA_INFIFO_FULL_L3_CH2_M  (H264_DMA_INFIFO_FULL_L3_CH2_V << H264_DMA_INFIFO_FULL_L3_CH2_S)
#define H264_DMA_INFIFO_FULL_L3_CH2_V  0x00000001U
#define H264_DMA_INFIFO_FULL_L3_CH2_S  16
/** H264_DMA_INFIFO_EMPTY_L3_CH2 : RO; bitpos: [17]; default: 1;
 *  Tx FIFO empty signal for Tx channel 1.
 */
#define H264_DMA_INFIFO_EMPTY_L3_CH2    (BIT(17))
#define H264_DMA_INFIFO_EMPTY_L3_CH2_M  (H264_DMA_INFIFO_EMPTY_L3_CH2_V << H264_DMA_INFIFO_EMPTY_L3_CH2_S)
#define H264_DMA_INFIFO_EMPTY_L3_CH2_V  0x00000001U
#define H264_DMA_INFIFO_EMPTY_L3_CH2_S  17
/** H264_DMA_INFIFO_CNT_L3_CH2 : RO; bitpos: [19:18]; default: 0;
 *  The register stores the byte number of the data in Tx FIFO for Tx channel 1.
 */
#define H264_DMA_INFIFO_CNT_L3_CH2    0x00000003U
#define H264_DMA_INFIFO_CNT_L3_CH2_M  (H264_DMA_INFIFO_CNT_L3_CH2_V << H264_DMA_INFIFO_CNT_L3_CH2_S)
#define H264_DMA_INFIFO_CNT_L3_CH2_V  0x00000003U
#define H264_DMA_INFIFO_CNT_L3_CH2_S  18

/** H264_DMA_IN_POP_CH2_REG register
 *  RX CH2 INFIFO pop register
 */
#define H264_DMA_IN_POP_CH2_REG (DR_REG_H264_DMA_BASE + 0x718)
/** H264_DMA_INFIFO_RDATA_CH2 : RO; bitpos: [10:0]; default: 1024;
 *  This register stores the data popping from DMA Rx FIFO.
 */
#define H264_DMA_INFIFO_RDATA_CH2    0x000007FFU
#define H264_DMA_INFIFO_RDATA_CH2_M  (H264_DMA_INFIFO_RDATA_CH2_V << H264_DMA_INFIFO_RDATA_CH2_S)
#define H264_DMA_INFIFO_RDATA_CH2_V  0x000007FFU
#define H264_DMA_INFIFO_RDATA_CH2_S  0
/** H264_DMA_INFIFO_POP_CH2 : R/W/SC; bitpos: [11]; default: 0;
 *  Set this bit to pop data from DMA Rx FIFO.
 */
#define H264_DMA_INFIFO_POP_CH2    (BIT(11))
#define H264_DMA_INFIFO_POP_CH2_M  (H264_DMA_INFIFO_POP_CH2_V << H264_DMA_INFIFO_POP_CH2_S)
#define H264_DMA_INFIFO_POP_CH2_V  0x00000001U
#define H264_DMA_INFIFO_POP_CH2_S  11

/** H264_DMA_IN_LINK_CONF_CH2_REG register
 *  RX CH2 in_link dscr ctrl register
 */
#define H264_DMA_IN_LINK_CONF_CH2_REG (DR_REG_H264_DMA_BASE + 0x71c)
/** H264_DMA_INLINK_AUTO_RET_CH2 : R/W; bitpos: [20]; default: 1;
 *  Set this bit to return to current inlink descriptor's address, when there are some
 *  errors in current receiving data.
 */
#define H264_DMA_INLINK_AUTO_RET_CH2    (BIT(20))
#define H264_DMA_INLINK_AUTO_RET_CH2_M  (H264_DMA_INLINK_AUTO_RET_CH2_V << H264_DMA_INLINK_AUTO_RET_CH2_S)
#define H264_DMA_INLINK_AUTO_RET_CH2_V  0x00000001U
#define H264_DMA_INLINK_AUTO_RET_CH2_S  20
/** H264_DMA_INLINK_STOP_CH2 : R/W/SC; bitpos: [21]; default: 0;
 *  Set this bit to stop dealing with the inlink descriptors.
 */
#define H264_DMA_INLINK_STOP_CH2    (BIT(21))
#define H264_DMA_INLINK_STOP_CH2_M  (H264_DMA_INLINK_STOP_CH2_V << H264_DMA_INLINK_STOP_CH2_S)
#define H264_DMA_INLINK_STOP_CH2_V  0x00000001U
#define H264_DMA_INLINK_STOP_CH2_S  21
/** H264_DMA_INLINK_START_CH2 : R/W/SC; bitpos: [22]; default: 0;
 *  Set this bit to start dealing with the inlink descriptors.
 */
#define H264_DMA_INLINK_START_CH2    (BIT(22))
#define H264_DMA_INLINK_START_CH2_M  (H264_DMA_INLINK_START_CH2_V << H264_DMA_INLINK_START_CH2_S)
#define H264_DMA_INLINK_START_CH2_V  0x00000001U
#define H264_DMA_INLINK_START_CH2_S  22
/** H264_DMA_INLINK_RESTART_CH2 : R/W/SC; bitpos: [23]; default: 0;
 *  Set this bit to mount a new inlink descriptor.
 */
#define H264_DMA_INLINK_RESTART_CH2    (BIT(23))
#define H264_DMA_INLINK_RESTART_CH2_M  (H264_DMA_INLINK_RESTART_CH2_V << H264_DMA_INLINK_RESTART_CH2_S)
#define H264_DMA_INLINK_RESTART_CH2_V  0x00000001U
#define H264_DMA_INLINK_RESTART_CH2_S  23
/** H264_DMA_INLINK_PARK_CH2 : RO; bitpos: [24]; default: 1;
 *  1: the inlink descriptor's FSM is in idle state.  0: the inlink descriptor's FSM is
 *  working.
 */
#define H264_DMA_INLINK_PARK_CH2    (BIT(24))
#define H264_DMA_INLINK_PARK_CH2_M  (H264_DMA_INLINK_PARK_CH2_V << H264_DMA_INLINK_PARK_CH2_S)
#define H264_DMA_INLINK_PARK_CH2_V  0x00000001U
#define H264_DMA_INLINK_PARK_CH2_S  24

/** H264_DMA_IN_LINK_ADDR_CH2_REG register
 *  RX CH2 in_link dscr addr register
 */
#define H264_DMA_IN_LINK_ADDR_CH2_REG (DR_REG_H264_DMA_BASE + 0x720)
/** H264_DMA_INLINK_ADDR_CH2 : R/W; bitpos: [31:0]; default: 0;
 *  This register stores the first inlink descriptor's address.
 */
#define H264_DMA_INLINK_ADDR_CH2    0xFFFFFFFFU
#define H264_DMA_INLINK_ADDR_CH2_M  (H264_DMA_INLINK_ADDR_CH2_V << H264_DMA_INLINK_ADDR_CH2_S)
#define H264_DMA_INLINK_ADDR_CH2_V  0xFFFFFFFFU
#define H264_DMA_INLINK_ADDR_CH2_S  0

