espressif/esp-idf/components/soc/esp32p4/register/hw_ver1/soc/h264_dma_reg.h
/** H264_DMA_IN_STATE_CH2_REG register
 *  RX CH2 state register
 */
#define H264_DMA_IN_STATE_CH2_REG (DR_REG_H264_DMA_BASE + 0x724)
/** H264_DMA_INLINK_DSCR_ADDR_CH2 : RO; bitpos: [17:0]; default: 0;
 *  This register stores the current inlink descriptor's address.
 */
#define H264_DMA_INLINK_DSCR_ADDR_CH2    0x0003FFFFU
#define H264_DMA_INLINK_DSCR_ADDR_CH2_M  (H264_DMA_INLINK_DSCR_ADDR_CH2_V << H264_DMA_INLINK_DSCR_ADDR_CH2_S)
#define H264_DMA_INLINK_DSCR_ADDR_CH2_V  0x0003FFFFU
#define H264_DMA_INLINK_DSCR_ADDR_CH2_S  0
/** H264_DMA_IN_DSCR_STATE_CH2 : RO; bitpos: [19:18]; default: 0;
 *  This register stores the current descriptor state machine state.
 */
#define H264_DMA_IN_DSCR_STATE_CH2    0x00000003U
#define H264_DMA_IN_DSCR_STATE_CH2_M  (H264_DMA_IN_DSCR_STATE_CH2_V << H264_DMA_IN_DSCR_STATE_CH2_S)
#define H264_DMA_IN_DSCR_STATE_CH2_V  0x00000003U
#define H264_DMA_IN_DSCR_STATE_CH2_S  18
/** H264_DMA_IN_STATE_CH2 : RO; bitpos: [22:20]; default: 0;
 *  This register stores the current control module state machine state.
 */
#define H264_DMA_IN_STATE_CH2    0x00000007U
#define H264_DMA_IN_STATE_CH2_M  (H264_DMA_IN_STATE_CH2_V << H264_DMA_IN_STATE_CH2_S)
#define H264_DMA_IN_STATE_CH2_V  0x00000007U
#define H264_DMA_IN_STATE_CH2_S  20
/** H264_DMA_IN_RESET_AVAIL_CH2 : RO; bitpos: [23]; default: 1;
 *  This register indicate that if the channel reset is safety.
 */
#define H264_DMA_IN_RESET_AVAIL_CH2    (BIT(23))
#define H264_DMA_IN_RESET_AVAIL_CH2_M  (H264_DMA_IN_RESET_AVAIL_CH2_V << H264_DMA_IN_RESET_AVAIL_CH2_S)
#define H264_DMA_IN_RESET_AVAIL_CH2_V  0x00000001U
#define H264_DMA_IN_RESET_AVAIL_CH2_S  23

/** H264_DMA_IN_SUC_EOF_DES_ADDR_CH2_REG register
 *  RX CH2 eof des addr register
 */
#define H264_DMA_IN_SUC_EOF_DES_ADDR_CH2_REG (DR_REG_H264_DMA_BASE + 0x728)
/** H264_DMA_IN_SUC_EOF_DES_ADDR_CH2 : RO; bitpos: [31:0]; default: 0;
 *  This register stores the address of the inlink descriptor when the EOF bit in this
 *  descriptor is 1.
 */
#define H264_DMA_IN_SUC_EOF_DES_ADDR_CH2    0xFFFFFFFFU
#define H264_DMA_IN_SUC_EOF_DES_ADDR_CH2_M  (H264_DMA_IN_SUC_EOF_DES_ADDR_CH2_V << H264_DMA_IN_SUC_EOF_DES_ADDR_CH2_S)
#define H264_DMA_IN_SUC_EOF_DES_ADDR_CH2_V  0xFFFFFFFFU
#define H264_DMA_IN_SUC_EOF_DES_ADDR_CH2_S  0

/** H264_DMA_IN_ERR_EOF_DES_ADDR_CH2_REG register
 *  RX CH2 err eof des addr register
 */
#define H264_DMA_IN_ERR_EOF_DES_ADDR_CH2_REG (DR_REG_H264_DMA_BASE + 0x72c)
/** H264_DMA_IN_ERR_EOF_DES_ADDR_CH2 : RO; bitpos: [31:0]; default: 0;
 *  This register stores the address of the inlink descriptor when there are some
 *  errors in current receiving data.
 */
#define H264_DMA_IN_ERR_EOF_DES_ADDR_CH2    0xFFFFFFFFU
#define H264_DMA_IN_ERR_EOF_DES_ADDR_CH2_M  (H264_DMA_IN_ERR_EOF_DES_ADDR_CH2_V << H264_DMA_IN_ERR_EOF_DES_ADDR_CH2_S)
#define H264_DMA_IN_ERR_EOF_DES_ADDR_CH2_V  0xFFFFFFFFU
#define H264_DMA_IN_ERR_EOF_DES_ADDR_CH2_S  0

/** H264_DMA_IN_DSCR_CH2_REG register
 *  RX CH2 next dscr addr register
 */
#define H264_DMA_IN_DSCR_CH2_REG (DR_REG_H264_DMA_BASE + 0x730)
/** H264_DMA_INLINK_DSCR_CH2 : RO; bitpos: [31:0]; default: 0;
 *  The address of the next inlink descriptor address x.
 */
#define H264_DMA_INLINK_DSCR_CH2    0xFFFFFFFFU
#define H264_DMA_INLINK_DSCR_CH2_M  (H264_DMA_INLINK_DSCR_CH2_V << H264_DMA_INLINK_DSCR_CH2_S)
#define H264_DMA_INLINK_DSCR_CH2_V  0xFFFFFFFFU
#define H264_DMA_INLINK_DSCR_CH2_S  0

/** H264_DMA_IN_DSCR_BF0_CH2_REG register
 *  RX CH2 last dscr addr register
 */
#define H264_DMA_IN_DSCR_BF0_CH2_REG (DR_REG_H264_DMA_BASE + 0x734)
/** H264_DMA_INLINK_DSCR_BF0_CH2 : RO; bitpos: [31:0]; default: 0;
 *  The address of the last inlink descriptor's next address x-1.
 */
#define H264_DMA_INLINK_DSCR_BF0_CH2    0xFFFFFFFFU
#define H264_DMA_INLINK_DSCR_BF0_CH2_M  (H264_DMA_INLINK_DSCR_BF0_CH2_V << H264_DMA_INLINK_DSCR_BF0_CH2_S)
#define H264_DMA_INLINK_DSCR_BF0_CH2_V  0xFFFFFFFFU
#define H264_DMA_INLINK_DSCR_BF0_CH2_S  0

/** H264_DMA_IN_DSCR_BF1_CH2_REG register
 *  RX CH2 second-to-last dscr addr register
 */
#define H264_DMA_IN_DSCR_BF1_CH2_REG (DR_REG_H264_DMA_BASE + 0x738)
/** H264_DMA_INLINK_DSCR_BF1_CH2 : RO; bitpos: [31:0]; default: 0;
 *  The address of the second-to-last inlink descriptor's next address x-2.
 */
#define H264_DMA_INLINK_DSCR_BF1_CH2    0xFFFFFFFFU
#define H264_DMA_INLINK_DSCR_BF1_CH2_M  (H264_DMA_INLINK_DSCR_BF1_CH2_V << H264_DMA_INLINK_DSCR_BF1_CH2_S)
#define H264_DMA_INLINK_DSCR_BF1_CH2_V  0xFFFFFFFFU
#define H264_DMA_INLINK_DSCR_BF1_CH2_S  0

/** H264_DMA_IN_ARB_CH2_REG register
 *  RX CH2 arb register
 */
#define H264_DMA_IN_ARB_CH2_REG (DR_REG_H264_DMA_BASE + 0x740)
/** H264_DMA_IN_ARB_TOKEN_NUM_CH2 : R/W; bitpos: [3:0]; default: 1;
 *  Set the max number of token count of arbiter
 */
#define H264_DMA_IN_ARB_TOKEN_NUM_CH2    0x0000000FU
#define H264_DMA_IN_ARB_TOKEN_NUM_CH2_M  (H264_DMA_IN_ARB_TOKEN_NUM_CH2_V << H264_DMA_IN_ARB_TOKEN_NUM_CH2_S)
#define H264_DMA_IN_ARB_TOKEN_NUM_CH2_V  0x0000000FU
#define H264_DMA_IN_ARB_TOKEN_NUM_CH2_S  0
/** H264_DMA_INTER_IN_ARB_PRIORITY_CH2 : R/W; bitpos: [8:6]; default: 1;
 *  Set the priority of channel
 */
#define H264_DMA_INTER_IN_ARB_PRIORITY_CH2    0x00000007U
#define H264_DMA_INTER_IN_ARB_PRIORITY_CH2_M  (H264_DMA_INTER_IN_ARB_PRIORITY_CH2_V << H264_DMA_INTER_IN_ARB_PRIORITY_CH2_S)
#define H264_DMA_INTER_IN_ARB_PRIORITY_CH2_V  0x00000007U
#define H264_DMA_INTER_IN_ARB_PRIORITY_CH2_S  6

/** H264_DMA_IN_ETM_CONF_CH2_REG register
 *  RX CH2 ETM config register
 */
#define H264_DMA_IN_ETM_CONF_CH2_REG (DR_REG_H264_DMA_BASE + 0x748)
/** H264_DMA_IN_ETM_EN_CH2 : R/W; bitpos: [0]; default: 0;
 *  Set this bit to 1 to enable ETM task function
 */
#define H264_DMA_IN_ETM_EN_CH2    (BIT(0))
#define H264_DMA_IN_ETM_EN_CH2_M  (H264_DMA_IN_ETM_EN_CH2_V << H264_DMA_IN_ETM_EN_CH2_S)
#define H264_DMA_IN_ETM_EN_CH2_V  0x00000001U
#define H264_DMA_IN_ETM_EN_CH2_S  0
/** H264_DMA_IN_ETM_LOOP_EN_CH2 : R/W; bitpos: [1]; default: 0;
 *  when this bit is 1, dscr can be processed after receiving a task
 */
#define H264_DMA_IN_ETM_LOOP_EN_CH2    (BIT(1))
#define H264_DMA_IN_ETM_LOOP_EN_CH2_M  (H264_DMA_IN_ETM_LOOP_EN_CH2_V << H264_DMA_IN_ETM_LOOP_EN_CH2_S)
#define H264_DMA_IN_ETM_LOOP_EN_CH2_V  0x00000001U
#define H264_DMA_IN_ETM_LOOP_EN_CH2_S  1
/** H264_DMA_IN_DSCR_TASK_MAK_CH2 : R/W; bitpos: [3:2]; default: 1;
 *  ETM dscr_ready maximum cache numbers
 */
#define H264_DMA_IN_DSCR_TASK_MAK_CH2    0x00000003U
#define H264_DMA_IN_DSCR_TASK_MAK_CH2_M  (H264_DMA_IN_DSCR_TASK_MAK_CH2_V << H264_DMA_IN_DSCR_TASK_MAK_CH2_S)
#define H264_DMA_IN_DSCR_TASK_MAK_CH2_V  0x00000003U
#define H264_DMA_IN_DSCR_TASK_MAK_CH2_S  2

/** H264_DMA_IN_FIFO_CNT_CH2_REG register
 *  rx CH2 fifo cnt register
 */
#define H264_DMA_IN_FIFO_CNT_CH2_REG (DR_REG_H264_DMA_BASE + 0x780)
/** H264_DMA_IN_CMDFIFO_INFIFO_CNT_CH2 : RO; bitpos: [9:0]; default: 0;
 *  only for debug
 */
#define H264_DMA_IN_CMDFIFO_INFIFO_CNT_CH2    0x000003FFU
#define H264_DMA_IN_CMDFIFO_INFIFO_CNT_CH2_M  (H264_DMA_IN_CMDFIFO_INFIFO_CNT_CH2_V << H264_DMA_IN_CMDFIFO_INFIFO_CNT_CH2_S)
#define H264_DMA_IN_CMDFIFO_INFIFO_CNT_CH2_V  0x000003FFU
#define H264_DMA_IN_CMDFIFO_INFIFO_CNT_CH2_S  0

/** H264_DMA_IN_POP_DATA_CNT_CH2_REG register
 *  rx CH2 pop data cnt register
 */
#define H264_DMA_IN_POP_DATA_CNT_CH2_REG (DR_REG_H264_DMA_BASE + 0x784)
/** H264_DMA_IN_CMDFIFO_POP_DATA_CNT_CH2 : RO; bitpos: [7:0]; default: 7;
 *  only for debug
 */
#define H264_DMA_IN_CMDFIFO_POP_DATA_CNT_CH2    0x000000FFU
#define H264_DMA_IN_CMDFIFO_POP_DATA_CNT_CH2_M  (H264_DMA_IN_CMDFIFO_POP_DATA_CNT_CH2_V << H264_DMA_IN_CMDFIFO_POP_DATA_CNT_CH2_S)
#define H264_DMA_IN_CMDFIFO_POP_DATA_CNT_CH2_V  0x000000FFU
#define H264_DMA_IN_CMDFIFO_POP_DATA_CNT_CH2_S  0

