espressif/esp-idf/components/soc/esp32p4/register/hw_ver1/soc/h264_dma_reg.h
/** H264_DMA_IN_XADDR_CH2_REG register
 *  rx CH2 xaddr register
 */
#define H264_DMA_IN_XADDR_CH2_REG (DR_REG_H264_DMA_BASE + 0x788)
/** H264_DMA_IN_CMDFIFO_XADDR_CH2 : RO; bitpos: [31:0]; default: 0;
 *  only for debug
 */
#define H264_DMA_IN_CMDFIFO_XADDR_CH2    0xFFFFFFFFU
#define H264_DMA_IN_CMDFIFO_XADDR_CH2_M  (H264_DMA_IN_CMDFIFO_XADDR_CH2_V << H264_DMA_IN_CMDFIFO_XADDR_CH2_S)
#define H264_DMA_IN_CMDFIFO_XADDR_CH2_V  0xFFFFFFFFU
#define H264_DMA_IN_CMDFIFO_XADDR_CH2_S  0

/** H264_DMA_IN_BUF_HB_RCV_CH2_REG register
 *  rx CH2 buf len hb rcv register
 */
#define H264_DMA_IN_BUF_HB_RCV_CH2_REG (DR_REG_H264_DMA_BASE + 0x78c)
/** H264_DMA_IN_CMDFIFO_BUF_HB_RCV_CH2 : RO; bitpos: [28:0]; default: 0;
 *  only for debug
 */
#define H264_DMA_IN_CMDFIFO_BUF_HB_RCV_CH2    0x1FFFFFFFU
#define H264_DMA_IN_CMDFIFO_BUF_HB_RCV_CH2_M  (H264_DMA_IN_CMDFIFO_BUF_HB_RCV_CH2_V << H264_DMA_IN_CMDFIFO_BUF_HB_RCV_CH2_S)
#define H264_DMA_IN_CMDFIFO_BUF_HB_RCV_CH2_V  0x1FFFFFFFU
#define H264_DMA_IN_CMDFIFO_BUF_HB_RCV_CH2_S  0

/** H264_DMA_IN_CONF0_CH3_REG register
 *  RX CH3 config0 register
 */
#define H264_DMA_IN_CONF0_CH3_REG (DR_REG_H264_DMA_BASE + 0x800)
/** H264_DMA_INDSCR_BURST_EN_CH3 : R/W; bitpos: [2]; default: 0;
 *  Set this bit to 1 to enable INCR burst transfer for Rx transmitting link descriptor
 *  when accessing SRAM.
 */
#define H264_DMA_INDSCR_BURST_EN_CH3    (BIT(2))
#define H264_DMA_INDSCR_BURST_EN_CH3_M  (H264_DMA_INDSCR_BURST_EN_CH3_V << H264_DMA_INDSCR_BURST_EN_CH3_S)
#define H264_DMA_INDSCR_BURST_EN_CH3_V  0x00000001U
#define H264_DMA_INDSCR_BURST_EN_CH3_S  2
/** H264_DMA_IN_ECC_AES_EN_CH3 : R/W; bitpos: [3]; default: 0;
 *  When access address space is ecc/aes area, this bit should be set to 1. In this
 *  case, the start address of square should be 16-bit aligned. The width of square
 *  multiply byte number of one pixel should be 16-bit aligned.
 */
#define H264_DMA_IN_ECC_AES_EN_CH3    (BIT(3))
#define H264_DMA_IN_ECC_AES_EN_CH3_M  (H264_DMA_IN_ECC_AES_EN_CH3_V << H264_DMA_IN_ECC_AES_EN_CH3_S)
#define H264_DMA_IN_ECC_AES_EN_CH3_V  0x00000001U
#define H264_DMA_IN_ECC_AES_EN_CH3_S  3
/** H264_DMA_IN_CHECK_OWNER_CH3 : R/W; bitpos: [4]; default: 0;
 *  Set this bit to enable checking the owner attribute of the link descriptor.
 */
#define H264_DMA_IN_CHECK_OWNER_CH3    (BIT(4))
#define H264_DMA_IN_CHECK_OWNER_CH3_M  (H264_DMA_IN_CHECK_OWNER_CH3_V << H264_DMA_IN_CHECK_OWNER_CH3_S)
#define H264_DMA_IN_CHECK_OWNER_CH3_V  0x00000001U
#define H264_DMA_IN_CHECK_OWNER_CH3_S  4
/** H264_DMA_IN_MEM_BURST_LENGTH_CH3 : R/W; bitpos: [8:6]; default: 0;
 *  Block size of Rx channel 1. 0: single      1: 16 bytes      2: 32 bytes    3: 64
 *  bytes    4: 128 bytes
 */
#define H264_DMA_IN_MEM_BURST_LENGTH_CH3    0x00000007U
#define H264_DMA_IN_MEM_BURST_LENGTH_CH3_M  (H264_DMA_IN_MEM_BURST_LENGTH_CH3_V << H264_DMA_IN_MEM_BURST_LENGTH_CH3_S)
#define H264_DMA_IN_MEM_BURST_LENGTH_CH3_V  0x00000007U
#define H264_DMA_IN_MEM_BURST_LENGTH_CH3_S  6
/** H264_DMA_IN_PAGE_BOUND_EN_CH3 : R/W; bitpos: [12]; default: 0;
 *  Set this bit to 1 to make sure AXI write data don't cross the address boundary
 *  which define by mem_burst_length
 */
#define H264_DMA_IN_PAGE_BOUND_EN_CH3    (BIT(12))
#define H264_DMA_IN_PAGE_BOUND_EN_CH3_M  (H264_DMA_IN_PAGE_BOUND_EN_CH3_V << H264_DMA_IN_PAGE_BOUND_EN_CH3_S)
#define H264_DMA_IN_PAGE_BOUND_EN_CH3_V  0x00000001U
#define H264_DMA_IN_PAGE_BOUND_EN_CH3_S  12
/** H264_DMA_IN_RST_CH3 : R/W; bitpos: [24]; default: 0;
 *  Write 1 then write 0 to this bit to reset Rx channel
 */
#define H264_DMA_IN_RST_CH3    (BIT(24))
#define H264_DMA_IN_RST_CH3_M  (H264_DMA_IN_RST_CH3_V << H264_DMA_IN_RST_CH3_S)
#define H264_DMA_IN_RST_CH3_V  0x00000001U
#define H264_DMA_IN_RST_CH3_S  24
/** H264_DMA_IN_CMD_DISABLE_CH3 : R/W; bitpos: [25]; default: 0;
 *  Write 1 before reset and write 0 after reset
 */
#define H264_DMA_IN_CMD_DISABLE_CH3    (BIT(25))
#define H264_DMA_IN_CMD_DISABLE_CH3_M  (H264_DMA_IN_CMD_DISABLE_CH3_V << H264_DMA_IN_CMD_DISABLE_CH3_S)
#define H264_DMA_IN_CMD_DISABLE_CH3_V  0x00000001U
#define H264_DMA_IN_CMD_DISABLE_CH3_S  25
/** H264_DMA_IN_ARB_WEIGHT_OPT_DIS_CH3 : R/W; bitpos: [26]; default: 0;
 *  Set this bit to 1 to disable arbiter optimum weight function.
 */
#define H264_DMA_IN_ARB_WEIGHT_OPT_DIS_CH3    (BIT(26))
#define H264_DMA_IN_ARB_WEIGHT_OPT_DIS_CH3_M  (H264_DMA_IN_ARB_WEIGHT_OPT_DIS_CH3_V << H264_DMA_IN_ARB_WEIGHT_OPT_DIS_CH3_S)
#define H264_DMA_IN_ARB_WEIGHT_OPT_DIS_CH3_V  0x00000001U
#define H264_DMA_IN_ARB_WEIGHT_OPT_DIS_CH3_S  26

/** H264_DMA_IN_INT_RAW_CH3_REG register
 *  RX CH3  interrupt raw register
 */
#define H264_DMA_IN_INT_RAW_CH3_REG (DR_REG_H264_DMA_BASE + 0x804)
/** H264_DMA_IN_DONE_CH3_INT_RAW : R/WTC/SS; bitpos: [0]; default: 0;
 *  The raw interrupt bit turns to high level when the last data pointed by one inlink
 *  descriptor has been transmitted to peripherals for Rx channel 1.
 */
#define H264_DMA_IN_DONE_CH3_INT_RAW    (BIT(0))
#define H264_DMA_IN_DONE_CH3_INT_RAW_M  (H264_DMA_IN_DONE_CH3_INT_RAW_V << H264_DMA_IN_DONE_CH3_INT_RAW_S)
#define H264_DMA_IN_DONE_CH3_INT_RAW_V  0x00000001U
#define H264_DMA_IN_DONE_CH3_INT_RAW_S  0
/** H264_DMA_IN_SUC_EOF_CH3_INT_RAW : R/WTC/SS; bitpos: [1]; default: 0;
 *  The raw interrupt bit turns to high level when the last data pointed by one inlink
 *  descriptor has been received and no data error is detected for Rx channel 1.
 */
#define H264_DMA_IN_SUC_EOF_CH3_INT_RAW    (BIT(1))
#define H264_DMA_IN_SUC_EOF_CH3_INT_RAW_M  (H264_DMA_IN_SUC_EOF_CH3_INT_RAW_V << H264_DMA_IN_SUC_EOF_CH3_INT_RAW_S)
#define H264_DMA_IN_SUC_EOF_CH3_INT_RAW_V  0x00000001U
#define H264_DMA_IN_SUC_EOF_CH3_INT_RAW_S  1
/** H264_DMA_IN_ERR_EOF_CH3_INT_RAW : R/WTC/SS; bitpos: [2]; default: 0;
 *  The raw interrupt bit turns to high level when the last data pointed by one inlink
 *  descriptor has been received and data error is detected
 */
#define H264_DMA_IN_ERR_EOF_CH3_INT_RAW    (BIT(2))
#define H264_DMA_IN_ERR_EOF_CH3_INT_RAW_M  (H264_DMA_IN_ERR_EOF_CH3_INT_RAW_V << H264_DMA_IN_ERR_EOF_CH3_INT_RAW_S)
#define H264_DMA_IN_ERR_EOF_CH3_INT_RAW_V  0x00000001U
#define H264_DMA_IN_ERR_EOF_CH3_INT_RAW_S  2
/** H264_DMA_IN_DSCR_ERR_CH3_INT_RAW : R/WTC/SS; bitpos: [3]; default: 0;
 *  The raw interrupt bit turns to high level when detecting inlink descriptor error,
 *  including owner error, the second and third word error of inlink descriptor for Rx
 *  channel 1.
 */
#define H264_DMA_IN_DSCR_ERR_CH3_INT_RAW    (BIT(3))
#define H264_DMA_IN_DSCR_ERR_CH3_INT_RAW_M  (H264_DMA_IN_DSCR_ERR_CH3_INT_RAW_V << H264_DMA_IN_DSCR_ERR_CH3_INT_RAW_S)
#define H264_DMA_IN_DSCR_ERR_CH3_INT_RAW_V  0x00000001U
#define H264_DMA_IN_DSCR_ERR_CH3_INT_RAW_S  3
/** H264_DMA_INFIFO_OVF_L1_CH3_INT_RAW : R/WTC/SS; bitpos: [4]; default: 0;
 *  This raw interrupt bit turns to high level when fifo of Rx channel is overflow.
 */
#define H264_DMA_INFIFO_OVF_L1_CH3_INT_RAW    (BIT(4))
#define H264_DMA_INFIFO_OVF_L1_CH3_INT_RAW_M  (H264_DMA_INFIFO_OVF_L1_CH3_INT_RAW_V << H264_DMA_INFIFO_OVF_L1_CH3_INT_RAW_S)
#define H264_DMA_INFIFO_OVF_L1_CH3_INT_RAW_V  0x00000001U
#define H264_DMA_INFIFO_OVF_L1_CH3_INT_RAW_S  4
/** H264_DMA_INFIFO_UDF_L1_CH3_INT_RAW : R/WTC/SS; bitpos: [5]; default: 0;
 *  This raw interrupt bit turns to high level when fifo of Rx channel is underflow.
 */
#define H264_DMA_INFIFO_UDF_L1_CH3_INT_RAW    (BIT(5))
#define H264_DMA_INFIFO_UDF_L1_CH3_INT_RAW_M  (H264_DMA_INFIFO_UDF_L1_CH3_INT_RAW_V << H264_DMA_INFIFO_UDF_L1_CH3_INT_RAW_S)
#define H264_DMA_INFIFO_UDF_L1_CH3_INT_RAW_V  0x00000001U
#define H264_DMA_INFIFO_UDF_L1_CH3_INT_RAW_S  5
/** H264_DMA_INFIFO_OVF_L2_CH3_INT_RAW : R/WTC/SS; bitpos: [6]; default: 0;
 *  This raw interrupt bit turns to high level when fifo of Rx channel is overflow.
 */
#define H264_DMA_INFIFO_OVF_L2_CH3_INT_RAW    (BIT(6))
#define H264_DMA_INFIFO_OVF_L2_CH3_INT_RAW_M  (H264_DMA_INFIFO_OVF_L2_CH3_INT_RAW_V << H264_DMA_INFIFO_OVF_L2_CH3_INT_RAW_S)
#define H264_DMA_INFIFO_OVF_L2_CH3_INT_RAW_V  0x00000001U
#define H264_DMA_INFIFO_OVF_L2_CH3_INT_RAW_S  6
/** H264_DMA_INFIFO_UDF_L2_CH3_INT_RAW : R/WTC/SS; bitpos: [7]; default: 0;
 *  This raw interrupt bit turns to high level when fifo of Rx channel is underflow.
 */
#define H264_DMA_INFIFO_UDF_L2_CH3_INT_RAW    (BIT(7))
#define H264_DMA_INFIFO_UDF_L2_CH3_INT_RAW_M  (H264_DMA_INFIFO_UDF_L2_CH3_INT_RAW_V << H264_DMA_INFIFO_UDF_L2_CH3_INT_RAW_S)
#define H264_DMA_INFIFO_UDF_L2_CH3_INT_RAW_V  0x00000001U
#define H264_DMA_INFIFO_UDF_L2_CH3_INT_RAW_S  7
/** H264_DMA_IN_DSCR_EMPTY_CH3_INT_RAW : R/WTC/SS; bitpos: [8]; default: 0;
 *  The raw interrupt bit turns to high level when the last descriptor is done but fifo
 *  also remain data.
 */
#define H264_DMA_IN_DSCR_EMPTY_CH3_INT_RAW    (BIT(8))
#define H264_DMA_IN_DSCR_EMPTY_CH3_INT_RAW_M  (H264_DMA_IN_DSCR_EMPTY_CH3_INT_RAW_V << H264_DMA_IN_DSCR_EMPTY_CH3_INT_RAW_S)
#define H264_DMA_IN_DSCR_EMPTY_CH3_INT_RAW_V  0x00000001U
#define H264_DMA_IN_DSCR_EMPTY_CH3_INT_RAW_S  8
/** H264_DMA_IN_DSCR_TASK_OVF_CH3_INT_RAW : R/WTC/SS; bitpos: [9]; default: 0;
 *  The raw interrupt bit turns to high level when dscr ready task fifo is overflow.
 */
#define H264_DMA_IN_DSCR_TASK_OVF_CH3_INT_RAW    (BIT(9))
#define H264_DMA_IN_DSCR_TASK_OVF_CH3_INT_RAW_M  (H264_DMA_IN_DSCR_TASK_OVF_CH3_INT_RAW_V << H264_DMA_IN_DSCR_TASK_OVF_CH3_INT_RAW_S)
#define H264_DMA_IN_DSCR_TASK_OVF_CH3_INT_RAW_V  0x00000001U
#define H264_DMA_IN_DSCR_TASK_OVF_CH3_INT_RAW_S  9

