espressif/esp-idf/components/soc/esp32p4/register/hw_ver1/soc/h264_dma_reg.h
/** H264_DMA_IN_INT_ENA_CH3_REG register
 *  RX CH3  interrupt ena register
 */
#define H264_DMA_IN_INT_ENA_CH3_REG (DR_REG_H264_DMA_BASE + 0x808)
/** H264_DMA_IN_DONE_CH3_INT_ENA : R/W; bitpos: [0]; default: 0;
 *  The interrupt enable bit for the IN_DONE_CH_INT interrupt.
 */
#define H264_DMA_IN_DONE_CH3_INT_ENA    (BIT(0))
#define H264_DMA_IN_DONE_CH3_INT_ENA_M  (H264_DMA_IN_DONE_CH3_INT_ENA_V << H264_DMA_IN_DONE_CH3_INT_ENA_S)
#define H264_DMA_IN_DONE_CH3_INT_ENA_V  0x00000001U
#define H264_DMA_IN_DONE_CH3_INT_ENA_S  0
/** H264_DMA_IN_SUC_EOF_CH3_INT_ENA : R/W; bitpos: [1]; default: 0;
 *  The interrupt enable bit for the IN_SUC_EOF_CH_INT interrupt.
 */
#define H264_DMA_IN_SUC_EOF_CH3_INT_ENA    (BIT(1))
#define H264_DMA_IN_SUC_EOF_CH3_INT_ENA_M  (H264_DMA_IN_SUC_EOF_CH3_INT_ENA_V << H264_DMA_IN_SUC_EOF_CH3_INT_ENA_S)
#define H264_DMA_IN_SUC_EOF_CH3_INT_ENA_V  0x00000001U
#define H264_DMA_IN_SUC_EOF_CH3_INT_ENA_S  1
/** H264_DMA_IN_ERR_EOF_CH3_INT_ENA : R/W; bitpos: [2]; default: 0;
 *  The interrupt enable bit for the IN_ERR_EOF_CH_INT interrupt.
 */
#define H264_DMA_IN_ERR_EOF_CH3_INT_ENA    (BIT(2))
#define H264_DMA_IN_ERR_EOF_CH3_INT_ENA_M  (H264_DMA_IN_ERR_EOF_CH3_INT_ENA_V << H264_DMA_IN_ERR_EOF_CH3_INT_ENA_S)
#define H264_DMA_IN_ERR_EOF_CH3_INT_ENA_V  0x00000001U
#define H264_DMA_IN_ERR_EOF_CH3_INT_ENA_S  2
/** H264_DMA_IN_DSCR_ERR_CH3_INT_ENA : R/W; bitpos: [3]; default: 0;
 *  The interrupt enable bit for the IN_DSCR_ERR_CH_INT interrupt.
 */
#define H264_DMA_IN_DSCR_ERR_CH3_INT_ENA    (BIT(3))
#define H264_DMA_IN_DSCR_ERR_CH3_INT_ENA_M  (H264_DMA_IN_DSCR_ERR_CH3_INT_ENA_V << H264_DMA_IN_DSCR_ERR_CH3_INT_ENA_S)
#define H264_DMA_IN_DSCR_ERR_CH3_INT_ENA_V  0x00000001U
#define H264_DMA_IN_DSCR_ERR_CH3_INT_ENA_S  3
/** H264_DMA_INFIFO_OVF_L1_CH3_INT_ENA : R/W; bitpos: [4]; default: 0;
 *  The interrupt enable bit for the INFIFO_OVF_L1_CH_INT interrupt.
 */
#define H264_DMA_INFIFO_OVF_L1_CH3_INT_ENA    (BIT(4))
#define H264_DMA_INFIFO_OVF_L1_CH3_INT_ENA_M  (H264_DMA_INFIFO_OVF_L1_CH3_INT_ENA_V << H264_DMA_INFIFO_OVF_L1_CH3_INT_ENA_S)
#define H264_DMA_INFIFO_OVF_L1_CH3_INT_ENA_V  0x00000001U
#define H264_DMA_INFIFO_OVF_L1_CH3_INT_ENA_S  4
/** H264_DMA_INFIFO_UDF_L1_CH3_INT_ENA : R/W; bitpos: [5]; default: 0;
 *  The interrupt enable bit for the INFIFO_UDF_L1_CH_INT interrupt.
 */
#define H264_DMA_INFIFO_UDF_L1_CH3_INT_ENA    (BIT(5))
#define H264_DMA_INFIFO_UDF_L1_CH3_INT_ENA_M  (H264_DMA_INFIFO_UDF_L1_CH3_INT_ENA_V << H264_DMA_INFIFO_UDF_L1_CH3_INT_ENA_S)
#define H264_DMA_INFIFO_UDF_L1_CH3_INT_ENA_V  0x00000001U
#define H264_DMA_INFIFO_UDF_L1_CH3_INT_ENA_S  5
/** H264_DMA_INFIFO_OVF_L2_CH3_INT_ENA : R/W; bitpos: [6]; default: 0;
 *  The interrupt enable bit for the INFIFO_OVF_L2_CH_INT interrupt.
 */
#define H264_DMA_INFIFO_OVF_L2_CH3_INT_ENA    (BIT(6))
#define H264_DMA_INFIFO_OVF_L2_CH3_INT_ENA_M  (H264_DMA_INFIFO_OVF_L2_CH3_INT_ENA_V << H264_DMA_INFIFO_OVF_L2_CH3_INT_ENA_S)
#define H264_DMA_INFIFO_OVF_L2_CH3_INT_ENA_V  0x00000001U
#define H264_DMA_INFIFO_OVF_L2_CH3_INT_ENA_S  6
/** H264_DMA_INFIFO_UDF_L2_CH3_INT_ENA : R/W; bitpos: [7]; default: 0;
 *  The interrupt enable bit for the INFIFO_UDF_L2_CH_INT interrupt.
 */
#define H264_DMA_INFIFO_UDF_L2_CH3_INT_ENA    (BIT(7))
#define H264_DMA_INFIFO_UDF_L2_CH3_INT_ENA_M  (H264_DMA_INFIFO_UDF_L2_CH3_INT_ENA_V << H264_DMA_INFIFO_UDF_L2_CH3_INT_ENA_S)
#define H264_DMA_INFIFO_UDF_L2_CH3_INT_ENA_V  0x00000001U
#define H264_DMA_INFIFO_UDF_L2_CH3_INT_ENA_S  7
/** H264_DMA_IN_DSCR_EMPTY_CH3_INT_ENA : R/W; bitpos: [8]; default: 0;
 *  The interrupt enable bit for the IN_DSCR_EMPTY_CH_INT interrupt.
 */
#define H264_DMA_IN_DSCR_EMPTY_CH3_INT_ENA    (BIT(8))
#define H264_DMA_IN_DSCR_EMPTY_CH3_INT_ENA_M  (H264_DMA_IN_DSCR_EMPTY_CH3_INT_ENA_V << H264_DMA_IN_DSCR_EMPTY_CH3_INT_ENA_S)
#define H264_DMA_IN_DSCR_EMPTY_CH3_INT_ENA_V  0x00000001U
#define H264_DMA_IN_DSCR_EMPTY_CH3_INT_ENA_S  8
/** H264_DMA_IN_DSCR_TASK_OVF_CH3_INT_ENA : R/W; bitpos: [9]; default: 0;
 *  The interrupt enable bit for the IN_DSCR_TASK_OVF_CH_INT interrupt.
 */
#define H264_DMA_IN_DSCR_TASK_OVF_CH3_INT_ENA    (BIT(9))
#define H264_DMA_IN_DSCR_TASK_OVF_CH3_INT_ENA_M  (H264_DMA_IN_DSCR_TASK_OVF_CH3_INT_ENA_V << H264_DMA_IN_DSCR_TASK_OVF_CH3_INT_ENA_S)
#define H264_DMA_IN_DSCR_TASK_OVF_CH3_INT_ENA_V  0x00000001U
#define H264_DMA_IN_DSCR_TASK_OVF_CH3_INT_ENA_S  9

/** H264_DMA_IN_INT_ST_CH3_REG register
 *  RX CH3  interrupt st register
 */
#define H264_DMA_IN_INT_ST_CH3_REG (DR_REG_H264_DMA_BASE + 0x80c)
/** H264_DMA_IN_DONE_CH3_INT_ST : RO; bitpos: [0]; default: 0;
 *  The raw interrupt status bit for the IN_DONE_CH_INT interrupt.
 */
#define H264_DMA_IN_DONE_CH3_INT_ST    (BIT(0))
#define H264_DMA_IN_DONE_CH3_INT_ST_M  (H264_DMA_IN_DONE_CH3_INT_ST_V << H264_DMA_IN_DONE_CH3_INT_ST_S)
#define H264_DMA_IN_DONE_CH3_INT_ST_V  0x00000001U
#define H264_DMA_IN_DONE_CH3_INT_ST_S  0
/** H264_DMA_IN_SUC_EOF_CH3_INT_ST : RO; bitpos: [1]; default: 0;
 *  The raw interrupt status bit for the IN_SUC_EOF_CH_INT interrupt.
 */
#define H264_DMA_IN_SUC_EOF_CH3_INT_ST    (BIT(1))
#define H264_DMA_IN_SUC_EOF_CH3_INT_ST_M  (H264_DMA_IN_SUC_EOF_CH3_INT_ST_V << H264_DMA_IN_SUC_EOF_CH3_INT_ST_S)
#define H264_DMA_IN_SUC_EOF_CH3_INT_ST_V  0x00000001U
#define H264_DMA_IN_SUC_EOF_CH3_INT_ST_S  1
/** H264_DMA_IN_ERR_EOF_CH3_INT_ST : RO; bitpos: [2]; default: 0;
 *  The raw interrupt status bit for the IN_ERR_EOF_CH_INT interrupt.
 */
#define H264_DMA_IN_ERR_EOF_CH3_INT_ST    (BIT(2))
#define H264_DMA_IN_ERR_EOF_CH3_INT_ST_M  (H264_DMA_IN_ERR_EOF_CH3_INT_ST_V << H264_DMA_IN_ERR_EOF_CH3_INT_ST_S)
#define H264_DMA_IN_ERR_EOF_CH3_INT_ST_V  0x00000001U
#define H264_DMA_IN_ERR_EOF_CH3_INT_ST_S  2
/** H264_DMA_IN_DSCR_ERR_CH3_INT_ST : RO; bitpos: [3]; default: 0;
 *  The raw interrupt status bit for the IN_DSCR_ERR_CH_INT interrupt.
 */
#define H264_DMA_IN_DSCR_ERR_CH3_INT_ST    (BIT(3))
#define H264_DMA_IN_DSCR_ERR_CH3_INT_ST_M  (H264_DMA_IN_DSCR_ERR_CH3_INT_ST_V << H264_DMA_IN_DSCR_ERR_CH3_INT_ST_S)
#define H264_DMA_IN_DSCR_ERR_CH3_INT_ST_V  0x00000001U
#define H264_DMA_IN_DSCR_ERR_CH3_INT_ST_S  3
/** H264_DMA_INFIFO_OVF_L1_CH3_INT_ST : RO; bitpos: [4]; default: 0;
 *  The raw interrupt status bit for the INFIFO_OVF_L1_CH_INT interrupt.
 */
#define H264_DMA_INFIFO_OVF_L1_CH3_INT_ST    (BIT(4))
#define H264_DMA_INFIFO_OVF_L1_CH3_INT_ST_M  (H264_DMA_INFIFO_OVF_L1_CH3_INT_ST_V << H264_DMA_INFIFO_OVF_L1_CH3_INT_ST_S)
#define H264_DMA_INFIFO_OVF_L1_CH3_INT_ST_V  0x00000001U
#define H264_DMA_INFIFO_OVF_L1_CH3_INT_ST_S  4
/** H264_DMA_INFIFO_UDF_L1_CH3_INT_ST : RO; bitpos: [5]; default: 0;
 *  The raw interrupt status bit for the INFIFO_UDF_L1_CH_INT interrupt.
 */
#define H264_DMA_INFIFO_UDF_L1_CH3_INT_ST    (BIT(5))
#define H264_DMA_INFIFO_UDF_L1_CH3_INT_ST_M  (H264_DMA_INFIFO_UDF_L1_CH3_INT_ST_V << H264_DMA_INFIFO_UDF_L1_CH3_INT_ST_S)
#define H264_DMA_INFIFO_UDF_L1_CH3_INT_ST_V  0x00000001U
#define H264_DMA_INFIFO_UDF_L1_CH3_INT_ST_S  5
/** H264_DMA_INFIFO_OVF_L2_CH3_INT_ST : RO; bitpos: [6]; default: 0;
 *  The raw interrupt status bit for the INFIFO_OVF_L2_CH_INT interrupt.
 */
#define H264_DMA_INFIFO_OVF_L2_CH3_INT_ST    (BIT(6))
#define H264_DMA_INFIFO_OVF_L2_CH3_INT_ST_M  (H264_DMA_INFIFO_OVF_L2_CH3_INT_ST_V << H264_DMA_INFIFO_OVF_L2_CH3_INT_ST_S)
#define H264_DMA_INFIFO_OVF_L2_CH3_INT_ST_V  0x00000001U
#define H264_DMA_INFIFO_OVF_L2_CH3_INT_ST_S  6
/** H264_DMA_INFIFO_UDF_L2_CH3_INT_ST : RO; bitpos: [7]; default: 0;
 *  The raw interrupt status bit for the INFIFO_UDF_L2_CH_INT interrupt.
 */
#define H264_DMA_INFIFO_UDF_L2_CH3_INT_ST    (BIT(7))
#define H264_DMA_INFIFO_UDF_L2_CH3_INT_ST_M  (H264_DMA_INFIFO_UDF_L2_CH3_INT_ST_V << H264_DMA_INFIFO_UDF_L2_CH3_INT_ST_S)
#define H264_DMA_INFIFO_UDF_L2_CH3_INT_ST_V  0x00000001U
#define H264_DMA_INFIFO_UDF_L2_CH3_INT_ST_S  7
/** H264_DMA_IN_DSCR_EMPTY_CH3_INT_ST : RO; bitpos: [8]; default: 0;
 *  The raw interrupt status bit for the IN_DSCR_EMPTY_CH_INT interrupt.
 */
#define H264_DMA_IN_DSCR_EMPTY_CH3_INT_ST    (BIT(8))
#define H264_DMA_IN_DSCR_EMPTY_CH3_INT_ST_M  (H264_DMA_IN_DSCR_EMPTY_CH3_INT_ST_V << H264_DMA_IN_DSCR_EMPTY_CH3_INT_ST_S)
#define H264_DMA_IN_DSCR_EMPTY_CH3_INT_ST_V  0x00000001U
#define H264_DMA_IN_DSCR_EMPTY_CH3_INT_ST_S  8
/** H264_DMA_IN_DSCR_TASK_OVF_CH3_INT_ST : RO; bitpos: [9]; default: 0;
 *  The raw interrupt status bit for the IN_DSCR_TASK_OVF_CH_INT interrupt.
 */
#define H264_DMA_IN_DSCR_TASK_OVF_CH3_INT_ST    (BIT(9))
#define H264_DMA_IN_DSCR_TASK_OVF_CH3_INT_ST_M  (H264_DMA_IN_DSCR_TASK_OVF_CH3_INT_ST_V << H264_DMA_IN_DSCR_TASK_OVF_CH3_INT_ST_S)
#define H264_DMA_IN_DSCR_TASK_OVF_CH3_INT_ST_V  0x00000001U
#define H264_DMA_IN_DSCR_TASK_OVF_CH3_INT_ST_S  9

/** H264_DMA_IN_INT_CLR_CH3_REG register
 *  RX CH3  interrupt clr register
 */
#define H264_DMA_IN_INT_CLR_CH3_REG (DR_REG_H264_DMA_BASE + 0x810)
/** H264_DMA_IN_DONE_CH3_INT_CLR : WT; bitpos: [0]; default: 0;
 *  Set this bit to clear the IN_DONE_CH_INT interrupt.
 */
#define H264_DMA_IN_DONE_CH3_INT_CLR    (BIT(0))
#define H264_DMA_IN_DONE_CH3_INT_CLR_M  (H264_DMA_IN_DONE_CH3_INT_CLR_V << H264_DMA_IN_DONE_CH3_INT_CLR_S)
#define H264_DMA_IN_DONE_CH3_INT_CLR_V  0x00000001U
#define H264_DMA_IN_DONE_CH3_INT_CLR_S  0
/** H264_DMA_IN_SUC_EOF_CH3_INT_CLR : WT; bitpos: [1]; default: 0;
 *  Set this bit to clear the IN_SUC_EOF_CH_INT interrupt.
 */
#define H264_DMA_IN_SUC_EOF_CH3_INT_CLR    (BIT(1))
#define H264_DMA_IN_SUC_EOF_CH3_INT_CLR_M  (H264_DMA_IN_SUC_EOF_CH3_INT_CLR_V << H264_DMA_IN_SUC_EOF_CH3_INT_CLR_S)
#define H264_DMA_IN_SUC_EOF_CH3_INT_CLR_V  0x00000001U
#define H264_DMA_IN_SUC_EOF_CH3_INT_CLR_S  1
/** H264_DMA_IN_ERR_EOF_CH3_INT_CLR : WT; bitpos: [2]; default: 0;
 *  Set this bit to clear the IN_ERR_EOF_CH_INT interrupt.
 */
#define H264_DMA_IN_ERR_EOF_CH3_INT_CLR    (BIT(2))
#define H264_DMA_IN_ERR_EOF_CH3_INT_CLR_M  (H264_DMA_IN_ERR_EOF_CH3_INT_CLR_V << H264_DMA_IN_ERR_EOF_CH3_INT_CLR_S)
#define H264_DMA_IN_ERR_EOF_CH3_INT_CLR_V  0x00000001U
#define H264_DMA_IN_ERR_EOF_CH3_INT_CLR_S  2
/** H264_DMA_IN_DSCR_ERR_CH3_INT_CLR : WT; bitpos: [3]; default: 0;
 *  Set this bit to clear the INDSCR_ERR_CH_INT interrupt.
 */
#define H264_DMA_IN_DSCR_ERR_CH3_INT_CLR    (BIT(3))
#define H264_DMA_IN_DSCR_ERR_CH3_INT_CLR_M  (H264_DMA_IN_DSCR_ERR_CH3_INT_CLR_V << H264_DMA_IN_DSCR_ERR_CH3_INT_CLR_S)
#define H264_DMA_IN_DSCR_ERR_CH3_INT_CLR_V  0x00000001U
#define H264_DMA_IN_DSCR_ERR_CH3_INT_CLR_S  3
/** H264_DMA_INFIFO_OVF_L1_CH3_INT_CLR : WT; bitpos: [4]; default: 0;
 *  Set this bit to clear the INFIFO_OVF_L1_CH_INT interrupt.
 */
#define H264_DMA_INFIFO_OVF_L1_CH3_INT_CLR    (BIT(4))
#define H264_DMA_INFIFO_OVF_L1_CH3_INT_CLR_M  (H264_DMA_INFIFO_OVF_L1_CH3_INT_CLR_V << H264_DMA_INFIFO_OVF_L1_CH3_INT_CLR_S)
#define H264_DMA_INFIFO_OVF_L1_CH3_INT_CLR_V  0x00000001U
#define H264_DMA_INFIFO_OVF_L1_CH3_INT_CLR_S  4
/** H264_DMA_INFIFO_UDF_L1_CH3_INT_CLR : WT; bitpos: [5]; default: 0;
 *  Set this bit to clear the INFIFO_UDF_L1_CH_INT interrupt.
 */
#define H264_DMA_INFIFO_UDF_L1_CH3_INT_CLR    (BIT(5))
#define H264_DMA_INFIFO_UDF_L1_CH3_INT_CLR_M  (H264_DMA_INFIFO_UDF_L1_CH3_INT_CLR_V << H264_DMA_INFIFO_UDF_L1_CH3_INT_CLR_S)
#define H264_DMA_INFIFO_UDF_L1_CH3_INT_CLR_V  0x00000001U
#define H264_DMA_INFIFO_UDF_L1_CH3_INT_CLR_S  5
/** H264_DMA_INFIFO_OVF_L2_CH3_INT_CLR : WT; bitpos: [6]; default: 0;
 *  Set this bit to clear the INFIFO_OVF_L2_CH_INT interrupt.
 */
#define H264_DMA_INFIFO_OVF_L2_CH3_INT_CLR    (BIT(6))
#define H264_DMA_INFIFO_OVF_L2_CH3_INT_CLR_M  (H264_DMA_INFIFO_OVF_L2_CH3_INT_CLR_V << H264_DMA_INFIFO_OVF_L2_CH3_INT_CLR_S)
#define H264_DMA_INFIFO_OVF_L2_CH3_INT_CLR_V  0x00000001U
#define H264_DMA_INFIFO_OVF_L2_CH3_INT_CLR_S  6
/** H264_DMA_INFIFO_UDF_L2_CH3_INT_CLR : WT; bitpos: [7]; default: 0;
 *  Set this bit to clear the INFIFO_UDF_L2_CH_INT interrupt.
 */
#define H264_DMA_INFIFO_UDF_L2_CH3_INT_CLR    (BIT(7))
#define H264_DMA_INFIFO_UDF_L2_CH3_INT_CLR_M  (H264_DMA_INFIFO_UDF_L2_CH3_INT_CLR_V << H264_DMA_INFIFO_UDF_L2_CH3_INT_CLR_S)
#define H264_DMA_INFIFO_UDF_L2_CH3_INT_CLR_V  0x00000001U
#define H264_DMA_INFIFO_UDF_L2_CH3_INT_CLR_S  7
/** H264_DMA_IN_DSCR_EMPTY_CH3_INT_CLR : WT; bitpos: [8]; default: 0;
 *  Set this bit to clear the IN_DSCR_EMPTY_CH_INT interrupt.
 */
#define H264_DMA_IN_DSCR_EMPTY_CH3_INT_CLR    (BIT(8))
#define H264_DMA_IN_DSCR_EMPTY_CH3_INT_CLR_M  (H264_DMA_IN_DSCR_EMPTY_CH3_INT_CLR_V << H264_DMA_IN_DSCR_EMPTY_CH3_INT_CLR_S)
#define H264_DMA_IN_DSCR_EMPTY_CH3_INT_CLR_V  0x00000001U
#define H264_DMA_IN_DSCR_EMPTY_CH3_INT_CLR_S  8
/** H264_DMA_IN_DSCR_TASK_OVF_CH3_INT_CLR : WT; bitpos: [9]; default: 0;
 *  Set this bit to clear the IN_DSCR_TASK_OVF_CH_INT interrupt.
 */
#define H264_DMA_IN_DSCR_TASK_OVF_CH3_INT_CLR    (BIT(9))
#define H264_DMA_IN_DSCR_TASK_OVF_CH3_INT_CLR_M  (H264_DMA_IN_DSCR_TASK_OVF_CH3_INT_CLR_V << H264_DMA_IN_DSCR_TASK_OVF_CH3_INT_CLR_S)
#define H264_DMA_IN_DSCR_TASK_OVF_CH3_INT_CLR_V  0x00000001U
#define H264_DMA_IN_DSCR_TASK_OVF_CH3_INT_CLR_S  9

