espressif/esp-idf/components/soc/esp32p4/register/hw_ver1/soc/h264_dma_reg.h
/** H264_DMA_IN_DSCR_BF1_CH3_REG register
 *  RX CH3 second-to-last dscr addr register
 */
#define H264_DMA_IN_DSCR_BF1_CH3_REG (DR_REG_H264_DMA_BASE + 0x838)
/** H264_DMA_INLINK_DSCR_BF1_CH3 : RO; bitpos: [31:0]; default: 0;
 *  The address of the second-to-last inlink descriptor's next address x-2.
 */
#define H264_DMA_INLINK_DSCR_BF1_CH3    0xFFFFFFFFU
#define H264_DMA_INLINK_DSCR_BF1_CH3_M  (H264_DMA_INLINK_DSCR_BF1_CH3_V << H264_DMA_INLINK_DSCR_BF1_CH3_S)
#define H264_DMA_INLINK_DSCR_BF1_CH3_V  0xFFFFFFFFU
#define H264_DMA_INLINK_DSCR_BF1_CH3_S  0

/** H264_DMA_IN_ARB_CH3_REG register
 *  RX CH3 arb register
 */
#define H264_DMA_IN_ARB_CH3_REG (DR_REG_H264_DMA_BASE + 0x840)
/** H264_DMA_IN_ARB_TOKEN_NUM_CH3 : R/W; bitpos: [3:0]; default: 1;
 *  Set the max number of token count of arbiter
 */
#define H264_DMA_IN_ARB_TOKEN_NUM_CH3    0x0000000FU
#define H264_DMA_IN_ARB_TOKEN_NUM_CH3_M  (H264_DMA_IN_ARB_TOKEN_NUM_CH3_V << H264_DMA_IN_ARB_TOKEN_NUM_CH3_S)
#define H264_DMA_IN_ARB_TOKEN_NUM_CH3_V  0x0000000FU
#define H264_DMA_IN_ARB_TOKEN_NUM_CH3_S  0
/** H264_DMA_INTER_IN_ARB_PRIORITY_CH3 : R/W; bitpos: [8:6]; default: 1;
 *  Set the priority of channel
 */
#define H264_DMA_INTER_IN_ARB_PRIORITY_CH3    0x00000007U
#define H264_DMA_INTER_IN_ARB_PRIORITY_CH3_M  (H264_DMA_INTER_IN_ARB_PRIORITY_CH3_V << H264_DMA_INTER_IN_ARB_PRIORITY_CH3_S)
#define H264_DMA_INTER_IN_ARB_PRIORITY_CH3_V  0x00000007U
#define H264_DMA_INTER_IN_ARB_PRIORITY_CH3_S  6

/** H264_DMA_IN_ETM_CONF_CH3_REG register
 *  RX CH3 ETM config register
 */
#define H264_DMA_IN_ETM_CONF_CH3_REG (DR_REG_H264_DMA_BASE + 0x848)
/** H264_DMA_IN_ETM_EN_CH3 : R/W; bitpos: [0]; default: 0;
 *  Set this bit to 1 to enable ETM task function
 */
#define H264_DMA_IN_ETM_EN_CH3    (BIT(0))
#define H264_DMA_IN_ETM_EN_CH3_M  (H264_DMA_IN_ETM_EN_CH3_V << H264_DMA_IN_ETM_EN_CH3_S)
#define H264_DMA_IN_ETM_EN_CH3_V  0x00000001U
#define H264_DMA_IN_ETM_EN_CH3_S  0
/** H264_DMA_IN_ETM_LOOP_EN_CH3 : R/W; bitpos: [1]; default: 0;
 *  when this bit is 1, dscr can be processed after receiving a task
 */
#define H264_DMA_IN_ETM_LOOP_EN_CH3    (BIT(1))
#define H264_DMA_IN_ETM_LOOP_EN_CH3_M  (H264_DMA_IN_ETM_LOOP_EN_CH3_V << H264_DMA_IN_ETM_LOOP_EN_CH3_S)
#define H264_DMA_IN_ETM_LOOP_EN_CH3_V  0x00000001U
#define H264_DMA_IN_ETM_LOOP_EN_CH3_S  1
/** H264_DMA_IN_DSCR_TASK_MAK_CH3 : R/W; bitpos: [3:2]; default: 1;
 *  ETM dscr_ready maximum cache numbers
 */
#define H264_DMA_IN_DSCR_TASK_MAK_CH3    0x00000003U
#define H264_DMA_IN_DSCR_TASK_MAK_CH3_M  (H264_DMA_IN_DSCR_TASK_MAK_CH3_V << H264_DMA_IN_DSCR_TASK_MAK_CH3_S)
#define H264_DMA_IN_DSCR_TASK_MAK_CH3_V  0x00000003U
#define H264_DMA_IN_DSCR_TASK_MAK_CH3_S  2

/** H264_DMA_IN_FIFO_CNT_CH3_REG register
 *  rx CH3 fifo cnt register
 */
#define H264_DMA_IN_FIFO_CNT_CH3_REG (DR_REG_H264_DMA_BASE + 0x880)
/** H264_DMA_IN_CMDFIFO_INFIFO_CNT_CH3 : RO; bitpos: [9:0]; default: 0;
 *  only for debug
 */
#define H264_DMA_IN_CMDFIFO_INFIFO_CNT_CH3    0x000003FFU
#define H264_DMA_IN_CMDFIFO_INFIFO_CNT_CH3_M  (H264_DMA_IN_CMDFIFO_INFIFO_CNT_CH3_V << H264_DMA_IN_CMDFIFO_INFIFO_CNT_CH3_S)
#define H264_DMA_IN_CMDFIFO_INFIFO_CNT_CH3_V  0x000003FFU
#define H264_DMA_IN_CMDFIFO_INFIFO_CNT_CH3_S  0

/** H264_DMA_IN_POP_DATA_CNT_CH3_REG register
 *  rx CH3 pop data cnt register
 */
#define H264_DMA_IN_POP_DATA_CNT_CH3_REG (DR_REG_H264_DMA_BASE + 0x884)
/** H264_DMA_IN_CMDFIFO_POP_DATA_CNT_CH3 : RO; bitpos: [7:0]; default: 7;
 *  only for debug
 */
#define H264_DMA_IN_CMDFIFO_POP_DATA_CNT_CH3    0x000000FFU
#define H264_DMA_IN_CMDFIFO_POP_DATA_CNT_CH3_M  (H264_DMA_IN_CMDFIFO_POP_DATA_CNT_CH3_V << H264_DMA_IN_CMDFIFO_POP_DATA_CNT_CH3_S)
#define H264_DMA_IN_CMDFIFO_POP_DATA_CNT_CH3_V  0x000000FFU
#define H264_DMA_IN_CMDFIFO_POP_DATA_CNT_CH3_S  0

/** H264_DMA_IN_XADDR_CH3_REG register
 *  rx CH3 xaddr register
 */
#define H264_DMA_IN_XADDR_CH3_REG (DR_REG_H264_DMA_BASE + 0x888)
/** H264_DMA_IN_CMDFIFO_XADDR_CH3 : RO; bitpos: [31:0]; default: 0;
 *  only for debug
 */
#define H264_DMA_IN_CMDFIFO_XADDR_CH3    0xFFFFFFFFU
#define H264_DMA_IN_CMDFIFO_XADDR_CH3_M  (H264_DMA_IN_CMDFIFO_XADDR_CH3_V << H264_DMA_IN_CMDFIFO_XADDR_CH3_S)
#define H264_DMA_IN_CMDFIFO_XADDR_CH3_V  0xFFFFFFFFU
#define H264_DMA_IN_CMDFIFO_XADDR_CH3_S  0

/** H264_DMA_IN_BUF_HB_RCV_CH3_REG register
 *  rx CH3 buf len hb rcv register
 */
#define H264_DMA_IN_BUF_HB_RCV_CH3_REG (DR_REG_H264_DMA_BASE + 0x88c)
/** H264_DMA_IN_CMDFIFO_BUF_HB_RCV_CH3 : RO; bitpos: [28:0]; default: 0;
 *  only for debug
 */
#define H264_DMA_IN_CMDFIFO_BUF_HB_RCV_CH3    0x1FFFFFFFU
#define H264_DMA_IN_CMDFIFO_BUF_HB_RCV_CH3_M  (H264_DMA_IN_CMDFIFO_BUF_HB_RCV_CH3_V << H264_DMA_IN_CMDFIFO_BUF_HB_RCV_CH3_S)
#define H264_DMA_IN_CMDFIFO_BUF_HB_RCV_CH3_V  0x1FFFFFFFU
#define H264_DMA_IN_CMDFIFO_BUF_HB_RCV_CH3_S  0

/** H264_DMA_IN_CONF0_CH4_REG register
 *  RX CH4 config0 register
 */
#define H264_DMA_IN_CONF0_CH4_REG (DR_REG_H264_DMA_BASE + 0x900)
/** H264_DMA_INDSCR_BURST_EN_CH4 : R/W; bitpos: [2]; default: 0;
 *  Set this bit to 1 to enable INCR burst transfer for Rx transmitting link descriptor
 *  when accessing SRAM.
 */
#define H264_DMA_INDSCR_BURST_EN_CH4    (BIT(2))
#define H264_DMA_INDSCR_BURST_EN_CH4_M  (H264_DMA_INDSCR_BURST_EN_CH4_V << H264_DMA_INDSCR_BURST_EN_CH4_S)
#define H264_DMA_INDSCR_BURST_EN_CH4_V  0x00000001U
#define H264_DMA_INDSCR_BURST_EN_CH4_S  2
/** H264_DMA_IN_ECC_AES_EN_CH4 : R/W; bitpos: [3]; default: 0;
 *  When access address space is ecc/aes area, this bit should be set to 1. In this
 *  case, the start address of square should be 16-bit aligned. The width of square
 *  multiply byte number of one pixel should be 16-bit aligned.
 */
#define H264_DMA_IN_ECC_AES_EN_CH4    (BIT(3))
#define H264_DMA_IN_ECC_AES_EN_CH4_M  (H264_DMA_IN_ECC_AES_EN_CH4_V << H264_DMA_IN_ECC_AES_EN_CH4_S)
#define H264_DMA_IN_ECC_AES_EN_CH4_V  0x00000001U
#define H264_DMA_IN_ECC_AES_EN_CH4_S  3
/** H264_DMA_IN_CHECK_OWNER_CH4 : R/W; bitpos: [4]; default: 0;
 *  Set this bit to enable checking the owner attribute of the link descriptor.
 */
#define H264_DMA_IN_CHECK_OWNER_CH4    (BIT(4))
#define H264_DMA_IN_CHECK_OWNER_CH4_M  (H264_DMA_IN_CHECK_OWNER_CH4_V << H264_DMA_IN_CHECK_OWNER_CH4_S)
#define H264_DMA_IN_CHECK_OWNER_CH4_V  0x00000001U
#define H264_DMA_IN_CHECK_OWNER_CH4_S  4
/** H264_DMA_IN_MEM_BURST_LENGTH_CH4 : R/W; bitpos: [8:6]; default: 0;
 *  Block size of Rx channel 1. 0: single      1: 16 bytes      2: 32 bytes    3: 64
 *  bytes    4: 128 bytes
 */
#define H264_DMA_IN_MEM_BURST_LENGTH_CH4    0x00000007U
#define H264_DMA_IN_MEM_BURST_LENGTH_CH4_M  (H264_DMA_IN_MEM_BURST_LENGTH_CH4_V << H264_DMA_IN_MEM_BURST_LENGTH_CH4_S)
#define H264_DMA_IN_MEM_BURST_LENGTH_CH4_V  0x00000007U
#define H264_DMA_IN_MEM_BURST_LENGTH_CH4_S  6
/** H264_DMA_IN_PAGE_BOUND_EN_CH4 : R/W; bitpos: [12]; default: 0;
 *  Set this bit to 1 to make sure AXI write data don't cross the address boundary
 *  which define by mem_burst_length
 */
#define H264_DMA_IN_PAGE_BOUND_EN_CH4    (BIT(12))
#define H264_DMA_IN_PAGE_BOUND_EN_CH4_M  (H264_DMA_IN_PAGE_BOUND_EN_CH4_V << H264_DMA_IN_PAGE_BOUND_EN_CH4_S)
#define H264_DMA_IN_PAGE_BOUND_EN_CH4_V  0x00000001U
#define H264_DMA_IN_PAGE_BOUND_EN_CH4_S  12
/** H264_DMA_IN_RST_CH4 : R/W; bitpos: [24]; default: 0;
 *  Write 1 then write 0 to this bit to reset Rx channel
 */
#define H264_DMA_IN_RST_CH4    (BIT(24))
#define H264_DMA_IN_RST_CH4_M  (H264_DMA_IN_RST_CH4_V << H264_DMA_IN_RST_CH4_S)
#define H264_DMA_IN_RST_CH4_V  0x00000001U
#define H264_DMA_IN_RST_CH4_S  24
/** H264_DMA_IN_CMD_DISABLE_CH4 : R/W; bitpos: [25]; default: 0;
 *  Write 1 before reset and write 0 after reset
 */
#define H264_DMA_IN_CMD_DISABLE_CH4    (BIT(25))
#define H264_DMA_IN_CMD_DISABLE_CH4_M  (H264_DMA_IN_CMD_DISABLE_CH4_V << H264_DMA_IN_CMD_DISABLE_CH4_S)
#define H264_DMA_IN_CMD_DISABLE_CH4_V  0x00000001U
#define H264_DMA_IN_CMD_DISABLE_CH4_S  25
/** H264_DMA_IN_ARB_WEIGHT_OPT_DIS_CH4 : R/W; bitpos: [26]; default: 0;
 *  Set this bit to 1 to disable arbiter optimum weight function.
 */
#define H264_DMA_IN_ARB_WEIGHT_OPT_DIS_CH4    (BIT(26))
#define H264_DMA_IN_ARB_WEIGHT_OPT_DIS_CH4_M  (H264_DMA_IN_ARB_WEIGHT_OPT_DIS_CH4_V << H264_DMA_IN_ARB_WEIGHT_OPT_DIS_CH4_S)
#define H264_DMA_IN_ARB_WEIGHT_OPT_DIS_CH4_V  0x00000001U
#define H264_DMA_IN_ARB_WEIGHT_OPT_DIS_CH4_S  26

/** H264_DMA_IN_INT_RAW_CH4_REG register
 *  RX CH4  interrupt raw register
 */
#define H264_DMA_IN_INT_RAW_CH4_REG (DR_REG_H264_DMA_BASE + 0x904)
/** H264_DMA_IN_DONE_CH4_INT_RAW : R/WTC/SS; bitpos: [0]; default: 0;
 *  The raw interrupt bit turns to high level when the last data pointed by one inlink
 *  descriptor has been transmitted to peripherals for Rx channel 1.
 */
#define H264_DMA_IN_DONE_CH4_INT_RAW    (BIT(0))
#define H264_DMA_IN_DONE_CH4_INT_RAW_M  (H264_DMA_IN_DONE_CH4_INT_RAW_V << H264_DMA_IN_DONE_CH4_INT_RAW_S)
#define H264_DMA_IN_DONE_CH4_INT_RAW_V  0x00000001U
#define H264_DMA_IN_DONE_CH4_INT_RAW_S  0
/** H264_DMA_IN_SUC_EOF_CH4_INT_RAW : R/WTC/SS; bitpos: [1]; default: 0;
 *  The raw interrupt bit turns to high level when the last data pointed by one inlink
 *  descriptor has been received and no data error is detected for Rx channel 1.
 */
#define H264_DMA_IN_SUC_EOF_CH4_INT_RAW    (BIT(1))
#define H264_DMA_IN_SUC_EOF_CH4_INT_RAW_M  (H264_DMA_IN_SUC_EOF_CH4_INT_RAW_V << H264_DMA_IN_SUC_EOF_CH4_INT_RAW_S)
#define H264_DMA_IN_SUC_EOF_CH4_INT_RAW_V  0x00000001U
#define H264_DMA_IN_SUC_EOF_CH4_INT_RAW_S  1
/** H264_DMA_IN_ERR_EOF_CH4_INT_RAW : R/WTC/SS; bitpos: [2]; default: 0;
 *  The raw interrupt bit turns to high level when the last data pointed by one inlink
 *  descriptor has been received and data error is detected
 */
#define H264_DMA_IN_ERR_EOF_CH4_INT_RAW    (BIT(2))
#define H264_DMA_IN_ERR_EOF_CH4_INT_RAW_M  (H264_DMA_IN_ERR_EOF_CH4_INT_RAW_V << H264_DMA_IN_ERR_EOF_CH4_INT_RAW_S)
#define H264_DMA_IN_ERR_EOF_CH4_INT_RAW_V  0x00000001U
#define H264_DMA_IN_ERR_EOF_CH4_INT_RAW_S  2
/** H264_DMA_IN_DSCR_ERR_CH4_INT_RAW : R/WTC/SS; bitpos: [3]; default: 0;
 *  The raw interrupt bit turns to high level when detecting inlink descriptor error,
 *  including owner error, the second and third word error of inlink descriptor for Rx
 *  channel 1.
 */
#define H264_DMA_IN_DSCR_ERR_CH4_INT_RAW    (BIT(3))
#define H264_DMA_IN_DSCR_ERR_CH4_INT_RAW_M  (H264_DMA_IN_DSCR_ERR_CH4_INT_RAW_V << H264_DMA_IN_DSCR_ERR_CH4_INT_RAW_S)
#define H264_DMA_IN_DSCR_ERR_CH4_INT_RAW_V  0x00000001U
#define H264_DMA_IN_DSCR_ERR_CH4_INT_RAW_S  3
/** H264_DMA_INFIFO_OVF_L1_CH4_INT_RAW : R/WTC/SS; bitpos: [4]; default: 0;
 *  This raw interrupt bit turns to high level when fifo of Rx channel is overflow.
 */
#define H264_DMA_INFIFO_OVF_L1_CH4_INT_RAW    (BIT(4))
#define H264_DMA_INFIFO_OVF_L1_CH4_INT_RAW_M  (H264_DMA_INFIFO_OVF_L1_CH4_INT_RAW_V << H264_DMA_INFIFO_OVF_L1_CH4_INT_RAW_S)
#define H264_DMA_INFIFO_OVF_L1_CH4_INT_RAW_V  0x00000001U
#define H264_DMA_INFIFO_OVF_L1_CH4_INT_RAW_S  4
/** H264_DMA_INFIFO_UDF_L1_CH4_INT_RAW : R/WTC/SS; bitpos: [5]; default: 0;
 *  This raw interrupt bit turns to high level when fifo of Rx channel is underflow.
 */
#define H264_DMA_INFIFO_UDF_L1_CH4_INT_RAW    (BIT(5))
#define H264_DMA_INFIFO_UDF_L1_CH4_INT_RAW_M  (H264_DMA_INFIFO_UDF_L1_CH4_INT_RAW_V << H264_DMA_INFIFO_UDF_L1_CH4_INT_RAW_S)
#define H264_DMA_INFIFO_UDF_L1_CH4_INT_RAW_V  0x00000001U
#define H264_DMA_INFIFO_UDF_L1_CH4_INT_RAW_S  5
/** H264_DMA_INFIFO_OVF_L2_CH4_INT_RAW : R/WTC/SS; bitpos: [6]; default: 0;
 *  This raw interrupt bit turns to high level when fifo of Rx channel is overflow.
 */
#define H264_DMA_INFIFO_OVF_L2_CH4_INT_RAW    (BIT(6))
#define H264_DMA_INFIFO_OVF_L2_CH4_INT_RAW_M  (H264_DMA_INFIFO_OVF_L2_CH4_INT_RAW_V << H264_DMA_INFIFO_OVF_L2_CH4_INT_RAW_S)
#define H264_DMA_INFIFO_OVF_L2_CH4_INT_RAW_V  0x00000001U
#define H264_DMA_INFIFO_OVF_L2_CH4_INT_RAW_S  6
/** H264_DMA_INFIFO_UDF_L2_CH4_INT_RAW : R/WTC/SS; bitpos: [7]; default: 0;
 *  This raw interrupt bit turns to high level when fifo of Rx channel is underflow.
 */
#define H264_DMA_INFIFO_UDF_L2_CH4_INT_RAW    (BIT(7))
#define H264_DMA_INFIFO_UDF_L2_CH4_INT_RAW_M  (H264_DMA_INFIFO_UDF_L2_CH4_INT_RAW_V << H264_DMA_INFIFO_UDF_L2_CH4_INT_RAW_S)
#define H264_DMA_INFIFO_UDF_L2_CH4_INT_RAW_V  0x00000001U
#define H264_DMA_INFIFO_UDF_L2_CH4_INT_RAW_S  7
/** H264_DMA_IN_DSCR_EMPTY_CH4_INT_RAW : R/WTC/SS; bitpos: [8]; default: 0;
 *  The raw interrupt bit turns to high level when the last descriptor is done but fifo
 *  also remain data.
 */
#define H264_DMA_IN_DSCR_EMPTY_CH4_INT_RAW    (BIT(8))
#define H264_DMA_IN_DSCR_EMPTY_CH4_INT_RAW_M  (H264_DMA_IN_DSCR_EMPTY_CH4_INT_RAW_V << H264_DMA_IN_DSCR_EMPTY_CH4_INT_RAW_S)
#define H264_DMA_IN_DSCR_EMPTY_CH4_INT_RAW_V  0x00000001U
#define H264_DMA_IN_DSCR_EMPTY_CH4_INT_RAW_S  8
/** H264_DMA_IN_DSCR_TASK_OVF_CH4_INT_RAW : R/WTC/SS; bitpos: [9]; default: 0;
 *  The raw interrupt bit turns to high level when dscr ready task fifo is overflow.
 */
#define H264_DMA_IN_DSCR_TASK_OVF_CH4_INT_RAW    (BIT(9))
#define H264_DMA_IN_DSCR_TASK_OVF_CH4_INT_RAW_M  (H264_DMA_IN_DSCR_TASK_OVF_CH4_INT_RAW_V << H264_DMA_IN_DSCR_TASK_OVF_CH4_INT_RAW_S)
#define H264_DMA_IN_DSCR_TASK_OVF_CH4_INT_RAW_V  0x00000001U
#define H264_DMA_IN_DSCR_TASK_OVF_CH4_INT_RAW_S  9

