espressif/esp-idf/components/soc/esp32p4/register/hw_ver1/soc/h264_dma_reg.h
/** H264_DMA_INFIFO_STATUS_CH4_REG register
 *  RX CH4 INFIFO status register
 */
#define H264_DMA_INFIFO_STATUS_CH4_REG (DR_REG_H264_DMA_BASE + 0x914)
/** H264_DMA_INFIFO_FULL_L2_CH4 : RO; bitpos: [0]; default: 0;
 *  Rx FIFO full signal for Rx channel.
 */
#define H264_DMA_INFIFO_FULL_L2_CH4    (BIT(0))
#define H264_DMA_INFIFO_FULL_L2_CH4_M  (H264_DMA_INFIFO_FULL_L2_CH4_V << H264_DMA_INFIFO_FULL_L2_CH4_S)
#define H264_DMA_INFIFO_FULL_L2_CH4_V  0x00000001U
#define H264_DMA_INFIFO_FULL_L2_CH4_S  0
/** H264_DMA_INFIFO_EMPTY_L2_CH4 : RO; bitpos: [1]; default: 1;
 *  Rx FIFO empty signal for Rx channel.
 */
#define H264_DMA_INFIFO_EMPTY_L2_CH4    (BIT(1))
#define H264_DMA_INFIFO_EMPTY_L2_CH4_M  (H264_DMA_INFIFO_EMPTY_L2_CH4_V << H264_DMA_INFIFO_EMPTY_L2_CH4_S)
#define H264_DMA_INFIFO_EMPTY_L2_CH4_V  0x00000001U
#define H264_DMA_INFIFO_EMPTY_L2_CH4_S  1
/** H264_DMA_INFIFO_CNT_L2_CH4 : RO; bitpos: [5:2]; default: 0;
 *  The register stores the byte number of the data in Rx FIFO for Rx channel.
 */
#define H264_DMA_INFIFO_CNT_L2_CH4    0x0000000FU
#define H264_DMA_INFIFO_CNT_L2_CH4_M  (H264_DMA_INFIFO_CNT_L2_CH4_V << H264_DMA_INFIFO_CNT_L2_CH4_S)
#define H264_DMA_INFIFO_CNT_L2_CH4_V  0x0000000FU
#define H264_DMA_INFIFO_CNT_L2_CH4_S  2
/** H264_DMA_INFIFO_FULL_L1_CH4 : RO; bitpos: [6]; default: 0;
 *  Tx FIFO full signal for Tx channel 1.
 */
#define H264_DMA_INFIFO_FULL_L1_CH4    (BIT(6))
#define H264_DMA_INFIFO_FULL_L1_CH4_M  (H264_DMA_INFIFO_FULL_L1_CH4_V << H264_DMA_INFIFO_FULL_L1_CH4_S)
#define H264_DMA_INFIFO_FULL_L1_CH4_V  0x00000001U
#define H264_DMA_INFIFO_FULL_L1_CH4_S  6
/** H264_DMA_INFIFO_EMPTY_L1_CH4 : RO; bitpos: [7]; default: 1;
 *  Tx FIFO empty signal for Tx channel 1.
 */
#define H264_DMA_INFIFO_EMPTY_L1_CH4    (BIT(7))
#define H264_DMA_INFIFO_EMPTY_L1_CH4_M  (H264_DMA_INFIFO_EMPTY_L1_CH4_V << H264_DMA_INFIFO_EMPTY_L1_CH4_S)
#define H264_DMA_INFIFO_EMPTY_L1_CH4_V  0x00000001U
#define H264_DMA_INFIFO_EMPTY_L1_CH4_S  7
/** H264_DMA_INFIFO_CNT_L1_CH4 : RO; bitpos: [12:8]; default: 0;
 *  The register stores the byte number of the data in Tx FIFO for Tx channel 1.
 */
#define H264_DMA_INFIFO_CNT_L1_CH4    0x0000001FU
#define H264_DMA_INFIFO_CNT_L1_CH4_M  (H264_DMA_INFIFO_CNT_L1_CH4_V << H264_DMA_INFIFO_CNT_L1_CH4_S)
#define H264_DMA_INFIFO_CNT_L1_CH4_V  0x0000001FU
#define H264_DMA_INFIFO_CNT_L1_CH4_S  8
/** H264_DMA_INFIFO_FULL_L3_CH4 : RO; bitpos: [16]; default: 0;
 *  Tx FIFO full signal for Tx channel 1.
 */
#define H264_DMA_INFIFO_FULL_L3_CH4    (BIT(16))
#define H264_DMA_INFIFO_FULL_L3_CH4_M  (H264_DMA_INFIFO_FULL_L3_CH4_V << H264_DMA_INFIFO_FULL_L3_CH4_S)
#define H264_DMA_INFIFO_FULL_L3_CH4_V  0x00000001U
#define H264_DMA_INFIFO_FULL_L3_CH4_S  16
/** H264_DMA_INFIFO_EMPTY_L3_CH4 : RO; bitpos: [17]; default: 1;
 *  Tx FIFO empty signal for Tx channel 1.
 */
#define H264_DMA_INFIFO_EMPTY_L3_CH4    (BIT(17))
#define H264_DMA_INFIFO_EMPTY_L3_CH4_M  (H264_DMA_INFIFO_EMPTY_L3_CH4_V << H264_DMA_INFIFO_EMPTY_L3_CH4_S)
#define H264_DMA_INFIFO_EMPTY_L3_CH4_V  0x00000001U
#define H264_DMA_INFIFO_EMPTY_L3_CH4_S  17
/** H264_DMA_INFIFO_CNT_L3_CH4 : RO; bitpos: [19:18]; default: 0;
 *  The register stores the byte number of the data in Tx FIFO for Tx channel 1.
 */
#define H264_DMA_INFIFO_CNT_L3_CH4    0x00000003U
#define H264_DMA_INFIFO_CNT_L3_CH4_M  (H264_DMA_INFIFO_CNT_L3_CH4_V << H264_DMA_INFIFO_CNT_L3_CH4_S)
#define H264_DMA_INFIFO_CNT_L3_CH4_V  0x00000003U
#define H264_DMA_INFIFO_CNT_L3_CH4_S  18

/** H264_DMA_IN_POP_CH4_REG register
 *  RX CH4 INFIFO pop register
 */
#define H264_DMA_IN_POP_CH4_REG (DR_REG_H264_DMA_BASE + 0x918)
/** H264_DMA_INFIFO_RDATA_CH4 : RO; bitpos: [10:0]; default: 1024;
 *  This register stores the data popping from DMA Rx FIFO.
 */
#define H264_DMA_INFIFO_RDATA_CH4    0x000007FFU
#define H264_DMA_INFIFO_RDATA_CH4_M  (H264_DMA_INFIFO_RDATA_CH4_V << H264_DMA_INFIFO_RDATA_CH4_S)
#define H264_DMA_INFIFO_RDATA_CH4_V  0x000007FFU
#define H264_DMA_INFIFO_RDATA_CH4_S  0
/** H264_DMA_INFIFO_POP_CH4 : R/W/SC; bitpos: [11]; default: 0;
 *  Set this bit to pop data from DMA Rx FIFO.
 */
#define H264_DMA_INFIFO_POP_CH4    (BIT(11))
#define H264_DMA_INFIFO_POP_CH4_M  (H264_DMA_INFIFO_POP_CH4_V << H264_DMA_INFIFO_POP_CH4_S)
#define H264_DMA_INFIFO_POP_CH4_V  0x00000001U
#define H264_DMA_INFIFO_POP_CH4_S  11

/** H264_DMA_IN_LINK_CONF_CH4_REG register
 *  RX CH4 in_link dscr ctrl register
 */
#define H264_DMA_IN_LINK_CONF_CH4_REG (DR_REG_H264_DMA_BASE + 0x91c)
/** H264_DMA_INLINK_AUTO_RET_CH4 : R/W; bitpos: [20]; default: 1;
 *  Set this bit to return to current inlink descriptor's address, when there are some
 *  errors in current receiving data.
 */
#define H264_DMA_INLINK_AUTO_RET_CH4    (BIT(20))
#define H264_DMA_INLINK_AUTO_RET_CH4_M  (H264_DMA_INLINK_AUTO_RET_CH4_V << H264_DMA_INLINK_AUTO_RET_CH4_S)
#define H264_DMA_INLINK_AUTO_RET_CH4_V  0x00000001U
#define H264_DMA_INLINK_AUTO_RET_CH4_S  20
/** H264_DMA_INLINK_STOP_CH4 : R/W/SC; bitpos: [21]; default: 0;
 *  Set this bit to stop dealing with the inlink descriptors.
 */
#define H264_DMA_INLINK_STOP_CH4    (BIT(21))
#define H264_DMA_INLINK_STOP_CH4_M  (H264_DMA_INLINK_STOP_CH4_V << H264_DMA_INLINK_STOP_CH4_S)
#define H264_DMA_INLINK_STOP_CH4_V  0x00000001U
#define H264_DMA_INLINK_STOP_CH4_S  21
/** H264_DMA_INLINK_START_CH4 : R/W/SC; bitpos: [22]; default: 0;
 *  Set this bit to start dealing with the inlink descriptors.
 */
#define H264_DMA_INLINK_START_CH4    (BIT(22))
#define H264_DMA_INLINK_START_CH4_M  (H264_DMA_INLINK_START_CH4_V << H264_DMA_INLINK_START_CH4_S)
#define H264_DMA_INLINK_START_CH4_V  0x00000001U
#define H264_DMA_INLINK_START_CH4_S  22
/** H264_DMA_INLINK_RESTART_CH4 : R/W/SC; bitpos: [23]; default: 0;
 *  Set this bit to mount a new inlink descriptor.
 */
#define H264_DMA_INLINK_RESTART_CH4    (BIT(23))
#define H264_DMA_INLINK_RESTART_CH4_M  (H264_DMA_INLINK_RESTART_CH4_V << H264_DMA_INLINK_RESTART_CH4_S)
#define H264_DMA_INLINK_RESTART_CH4_V  0x00000001U
#define H264_DMA_INLINK_RESTART_CH4_S  23
/** H264_DMA_INLINK_PARK_CH4 : RO; bitpos: [24]; default: 1;
 *  1: the inlink descriptor's FSM is in idle state.  0: the inlink descriptor's FSM is
 *  working.
 */
#define H264_DMA_INLINK_PARK_CH4    (BIT(24))
#define H264_DMA_INLINK_PARK_CH4_M  (H264_DMA_INLINK_PARK_CH4_V << H264_DMA_INLINK_PARK_CH4_S)
#define H264_DMA_INLINK_PARK_CH4_V  0x00000001U
#define H264_DMA_INLINK_PARK_CH4_S  24

/** H264_DMA_IN_LINK_ADDR_CH4_REG register
 *  RX CH4 in_link dscr addr register
 */
#define H264_DMA_IN_LINK_ADDR_CH4_REG (DR_REG_H264_DMA_BASE + 0x920)
/** H264_DMA_INLINK_ADDR_CH4 : R/W; bitpos: [31:0]; default: 0;
 *  This register stores the first inlink descriptor's address.
 */
#define H264_DMA_INLINK_ADDR_CH4    0xFFFFFFFFU
#define H264_DMA_INLINK_ADDR_CH4_M  (H264_DMA_INLINK_ADDR_CH4_V << H264_DMA_INLINK_ADDR_CH4_S)
#define H264_DMA_INLINK_ADDR_CH4_V  0xFFFFFFFFU
#define H264_DMA_INLINK_ADDR_CH4_S  0

/** H264_DMA_IN_STATE_CH4_REG register
 *  RX CH4 state register
 */
#define H264_DMA_IN_STATE_CH4_REG (DR_REG_H264_DMA_BASE + 0x924)
/** H264_DMA_INLINK_DSCR_ADDR_CH4 : RO; bitpos: [17:0]; default: 0;
 *  This register stores the current inlink descriptor's address.
 */
#define H264_DMA_INLINK_DSCR_ADDR_CH4    0x0003FFFFU
#define H264_DMA_INLINK_DSCR_ADDR_CH4_M  (H264_DMA_INLINK_DSCR_ADDR_CH4_V << H264_DMA_INLINK_DSCR_ADDR_CH4_S)
#define H264_DMA_INLINK_DSCR_ADDR_CH4_V  0x0003FFFFU
#define H264_DMA_INLINK_DSCR_ADDR_CH4_S  0
/** H264_DMA_IN_DSCR_STATE_CH4 : RO; bitpos: [19:18]; default: 0;
 *  This register stores the current descriptor state machine state.
 */
#define H264_DMA_IN_DSCR_STATE_CH4    0x00000003U
#define H264_DMA_IN_DSCR_STATE_CH4_M  (H264_DMA_IN_DSCR_STATE_CH4_V << H264_DMA_IN_DSCR_STATE_CH4_S)
#define H264_DMA_IN_DSCR_STATE_CH4_V  0x00000003U
#define H264_DMA_IN_DSCR_STATE_CH4_S  18
/** H264_DMA_IN_STATE_CH4 : RO; bitpos: [22:20]; default: 0;
 *  This register stores the current control module state machine state.
 */
#define H264_DMA_IN_STATE_CH4    0x00000007U
#define H264_DMA_IN_STATE_CH4_M  (H264_DMA_IN_STATE_CH4_V << H264_DMA_IN_STATE_CH4_S)
#define H264_DMA_IN_STATE_CH4_V  0x00000007U
#define H264_DMA_IN_STATE_CH4_S  20
/** H264_DMA_IN_RESET_AVAIL_CH4 : RO; bitpos: [23]; default: 1;
 *  This register indicate that if the channel reset is safety.
 */
#define H264_DMA_IN_RESET_AVAIL_CH4    (BIT(23))
#define H264_DMA_IN_RESET_AVAIL_CH4_M  (H264_DMA_IN_RESET_AVAIL_CH4_V << H264_DMA_IN_RESET_AVAIL_CH4_S)
#define H264_DMA_IN_RESET_AVAIL_CH4_V  0x00000001U
#define H264_DMA_IN_RESET_AVAIL_CH4_S  23

/** H264_DMA_IN_SUC_EOF_DES_ADDR_CH4_REG register
 *  RX CH4 eof des addr register
 */
#define H264_DMA_IN_SUC_EOF_DES_ADDR_CH4_REG (DR_REG_H264_DMA_BASE + 0x928)
/** H264_DMA_IN_SUC_EOF_DES_ADDR_CH4 : RO; bitpos: [31:0]; default: 0;
 *  This register stores the address of the inlink descriptor when the EOF bit in this
 *  descriptor is 1.
 */
#define H264_DMA_IN_SUC_EOF_DES_ADDR_CH4    0xFFFFFFFFU
#define H264_DMA_IN_SUC_EOF_DES_ADDR_CH4_M  (H264_DMA_IN_SUC_EOF_DES_ADDR_CH4_V << H264_DMA_IN_SUC_EOF_DES_ADDR_CH4_S)
#define H264_DMA_IN_SUC_EOF_DES_ADDR_CH4_V  0xFFFFFFFFU
#define H264_DMA_IN_SUC_EOF_DES_ADDR_CH4_S  0

/** H264_DMA_IN_ERR_EOF_DES_ADDR_CH4_REG register
 *  RX CH4 err eof des addr register
 */
#define H264_DMA_IN_ERR_EOF_DES_ADDR_CH4_REG (DR_REG_H264_DMA_BASE + 0x92c)
/** H264_DMA_IN_ERR_EOF_DES_ADDR_CH4 : RO; bitpos: [31:0]; default: 0;
 *  This register stores the address of the inlink descriptor when there are some
 *  errors in current receiving data.
 */
#define H264_DMA_IN_ERR_EOF_DES_ADDR_CH4    0xFFFFFFFFU
#define H264_DMA_IN_ERR_EOF_DES_ADDR_CH4_M  (H264_DMA_IN_ERR_EOF_DES_ADDR_CH4_V << H264_DMA_IN_ERR_EOF_DES_ADDR_CH4_S)
#define H264_DMA_IN_ERR_EOF_DES_ADDR_CH4_V  0xFFFFFFFFU
#define H264_DMA_IN_ERR_EOF_DES_ADDR_CH4_S  0

/** H264_DMA_IN_DSCR_CH4_REG register
 *  RX CH4 next dscr addr register
 */
#define H264_DMA_IN_DSCR_CH4_REG (DR_REG_H264_DMA_BASE + 0x930)
/** H264_DMA_INLINK_DSCR_CH4 : RO; bitpos: [31:0]; default: 0;
 *  The address of the next inlink descriptor address x.
 */
#define H264_DMA_INLINK_DSCR_CH4    0xFFFFFFFFU
#define H264_DMA_INLINK_DSCR_CH4_M  (H264_DMA_INLINK_DSCR_CH4_V << H264_DMA_INLINK_DSCR_CH4_S)
#define H264_DMA_INLINK_DSCR_CH4_V  0xFFFFFFFFU
#define H264_DMA_INLINK_DSCR_CH4_S  0

/** H264_DMA_IN_DSCR_BF0_CH4_REG register
 *  RX CH4 last dscr addr register
 */
#define H264_DMA_IN_DSCR_BF0_CH4_REG (DR_REG_H264_DMA_BASE + 0x934)
/** H264_DMA_INLINK_DSCR_BF0_CH4 : RO; bitpos: [31:0]; default: 0;
 *  The address of the last inlink descriptor's next address x-1.
 */
#define H264_DMA_INLINK_DSCR_BF0_CH4    0xFFFFFFFFU
#define H264_DMA_INLINK_DSCR_BF0_CH4_M  (H264_DMA_INLINK_DSCR_BF0_CH4_V << H264_DMA_INLINK_DSCR_BF0_CH4_S)
#define H264_DMA_INLINK_DSCR_BF0_CH4_V  0xFFFFFFFFU
#define H264_DMA_INLINK_DSCR_BF0_CH4_S  0

