espressif/esp-idf/components/soc/esp32p4/register/hw_ver1/soc/h264_dma_reg.h
/** H264_DMA_IN_DSCR_BF1_CH4_REG register
 *  RX CH4 second-to-last dscr addr register
 */
#define H264_DMA_IN_DSCR_BF1_CH4_REG (DR_REG_H264_DMA_BASE + 0x938)
/** H264_DMA_INLINK_DSCR_BF1_CH4 : RO; bitpos: [31:0]; default: 0;
 *  The address of the second-to-last inlink descriptor's next address x-2.
 */
#define H264_DMA_INLINK_DSCR_BF1_CH4    0xFFFFFFFFU
#define H264_DMA_INLINK_DSCR_BF1_CH4_M  (H264_DMA_INLINK_DSCR_BF1_CH4_V << H264_DMA_INLINK_DSCR_BF1_CH4_S)
#define H264_DMA_INLINK_DSCR_BF1_CH4_V  0xFFFFFFFFU
#define H264_DMA_INLINK_DSCR_BF1_CH4_S  0

/** H264_DMA_IN_ARB_CH4_REG register
 *  RX CH4 arb register
 */
#define H264_DMA_IN_ARB_CH4_REG (DR_REG_H264_DMA_BASE + 0x940)
/** H264_DMA_IN_ARB_TOKEN_NUM_CH4 : R/W; bitpos: [3:0]; default: 1;
 *  Set the max number of token count of arbiter
 */
#define H264_DMA_IN_ARB_TOKEN_NUM_CH4    0x0000000FU
#define H264_DMA_IN_ARB_TOKEN_NUM_CH4_M  (H264_DMA_IN_ARB_TOKEN_NUM_CH4_V << H264_DMA_IN_ARB_TOKEN_NUM_CH4_S)
#define H264_DMA_IN_ARB_TOKEN_NUM_CH4_V  0x0000000FU
#define H264_DMA_IN_ARB_TOKEN_NUM_CH4_S  0
/** H264_DMA_EXTER_IN_ARB_PRIORITY_CH4 : R/W; bitpos: [5:4]; default: 1;
 *  Set the priority of channel
 */
#define H264_DMA_EXTER_IN_ARB_PRIORITY_CH4    0x00000003U
#define H264_DMA_EXTER_IN_ARB_PRIORITY_CH4_M  (H264_DMA_EXTER_IN_ARB_PRIORITY_CH4_V << H264_DMA_EXTER_IN_ARB_PRIORITY_CH4_S)
#define H264_DMA_EXTER_IN_ARB_PRIORITY_CH4_V  0x00000003U
#define H264_DMA_EXTER_IN_ARB_PRIORITY_CH4_S  4
/** H264_DMA_INTER_IN_ARB_PRIORITY_CH4 : R/W; bitpos: [8:6]; default: 1;
 *  Set the priority of channel
 */
#define H264_DMA_INTER_IN_ARB_PRIORITY_CH4    0x00000007U
#define H264_DMA_INTER_IN_ARB_PRIORITY_CH4_M  (H264_DMA_INTER_IN_ARB_PRIORITY_CH4_V << H264_DMA_INTER_IN_ARB_PRIORITY_CH4_S)
#define H264_DMA_INTER_IN_ARB_PRIORITY_CH4_V  0x00000007U
#define H264_DMA_INTER_IN_ARB_PRIORITY_CH4_S  6

/** H264_DMA_IN_ETM_CONF_CH4_REG register
 *  RX CH4 ETM config register
 */
#define H264_DMA_IN_ETM_CONF_CH4_REG (DR_REG_H264_DMA_BASE + 0x948)
/** H264_DMA_IN_ETM_EN_CH4 : R/W; bitpos: [0]; default: 0;
 *  Set this bit to 1 to enable ETM task function
 */
#define H264_DMA_IN_ETM_EN_CH4    (BIT(0))
#define H264_DMA_IN_ETM_EN_CH4_M  (H264_DMA_IN_ETM_EN_CH4_V << H264_DMA_IN_ETM_EN_CH4_S)
#define H264_DMA_IN_ETM_EN_CH4_V  0x00000001U
#define H264_DMA_IN_ETM_EN_CH4_S  0
/** H264_DMA_IN_ETM_LOOP_EN_CH4 : R/W; bitpos: [1]; default: 0;
 *  when this bit is 1, dscr can be processed after receiving a task
 */
#define H264_DMA_IN_ETM_LOOP_EN_CH4    (BIT(1))
#define H264_DMA_IN_ETM_LOOP_EN_CH4_M  (H264_DMA_IN_ETM_LOOP_EN_CH4_V << H264_DMA_IN_ETM_LOOP_EN_CH4_S)
#define H264_DMA_IN_ETM_LOOP_EN_CH4_V  0x00000001U
#define H264_DMA_IN_ETM_LOOP_EN_CH4_S  1
/** H264_DMA_IN_DSCR_TASK_MAK_CH4 : R/W; bitpos: [3:2]; default: 1;
 *  ETM dscr_ready maximum cache numbers
 */
#define H264_DMA_IN_DSCR_TASK_MAK_CH4    0x00000003U
#define H264_DMA_IN_DSCR_TASK_MAK_CH4_M  (H264_DMA_IN_DSCR_TASK_MAK_CH4_V << H264_DMA_IN_DSCR_TASK_MAK_CH4_S)
#define H264_DMA_IN_DSCR_TASK_MAK_CH4_V  0x00000003U
#define H264_DMA_IN_DSCR_TASK_MAK_CH4_S  2

/** H264_DMA_IN_FIFO_CNT_CH4_REG register
 *  rx CH4 fifo cnt register
 */
#define H264_DMA_IN_FIFO_CNT_CH4_REG (DR_REG_H264_DMA_BASE + 0x980)
/** H264_DMA_IN_CMDFIFO_INFIFO_CNT_CH4 : RO; bitpos: [9:0]; default: 0;
 *  only for debug
 */
#define H264_DMA_IN_CMDFIFO_INFIFO_CNT_CH4    0x000003FFU
#define H264_DMA_IN_CMDFIFO_INFIFO_CNT_CH4_M  (H264_DMA_IN_CMDFIFO_INFIFO_CNT_CH4_V << H264_DMA_IN_CMDFIFO_INFIFO_CNT_CH4_S)
#define H264_DMA_IN_CMDFIFO_INFIFO_CNT_CH4_V  0x000003FFU
#define H264_DMA_IN_CMDFIFO_INFIFO_CNT_CH4_S  0

/** H264_DMA_IN_POP_DATA_CNT_CH4_REG register
 *  rx CH4 pop data cnt register
 */
#define H264_DMA_IN_POP_DATA_CNT_CH4_REG (DR_REG_H264_DMA_BASE + 0x984)
/** H264_DMA_IN_CMDFIFO_POP_DATA_CNT_CH4 : RO; bitpos: [7:0]; default: 7;
 *  only for debug
 */
#define H264_DMA_IN_CMDFIFO_POP_DATA_CNT_CH4    0x000000FFU
#define H264_DMA_IN_CMDFIFO_POP_DATA_CNT_CH4_M  (H264_DMA_IN_CMDFIFO_POP_DATA_CNT_CH4_V << H264_DMA_IN_CMDFIFO_POP_DATA_CNT_CH4_S)
#define H264_DMA_IN_CMDFIFO_POP_DATA_CNT_CH4_V  0x000000FFU
#define H264_DMA_IN_CMDFIFO_POP_DATA_CNT_CH4_S  0

/** H264_DMA_IN_XADDR_CH4_REG register
 *  rx CH4 xaddr register
 */
#define H264_DMA_IN_XADDR_CH4_REG (DR_REG_H264_DMA_BASE + 0x988)
/** H264_DMA_IN_CMDFIFO_XADDR_CH4 : RO; bitpos: [31:0]; default: 0;
 *  only for debug
 */
#define H264_DMA_IN_CMDFIFO_XADDR_CH4    0xFFFFFFFFU
#define H264_DMA_IN_CMDFIFO_XADDR_CH4_M  (H264_DMA_IN_CMDFIFO_XADDR_CH4_V << H264_DMA_IN_CMDFIFO_XADDR_CH4_S)
#define H264_DMA_IN_CMDFIFO_XADDR_CH4_V  0xFFFFFFFFU
#define H264_DMA_IN_CMDFIFO_XADDR_CH4_S  0

/** H264_DMA_IN_BUF_HB_RCV_CH4_REG register
 *  rx CH4 buf len hb rcv register
 */
#define H264_DMA_IN_BUF_HB_RCV_CH4_REG (DR_REG_H264_DMA_BASE + 0x98c)
/** H264_DMA_IN_CMDFIFO_BUF_HB_RCV_CH4 : RO; bitpos: [28:0]; default: 0;
 *  only for debug
 */
#define H264_DMA_IN_CMDFIFO_BUF_HB_RCV_CH4    0x1FFFFFFFU
#define H264_DMA_IN_CMDFIFO_BUF_HB_RCV_CH4_M  (H264_DMA_IN_CMDFIFO_BUF_HB_RCV_CH4_V << H264_DMA_IN_CMDFIFO_BUF_HB_RCV_CH4_S)
#define H264_DMA_IN_CMDFIFO_BUF_HB_RCV_CH4_V  0x1FFFFFFFU
#define H264_DMA_IN_CMDFIFO_BUF_HB_RCV_CH4_S  0

/** H264_DMA_IN_CONF0_CH5_REG register
 *  RX CH5 config0 register
 */
#define H264_DMA_IN_CONF0_CH5_REG (DR_REG_H264_DMA_BASE + 0xa00)
/** H264_DMA_IN_ECC_AES_EN_CH5 : R/W; bitpos: [3]; default: 0;
 *  When access address space is ecc/aes area, this bit should be set to 1. In this
 *  case, the start address of square should be 16-bit aligned. The width of square
 *  multiply byte number of one pixel should be 16-bit aligned.
 */
#define H264_DMA_IN_ECC_AES_EN_CH5    (BIT(3))
#define H264_DMA_IN_ECC_AES_EN_CH5_M  (H264_DMA_IN_ECC_AES_EN_CH5_V << H264_DMA_IN_ECC_AES_EN_CH5_S)
#define H264_DMA_IN_ECC_AES_EN_CH5_V  0x00000001U
#define H264_DMA_IN_ECC_AES_EN_CH5_S  3
/** H264_DMA_IN_MEM_BURST_LENGTH_CH5 : R/W; bitpos: [8:6]; default: 0;
 *  Block size of Rx channel 1. 0: single      1: 16 bytes      2: 32 bytes    3: 64
 *  bytes    4: 128 bytes
 */
#define H264_DMA_IN_MEM_BURST_LENGTH_CH5    0x00000007U
#define H264_DMA_IN_MEM_BURST_LENGTH_CH5_M  (H264_DMA_IN_MEM_BURST_LENGTH_CH5_V << H264_DMA_IN_MEM_BURST_LENGTH_CH5_S)
#define H264_DMA_IN_MEM_BURST_LENGTH_CH5_V  0x00000007U
#define H264_DMA_IN_MEM_BURST_LENGTH_CH5_S  6
/** H264_DMA_IN_PAGE_BOUND_EN_CH5 : R/W; bitpos: [12]; default: 0;
 *  Set this bit to 1 to make sure AXI write data don't cross the address boundary
 *  which define by mem_burst_length
 */
#define H264_DMA_IN_PAGE_BOUND_EN_CH5    (BIT(12))
#define H264_DMA_IN_PAGE_BOUND_EN_CH5_M  (H264_DMA_IN_PAGE_BOUND_EN_CH5_V << H264_DMA_IN_PAGE_BOUND_EN_CH5_S)
#define H264_DMA_IN_PAGE_BOUND_EN_CH5_V  0x00000001U
#define H264_DMA_IN_PAGE_BOUND_EN_CH5_S  12
/** H264_DMA_IN_RST_CH5 : R/W; bitpos: [24]; default: 0;
 *  Write 1 then write 0 to this bit to reset Rx channel
 */
#define H264_DMA_IN_RST_CH5    (BIT(24))
#define H264_DMA_IN_RST_CH5_M  (H264_DMA_IN_RST_CH5_V << H264_DMA_IN_RST_CH5_S)
#define H264_DMA_IN_RST_CH5_V  0x00000001U
#define H264_DMA_IN_RST_CH5_S  24
/** H264_DMA_IN_CMD_DISABLE_CH5 : R/W; bitpos: [25]; default: 0;
 *  Write 1 before reset and write 0 after reset
 */
#define H264_DMA_IN_CMD_DISABLE_CH5    (BIT(25))
#define H264_DMA_IN_CMD_DISABLE_CH5_M  (H264_DMA_IN_CMD_DISABLE_CH5_V << H264_DMA_IN_CMD_DISABLE_CH5_S)
#define H264_DMA_IN_CMD_DISABLE_CH5_V  0x00000001U
#define H264_DMA_IN_CMD_DISABLE_CH5_S  25

