espressif/esp-idf/components/soc/esp32p4/register/hw_ver1/soc/h264_dma_reg.h
/** H264_DMA_IN_CONF1_CH5_REG register
 *  RX CH5 config1 register
 */
#define H264_DMA_IN_CONF1_CH5_REG (DR_REG_H264_DMA_BASE + 0xa04)
/** H264_DMA_BLOCK_START_ADDR_CH5 : R/W; bitpos: [31:0]; default: 0;
 *  RX Channel 5 destination start address
 */
#define H264_DMA_BLOCK_START_ADDR_CH5    0xFFFFFFFFU
#define H264_DMA_BLOCK_START_ADDR_CH5_M  (H264_DMA_BLOCK_START_ADDR_CH5_V << H264_DMA_BLOCK_START_ADDR_CH5_S)
#define H264_DMA_BLOCK_START_ADDR_CH5_V  0xFFFFFFFFU
#define H264_DMA_BLOCK_START_ADDR_CH5_S  0

/** H264_DMA_IN_CONF2_CH5_REG register
 *  RX CH5 config2 register
 */
#define H264_DMA_IN_CONF2_CH5_REG (DR_REG_H264_DMA_BASE + 0xa08)
/** H264_DMA_BLOCK_ROW_LENGTH_12LINE_CH5 : R/W; bitpos: [15:0]; default: 30720;
 *  The number of bytes contained in a row block 12line in RX channel 5
 */
#define H264_DMA_BLOCK_ROW_LENGTH_12LINE_CH5    0x0000FFFFU
#define H264_DMA_BLOCK_ROW_LENGTH_12LINE_CH5_M  (H264_DMA_BLOCK_ROW_LENGTH_12LINE_CH5_V << H264_DMA_BLOCK_ROW_LENGTH_12LINE_CH5_S)
#define H264_DMA_BLOCK_ROW_LENGTH_12LINE_CH5_V  0x0000FFFFU
#define H264_DMA_BLOCK_ROW_LENGTH_12LINE_CH5_S  0
/** H264_DMA_BLOCK_ROW_LENGTH_4LINE_CH5 : R/W; bitpos: [31:16]; default: 15360;
 *  The number of bytes contained in a row block 4line in RX channel 5
 */
#define H264_DMA_BLOCK_ROW_LENGTH_4LINE_CH5    0x0000FFFFU
#define H264_DMA_BLOCK_ROW_LENGTH_4LINE_CH5_M  (H264_DMA_BLOCK_ROW_LENGTH_4LINE_CH5_V << H264_DMA_BLOCK_ROW_LENGTH_4LINE_CH5_S)
#define H264_DMA_BLOCK_ROW_LENGTH_4LINE_CH5_V  0x0000FFFFU
#define H264_DMA_BLOCK_ROW_LENGTH_4LINE_CH5_S  16

/** H264_DMA_IN_CONF3_CH5_REG register
 *  RX CH5 config3 register
 */
#define H264_DMA_IN_CONF3_CH5_REG (DR_REG_H264_DMA_BASE + 0xa0c)
/** H264_DMA_BLOCK_LENGTH_12LINE_CH5 : R/W; bitpos: [13:0]; default: 256;
 *  The number of bytes contained in a block 12line
 */
#define H264_DMA_BLOCK_LENGTH_12LINE_CH5    0x00003FFFU
#define H264_DMA_BLOCK_LENGTH_12LINE_CH5_M  (H264_DMA_BLOCK_LENGTH_12LINE_CH5_V << H264_DMA_BLOCK_LENGTH_12LINE_CH5_S)
#define H264_DMA_BLOCK_LENGTH_12LINE_CH5_V  0x00003FFFU
#define H264_DMA_BLOCK_LENGTH_12LINE_CH5_S  0
/** H264_DMA_BLOCK_LENGTH_4LINE_CH5 : R/W; bitpos: [27:14]; default: 128;
 *  The number of bytes contained in a block 4line
 */
#define H264_DMA_BLOCK_LENGTH_4LINE_CH5    0x00003FFFU
#define H264_DMA_BLOCK_LENGTH_4LINE_CH5_M  (H264_DMA_BLOCK_LENGTH_4LINE_CH5_V << H264_DMA_BLOCK_LENGTH_4LINE_CH5_S)
#define H264_DMA_BLOCK_LENGTH_4LINE_CH5_V  0x00003FFFU
#define H264_DMA_BLOCK_LENGTH_4LINE_CH5_S  14

/** H264_DMA_IN_INT_RAW_CH5_REG register
 *  RX CH5  interrupt raw register
 */
#define H264_DMA_IN_INT_RAW_CH5_REG (DR_REG_H264_DMA_BASE + 0xa10)
/** H264_DMA_IN_DONE_CH5_INT_RAW : R/WTC/SS; bitpos: [0]; default: 0;
 *  The raw interrupt bit turns to high level when the last data pointed by one inlink
 *  descriptor has been transmitted to peripherals for Rx channel 1.
 */
#define H264_DMA_IN_DONE_CH5_INT_RAW    (BIT(0))
#define H264_DMA_IN_DONE_CH5_INT_RAW_M  (H264_DMA_IN_DONE_CH5_INT_RAW_V << H264_DMA_IN_DONE_CH5_INT_RAW_S)
#define H264_DMA_IN_DONE_CH5_INT_RAW_V  0x00000001U
#define H264_DMA_IN_DONE_CH5_INT_RAW_S  0
/** H264_DMA_IN_SUC_EOF_CH5_INT_RAW : R/WTC/SS; bitpos: [1]; default: 0;
 *  The raw interrupt bit turns to high level when the last data pointed by one inlink
 *  descriptor has been received and no data error is detected for Rx channel 1.
 */
#define H264_DMA_IN_SUC_EOF_CH5_INT_RAW    (BIT(1))
#define H264_DMA_IN_SUC_EOF_CH5_INT_RAW_M  (H264_DMA_IN_SUC_EOF_CH5_INT_RAW_V << H264_DMA_IN_SUC_EOF_CH5_INT_RAW_S)
#define H264_DMA_IN_SUC_EOF_CH5_INT_RAW_V  0x00000001U
#define H264_DMA_IN_SUC_EOF_CH5_INT_RAW_S  1
/** H264_DMA_INFIFO_OVF_L1_CH5_INT_RAW : R/WTC/SS; bitpos: [2]; default: 0;
 *  This raw interrupt bit turns to high level when fifo of Rx channel is overflow.
 */
#define H264_DMA_INFIFO_OVF_L1_CH5_INT_RAW    (BIT(2))
#define H264_DMA_INFIFO_OVF_L1_CH5_INT_RAW_M  (H264_DMA_INFIFO_OVF_L1_CH5_INT_RAW_V << H264_DMA_INFIFO_OVF_L1_CH5_INT_RAW_S)
#define H264_DMA_INFIFO_OVF_L1_CH5_INT_RAW_V  0x00000001U
#define H264_DMA_INFIFO_OVF_L1_CH5_INT_RAW_S  2
/** H264_DMA_INFIFO_UDF_L1_CH5_INT_RAW : R/WTC/SS; bitpos: [3]; default: 0;
 *  This raw interrupt bit turns to high level when fifo of Rx channel is underflow.
 */
#define H264_DMA_INFIFO_UDF_L1_CH5_INT_RAW    (BIT(3))
#define H264_DMA_INFIFO_UDF_L1_CH5_INT_RAW_M  (H264_DMA_INFIFO_UDF_L1_CH5_INT_RAW_V << H264_DMA_INFIFO_UDF_L1_CH5_INT_RAW_S)
#define H264_DMA_INFIFO_UDF_L1_CH5_INT_RAW_V  0x00000001U
#define H264_DMA_INFIFO_UDF_L1_CH5_INT_RAW_S  3
/** H264_DMA_FETCH_MB_COL_CNT_OVF_CH5_INT_RAW : R/WTC/SS; bitpos: [4]; default: 0;
 *  This raw interrupt bit turns to high level when fifo of Rx channel is underflow.
 */
#define H264_DMA_FETCH_MB_COL_CNT_OVF_CH5_INT_RAW    (BIT(4))
#define H264_DMA_FETCH_MB_COL_CNT_OVF_CH5_INT_RAW_M  (H264_DMA_FETCH_MB_COL_CNT_OVF_CH5_INT_RAW_V << H264_DMA_FETCH_MB_COL_CNT_OVF_CH5_INT_RAW_S)
#define H264_DMA_FETCH_MB_COL_CNT_OVF_CH5_INT_RAW_V  0x00000001U
#define H264_DMA_FETCH_MB_COL_CNT_OVF_CH5_INT_RAW_S  4

/** H264_DMA_IN_INT_ENA_CH5_REG register
 *  RX CH5  interrupt ena register
 */
#define H264_DMA_IN_INT_ENA_CH5_REG (DR_REG_H264_DMA_BASE + 0xa14)
/** H264_DMA_IN_DONE_CH5_INT_ENA : R/W; bitpos: [0]; default: 0;
 *  The interrupt enable bit for the IN_DONE_CH_INT interrupt.
 */
#define H264_DMA_IN_DONE_CH5_INT_ENA    (BIT(0))
#define H264_DMA_IN_DONE_CH5_INT_ENA_M  (H264_DMA_IN_DONE_CH5_INT_ENA_V << H264_DMA_IN_DONE_CH5_INT_ENA_S)
#define H264_DMA_IN_DONE_CH5_INT_ENA_V  0x00000001U
#define H264_DMA_IN_DONE_CH5_INT_ENA_S  0
/** H264_DMA_IN_SUC_EOF_CH5_INT_ENA : R/W; bitpos: [1]; default: 0;
 *  The interrupt enable bit for the IN_SUC_EOF_CH_INT interrupt.
 */
#define H264_DMA_IN_SUC_EOF_CH5_INT_ENA    (BIT(1))
#define H264_DMA_IN_SUC_EOF_CH5_INT_ENA_M  (H264_DMA_IN_SUC_EOF_CH5_INT_ENA_V << H264_DMA_IN_SUC_EOF_CH5_INT_ENA_S)
#define H264_DMA_IN_SUC_EOF_CH5_INT_ENA_V  0x00000001U
#define H264_DMA_IN_SUC_EOF_CH5_INT_ENA_S  1
/** H264_DMA_INFIFO_OVF_L1_CH5_INT_ENA : R/W; bitpos: [2]; default: 0;
 *  The interrupt enable bit for the INFIFO_OVF_L1_CH_INT interrupt.
 */
#define H264_DMA_INFIFO_OVF_L1_CH5_INT_ENA    (BIT(2))
#define H264_DMA_INFIFO_OVF_L1_CH5_INT_ENA_M  (H264_DMA_INFIFO_OVF_L1_CH5_INT_ENA_V << H264_DMA_INFIFO_OVF_L1_CH5_INT_ENA_S)
#define H264_DMA_INFIFO_OVF_L1_CH5_INT_ENA_V  0x00000001U
#define H264_DMA_INFIFO_OVF_L1_CH5_INT_ENA_S  2
/** H264_DMA_INFIFO_UDF_L1_CH5_INT_ENA : R/W; bitpos: [3]; default: 0;
 *  The interrupt enable bit for the INFIFO_UDF_L1_CH_INT interrupt.
 */
#define H264_DMA_INFIFO_UDF_L1_CH5_INT_ENA    (BIT(3))
#define H264_DMA_INFIFO_UDF_L1_CH5_INT_ENA_M  (H264_DMA_INFIFO_UDF_L1_CH5_INT_ENA_V << H264_DMA_INFIFO_UDF_L1_CH5_INT_ENA_S)
#define H264_DMA_INFIFO_UDF_L1_CH5_INT_ENA_V  0x00000001U
#define H264_DMA_INFIFO_UDF_L1_CH5_INT_ENA_S  3
/** H264_DMA_FETCH_MB_COL_CNT_OVF_CH5_INT_ENA : R/W; bitpos: [4]; default: 0;
 *  The interrupt enable bit for the INFIFO_UDF_L1_CH_INT interrupt.
 */
#define H264_DMA_FETCH_MB_COL_CNT_OVF_CH5_INT_ENA    (BIT(4))
#define H264_DMA_FETCH_MB_COL_CNT_OVF_CH5_INT_ENA_M  (H264_DMA_FETCH_MB_COL_CNT_OVF_CH5_INT_ENA_V << H264_DMA_FETCH_MB_COL_CNT_OVF_CH5_INT_ENA_S)
#define H264_DMA_FETCH_MB_COL_CNT_OVF_CH5_INT_ENA_V  0x00000001U
#define H264_DMA_FETCH_MB_COL_CNT_OVF_CH5_INT_ENA_S  4

