espressif/esp-idf/components/soc/esp32p4/register/hw_ver1/soc/h264_dma_reg.h
/** H264_DMA_IN_INT_ST_CH5_REG register
 *  RX CH5  interrupt st register
 */
#define H264_DMA_IN_INT_ST_CH5_REG (DR_REG_H264_DMA_BASE + 0xa18)
/** H264_DMA_IN_DONE_CH5_INT_ST : RO; bitpos: [0]; default: 0;
 *  The raw interrupt status bit for the IN_DONE_CH_INT interrupt.
 */
#define H264_DMA_IN_DONE_CH5_INT_ST    (BIT(0))
#define H264_DMA_IN_DONE_CH5_INT_ST_M  (H264_DMA_IN_DONE_CH5_INT_ST_V << H264_DMA_IN_DONE_CH5_INT_ST_S)
#define H264_DMA_IN_DONE_CH5_INT_ST_V  0x00000001U
#define H264_DMA_IN_DONE_CH5_INT_ST_S  0
/** H264_DMA_IN_SUC_EOF_CH5_INT_ST : RO; bitpos: [1]; default: 0;
 *  The raw interrupt status bit for the IN_SUC_EOF_CH_INT interrupt.
 */
#define H264_DMA_IN_SUC_EOF_CH5_INT_ST    (BIT(1))
#define H264_DMA_IN_SUC_EOF_CH5_INT_ST_M  (H264_DMA_IN_SUC_EOF_CH5_INT_ST_V << H264_DMA_IN_SUC_EOF_CH5_INT_ST_S)
#define H264_DMA_IN_SUC_EOF_CH5_INT_ST_V  0x00000001U
#define H264_DMA_IN_SUC_EOF_CH5_INT_ST_S  1
/** H264_DMA_INFIFO_OVF_L1_CH5_INT_ST : RO; bitpos: [2]; default: 0;
 *  The raw interrupt status bit for the INFIFO_OVF_L1_CH_INT interrupt.
 */
#define H264_DMA_INFIFO_OVF_L1_CH5_INT_ST    (BIT(2))
#define H264_DMA_INFIFO_OVF_L1_CH5_INT_ST_M  (H264_DMA_INFIFO_OVF_L1_CH5_INT_ST_V << H264_DMA_INFIFO_OVF_L1_CH5_INT_ST_S)
#define H264_DMA_INFIFO_OVF_L1_CH5_INT_ST_V  0x00000001U
#define H264_DMA_INFIFO_OVF_L1_CH5_INT_ST_S  2
/** H264_DMA_INFIFO_UDF_L1_CH5_INT_ST : RO; bitpos: [3]; default: 0;
 *  The raw interrupt status bit for the INFIFO_UDF_L1_CH_INT interrupt.
 */
#define H264_DMA_INFIFO_UDF_L1_CH5_INT_ST    (BIT(3))
#define H264_DMA_INFIFO_UDF_L1_CH5_INT_ST_M  (H264_DMA_INFIFO_UDF_L1_CH5_INT_ST_V << H264_DMA_INFIFO_UDF_L1_CH5_INT_ST_S)
#define H264_DMA_INFIFO_UDF_L1_CH5_INT_ST_V  0x00000001U
#define H264_DMA_INFIFO_UDF_L1_CH5_INT_ST_S  3
/** H264_DMA_FETCH_MB_COL_CNT_OVF_CH5_INT_ST : RO; bitpos: [4]; default: 0;
 *  The raw interrupt status bit for the INFIFO_UDF_L1_CH_INT interrupt.
 */
#define H264_DMA_FETCH_MB_COL_CNT_OVF_CH5_INT_ST    (BIT(4))
#define H264_DMA_FETCH_MB_COL_CNT_OVF_CH5_INT_ST_M  (H264_DMA_FETCH_MB_COL_CNT_OVF_CH5_INT_ST_V << H264_DMA_FETCH_MB_COL_CNT_OVF_CH5_INT_ST_S)
#define H264_DMA_FETCH_MB_COL_CNT_OVF_CH5_INT_ST_V  0x00000001U
#define H264_DMA_FETCH_MB_COL_CNT_OVF_CH5_INT_ST_S  4

/** H264_DMA_IN_INT_CLR_CH5_REG register
 *  RX CH5  interrupt clr register
 */
#define H264_DMA_IN_INT_CLR_CH5_REG (DR_REG_H264_DMA_BASE + 0xa1c)
/** H264_DMA_IN_DONE_CH5_INT_CLR : WT; bitpos: [0]; default: 0;
 *  Set this bit to clear the IN_DONE_CH_INT interrupt.
 */
#define H264_DMA_IN_DONE_CH5_INT_CLR    (BIT(0))
#define H264_DMA_IN_DONE_CH5_INT_CLR_M  (H264_DMA_IN_DONE_CH5_INT_CLR_V << H264_DMA_IN_DONE_CH5_INT_CLR_S)
#define H264_DMA_IN_DONE_CH5_INT_CLR_V  0x00000001U
#define H264_DMA_IN_DONE_CH5_INT_CLR_S  0
/** H264_DMA_IN_SUC_EOF_CH5_INT_CLR : WT; bitpos: [1]; default: 0;
 *  Set this bit to clear the IN_SUC_EOF_CH_INT interrupt.
 */
#define H264_DMA_IN_SUC_EOF_CH5_INT_CLR    (BIT(1))
#define H264_DMA_IN_SUC_EOF_CH5_INT_CLR_M  (H264_DMA_IN_SUC_EOF_CH5_INT_CLR_V << H264_DMA_IN_SUC_EOF_CH5_INT_CLR_S)
#define H264_DMA_IN_SUC_EOF_CH5_INT_CLR_V  0x00000001U
#define H264_DMA_IN_SUC_EOF_CH5_INT_CLR_S  1
/** H264_DMA_INFIFO_OVF_L1_CH5_INT_CLR : WT; bitpos: [2]; default: 0;
 *  Set this bit to clear the INFIFO_OVF_L1_CH_INT interrupt.
 */
#define H264_DMA_INFIFO_OVF_L1_CH5_INT_CLR    (BIT(2))
#define H264_DMA_INFIFO_OVF_L1_CH5_INT_CLR_M  (H264_DMA_INFIFO_OVF_L1_CH5_INT_CLR_V << H264_DMA_INFIFO_OVF_L1_CH5_INT_CLR_S)
#define H264_DMA_INFIFO_OVF_L1_CH5_INT_CLR_V  0x00000001U
#define H264_DMA_INFIFO_OVF_L1_CH5_INT_CLR_S  2
/** H264_DMA_INFIFO_UDF_L1_CH5_INT_CLR : WT; bitpos: [3]; default: 0;
 *  Set this bit to clear the INFIFO_UDF_L1_CH_INT interrupt.
 */
#define H264_DMA_INFIFO_UDF_L1_CH5_INT_CLR    (BIT(3))
#define H264_DMA_INFIFO_UDF_L1_CH5_INT_CLR_M  (H264_DMA_INFIFO_UDF_L1_CH5_INT_CLR_V << H264_DMA_INFIFO_UDF_L1_CH5_INT_CLR_S)
#define H264_DMA_INFIFO_UDF_L1_CH5_INT_CLR_V  0x00000001U
#define H264_DMA_INFIFO_UDF_L1_CH5_INT_CLR_S  3
/** H264_DMA_FETCH_MB_COL_CNT_OVF_CH5_INT_CLR : WT; bitpos: [4]; default: 0;
 *  Set this bit to clear the INFIFO_UDF_L1_CH_INT interrupt.
 */
#define H264_DMA_FETCH_MB_COL_CNT_OVF_CH5_INT_CLR    (BIT(4))
#define H264_DMA_FETCH_MB_COL_CNT_OVF_CH5_INT_CLR_M  (H264_DMA_FETCH_MB_COL_CNT_OVF_CH5_INT_CLR_V << H264_DMA_FETCH_MB_COL_CNT_OVF_CH5_INT_CLR_S)
#define H264_DMA_FETCH_MB_COL_CNT_OVF_CH5_INT_CLR_V  0x00000001U
#define H264_DMA_FETCH_MB_COL_CNT_OVF_CH5_INT_CLR_S  4

/** H264_DMA_INFIFO_STATUS_CH5_REG register
 *  RX CH5 INFIFO status register
 */
#define H264_DMA_INFIFO_STATUS_CH5_REG (DR_REG_H264_DMA_BASE + 0xa20)
/** H264_DMA_INFIFO_FULL_L1_CH5 : RO; bitpos: [0]; default: 0;
 *  Tx FIFO full signal for Tx channel 1.
 */
#define H264_DMA_INFIFO_FULL_L1_CH5    (BIT(0))
#define H264_DMA_INFIFO_FULL_L1_CH5_M  (H264_DMA_INFIFO_FULL_L1_CH5_V << H264_DMA_INFIFO_FULL_L1_CH5_S)
#define H264_DMA_INFIFO_FULL_L1_CH5_V  0x00000001U
#define H264_DMA_INFIFO_FULL_L1_CH5_S  0
/** H264_DMA_INFIFO_EMPTY_L1_CH5 : RO; bitpos: [1]; default: 1;
 *  Tx FIFO empty signal for Tx channel 1.
 */
#define H264_DMA_INFIFO_EMPTY_L1_CH5    (BIT(1))
#define H264_DMA_INFIFO_EMPTY_L1_CH5_M  (H264_DMA_INFIFO_EMPTY_L1_CH5_V << H264_DMA_INFIFO_EMPTY_L1_CH5_S)
#define H264_DMA_INFIFO_EMPTY_L1_CH5_V  0x00000001U
#define H264_DMA_INFIFO_EMPTY_L1_CH5_S  1
/** H264_DMA_INFIFO_CNT_L1_CH5 : RO; bitpos: [6:2]; default: 0;
 *  The register stores the byte number of the data in Tx FIFO for Tx channel 1.
 */
#define H264_DMA_INFIFO_CNT_L1_CH5    0x0000001FU
#define H264_DMA_INFIFO_CNT_L1_CH5_M  (H264_DMA_INFIFO_CNT_L1_CH5_V << H264_DMA_INFIFO_CNT_L1_CH5_S)
#define H264_DMA_INFIFO_CNT_L1_CH5_V  0x0000001FU
#define H264_DMA_INFIFO_CNT_L1_CH5_S  2

/** H264_DMA_IN_POP_CH5_REG register
 *  RX CH5 INFIFO pop register
 */
#define H264_DMA_IN_POP_CH5_REG (DR_REG_H264_DMA_BASE + 0xa24)
/** H264_DMA_INFIFO_RDATA_CH5 : RO; bitpos: [10:0]; default: 1024;
 *  This register stores the data popping from DMA Rx FIFO.
 */
#define H264_DMA_INFIFO_RDATA_CH5    0x000007FFU
#define H264_DMA_INFIFO_RDATA_CH5_M  (H264_DMA_INFIFO_RDATA_CH5_V << H264_DMA_INFIFO_RDATA_CH5_S)
#define H264_DMA_INFIFO_RDATA_CH5_V  0x000007FFU
#define H264_DMA_INFIFO_RDATA_CH5_S  0
/** H264_DMA_INFIFO_POP_CH5 : R/W/SC; bitpos: [11]; default: 0;
 *  Set this bit to pop data from DMA Rx FIFO.
 */
#define H264_DMA_INFIFO_POP_CH5    (BIT(11))
#define H264_DMA_INFIFO_POP_CH5_M  (H264_DMA_INFIFO_POP_CH5_V << H264_DMA_INFIFO_POP_CH5_S)
#define H264_DMA_INFIFO_POP_CH5_V  0x00000001U
#define H264_DMA_INFIFO_POP_CH5_S  11

