espressif/esp-idf/components/soc/esp32p4/register/hw_ver1/soc/h264_dma_reg.h
/** H264_DMA_IN_STATE_CH5_REG register
 *  RX CH5 state register
 */
#define H264_DMA_IN_STATE_CH5_REG (DR_REG_H264_DMA_BASE + 0xa28)
/** H264_DMA_IN_STATE_CH5 : RO; bitpos: [2:0]; default: 0;
 *  This register stores the current control module state machine state.
 */
#define H264_DMA_IN_STATE_CH5    0x00000007U
#define H264_DMA_IN_STATE_CH5_M  (H264_DMA_IN_STATE_CH5_V << H264_DMA_IN_STATE_CH5_S)
#define H264_DMA_IN_STATE_CH5_V  0x00000007U
#define H264_DMA_IN_STATE_CH5_S  0
/** H264_DMA_IN_RESET_AVAIL_CH5 : RO; bitpos: [3]; default: 1;
 *  This register indicate that if the channel reset is safety.
 */
#define H264_DMA_IN_RESET_AVAIL_CH5    (BIT(3))
#define H264_DMA_IN_RESET_AVAIL_CH5_M  (H264_DMA_IN_RESET_AVAIL_CH5_V << H264_DMA_IN_RESET_AVAIL_CH5_S)
#define H264_DMA_IN_RESET_AVAIL_CH5_V  0x00000001U
#define H264_DMA_IN_RESET_AVAIL_CH5_S  3

/** H264_DMA_IN_ARB_CH5_REG register
 *  RX CH5 arb register
 */
#define H264_DMA_IN_ARB_CH5_REG (DR_REG_H264_DMA_BASE + 0xa40)
/** H264_DMA_IN_ARB_TOKEN_NUM_CH5 : R/W; bitpos: [3:0]; default: 1;
 *  Set the max number of token count of arbiter
 */
#define H264_DMA_IN_ARB_TOKEN_NUM_CH5    0x0000000FU
#define H264_DMA_IN_ARB_TOKEN_NUM_CH5_M  (H264_DMA_IN_ARB_TOKEN_NUM_CH5_V << H264_DMA_IN_ARB_TOKEN_NUM_CH5_S)
#define H264_DMA_IN_ARB_TOKEN_NUM_CH5_V  0x0000000FU
#define H264_DMA_IN_ARB_TOKEN_NUM_CH5_S  0
/** H264_DMA_INTER_IN_ARB_PRIORITY_CH5 : R/W; bitpos: [8:6]; default: 1;
 *  Set the priority of channel
 */
#define H264_DMA_INTER_IN_ARB_PRIORITY_CH5    0x00000007U
#define H264_DMA_INTER_IN_ARB_PRIORITY_CH5_M  (H264_DMA_INTER_IN_ARB_PRIORITY_CH5_V << H264_DMA_INTER_IN_ARB_PRIORITY_CH5_S)
#define H264_DMA_INTER_IN_ARB_PRIORITY_CH5_V  0x00000007U
#define H264_DMA_INTER_IN_ARB_PRIORITY_CH5_S  6

/** H264_DMA_IN_FIFO_CNT_CH5_REG register
 *  rx CH5 fifo cnt register
 */
#define H264_DMA_IN_FIFO_CNT_CH5_REG (DR_REG_H264_DMA_BASE + 0xa80)
/** H264_DMA_IN_CMDFIFO_INFIFO_CNT_CH5 : RO; bitpos: [9:0]; default: 0;
 *  only for debug
 */
#define H264_DMA_IN_CMDFIFO_INFIFO_CNT_CH5    0x000003FFU
#define H264_DMA_IN_CMDFIFO_INFIFO_CNT_CH5_M  (H264_DMA_IN_CMDFIFO_INFIFO_CNT_CH5_V << H264_DMA_IN_CMDFIFO_INFIFO_CNT_CH5_S)
#define H264_DMA_IN_CMDFIFO_INFIFO_CNT_CH5_V  0x000003FFU
#define H264_DMA_IN_CMDFIFO_INFIFO_CNT_CH5_S  0

/** H264_DMA_IN_POP_DATA_CNT_CH5_REG register
 *  rx CH5 pop data cnt register
 */
#define H264_DMA_IN_POP_DATA_CNT_CH5_REG (DR_REG_H264_DMA_BASE + 0xa84)
/** H264_DMA_IN_CMDFIFO_POP_DATA_CNT_CH5 : RO; bitpos: [7:0]; default: 255;
 *  only for debug
 */
#define H264_DMA_IN_CMDFIFO_POP_DATA_CNT_CH5    0x000000FFU
#define H264_DMA_IN_CMDFIFO_POP_DATA_CNT_CH5_M  (H264_DMA_IN_CMDFIFO_POP_DATA_CNT_CH5_V << H264_DMA_IN_CMDFIFO_POP_DATA_CNT_CH5_S)
#define H264_DMA_IN_CMDFIFO_POP_DATA_CNT_CH5_V  0x000000FFU
#define H264_DMA_IN_CMDFIFO_POP_DATA_CNT_CH5_S  0

/** H264_DMA_IN_XADDR_CH5_REG register
 *  rx CH5 xaddr register
 */
#define H264_DMA_IN_XADDR_CH5_REG (DR_REG_H264_DMA_BASE + 0xa88)
/** H264_DMA_IN_CMDFIFO_XADDR_CH5 : RO; bitpos: [31:0]; default: 0;
 *  only for debug
 */
#define H264_DMA_IN_CMDFIFO_XADDR_CH5    0xFFFFFFFFU
#define H264_DMA_IN_CMDFIFO_XADDR_CH5_M  (H264_DMA_IN_CMDFIFO_XADDR_CH5_V << H264_DMA_IN_CMDFIFO_XADDR_CH5_S)
#define H264_DMA_IN_CMDFIFO_XADDR_CH5_V  0xFFFFFFFFU
#define H264_DMA_IN_CMDFIFO_XADDR_CH5_S  0

/** H264_DMA_IN_BUF_HB_RCV_CH5_REG register
 *  rx CH5 buf len hb rcv register
 */
#define H264_DMA_IN_BUF_HB_RCV_CH5_REG (DR_REG_H264_DMA_BASE + 0xa8c)
/** H264_DMA_IN_CMDFIFO_BUF_HB_RCV_CH5 : RO; bitpos: [28:0]; default: 0;
 *  only for debug
 */
#define H264_DMA_IN_CMDFIFO_BUF_HB_RCV_CH5    0x1FFFFFFFU
#define H264_DMA_IN_CMDFIFO_BUF_HB_RCV_CH5_M  (H264_DMA_IN_CMDFIFO_BUF_HB_RCV_CH5_V << H264_DMA_IN_CMDFIFO_BUF_HB_RCV_CH5_S)
#define H264_DMA_IN_CMDFIFO_BUF_HB_RCV_CH5_V  0x1FFFFFFFU
#define H264_DMA_IN_CMDFIFO_BUF_HB_RCV_CH5_S  0

/** H264_DMA_INTER_AXI_ERR_REG register
 *  inter memory axi err register
 */
#define H264_DMA_INTER_AXI_ERR_REG (DR_REG_H264_DMA_BASE + 0xb00)
/** H264_DMA_INTER_RID_ERR_CNT : RO; bitpos: [3:0]; default: 0;
 *  AXI read id err cnt
 */
#define H264_DMA_INTER_RID_ERR_CNT    0x0000000FU
#define H264_DMA_INTER_RID_ERR_CNT_M  (H264_DMA_INTER_RID_ERR_CNT_V << H264_DMA_INTER_RID_ERR_CNT_S)
#define H264_DMA_INTER_RID_ERR_CNT_V  0x0000000FU
#define H264_DMA_INTER_RID_ERR_CNT_S  0
/** H264_DMA_INTER_RRESP_ERR_CNT : RO; bitpos: [7:4]; default: 0;
 *  AXI read resp err cnt
 */
#define H264_DMA_INTER_RRESP_ERR_CNT    0x0000000FU
#define H264_DMA_INTER_RRESP_ERR_CNT_M  (H264_DMA_INTER_RRESP_ERR_CNT_V << H264_DMA_INTER_RRESP_ERR_CNT_S)
#define H264_DMA_INTER_RRESP_ERR_CNT_V  0x0000000FU
#define H264_DMA_INTER_RRESP_ERR_CNT_S  4
/** H264_DMA_INTER_WRESP_ERR_CNT : RO; bitpos: [11:8]; default: 0;
 *  AXI write resp err cnt
 */
#define H264_DMA_INTER_WRESP_ERR_CNT    0x0000000FU
#define H264_DMA_INTER_WRESP_ERR_CNT_M  (H264_DMA_INTER_WRESP_ERR_CNT_V << H264_DMA_INTER_WRESP_ERR_CNT_S)
#define H264_DMA_INTER_WRESP_ERR_CNT_V  0x0000000FU
#define H264_DMA_INTER_WRESP_ERR_CNT_S  8
/** H264_DMA_INTER_RD_FIFO_CNT : RO; bitpos: [14:12]; default: 0;
 *  AXI read cmd fifo remain cmd count
 */
#define H264_DMA_INTER_RD_FIFO_CNT    0x00000007U
#define H264_DMA_INTER_RD_FIFO_CNT_M  (H264_DMA_INTER_RD_FIFO_CNT_V << H264_DMA_INTER_RD_FIFO_CNT_S)
#define H264_DMA_INTER_RD_FIFO_CNT_V  0x00000007U
#define H264_DMA_INTER_RD_FIFO_CNT_S  12
/** H264_DMA_INTER_RD_BAK_FIFO_CNT : RO; bitpos: [18:15]; default: 0;
 *  AXI read backup cmd fifo remain cmd count
 */
#define H264_DMA_INTER_RD_BAK_FIFO_CNT    0x0000000FU
#define H264_DMA_INTER_RD_BAK_FIFO_CNT_M  (H264_DMA_INTER_RD_BAK_FIFO_CNT_V << H264_DMA_INTER_RD_BAK_FIFO_CNT_S)
#define H264_DMA_INTER_RD_BAK_FIFO_CNT_V  0x0000000FU
#define H264_DMA_INTER_RD_BAK_FIFO_CNT_S  15
/** H264_DMA_INTER_WR_FIFO_CNT : RO; bitpos: [21:19]; default: 0;
 *  AXI write cmd fifo remain cmd count
 */
#define H264_DMA_INTER_WR_FIFO_CNT    0x00000007U
#define H264_DMA_INTER_WR_FIFO_CNT_M  (H264_DMA_INTER_WR_FIFO_CNT_V << H264_DMA_INTER_WR_FIFO_CNT_S)
#define H264_DMA_INTER_WR_FIFO_CNT_V  0x00000007U
#define H264_DMA_INTER_WR_FIFO_CNT_S  19
/** H264_DMA_INTER_WR_BAK_FIFO_CNT : RO; bitpos: [25:22]; default: 0;
 *  AXI write backup cmd fifo remain cmd count
 */
#define H264_DMA_INTER_WR_BAK_FIFO_CNT    0x0000000FU
#define H264_DMA_INTER_WR_BAK_FIFO_CNT_M  (H264_DMA_INTER_WR_BAK_FIFO_CNT_V << H264_DMA_INTER_WR_BAK_FIFO_CNT_S)
#define H264_DMA_INTER_WR_BAK_FIFO_CNT_V  0x0000000FU
#define H264_DMA_INTER_WR_BAK_FIFO_CNT_S  22

