espressif/esp-idf/components/soc/esp32p4/register/hw_ver1/soc/h264_dma_reg.h
/** H264_DMA_EXTER_AXI_ERR_REG register
 *  exter memory axi err register
 */
#define H264_DMA_EXTER_AXI_ERR_REG (DR_REG_H264_DMA_BASE + 0xb04)
/** H264_DMA_EXTER_RID_ERR_CNT : RO; bitpos: [3:0]; default: 0;
 *  AXI read id err cnt
 */
#define H264_DMA_EXTER_RID_ERR_CNT    0x0000000FU
#define H264_DMA_EXTER_RID_ERR_CNT_M  (H264_DMA_EXTER_RID_ERR_CNT_V << H264_DMA_EXTER_RID_ERR_CNT_S)
#define H264_DMA_EXTER_RID_ERR_CNT_V  0x0000000FU
#define H264_DMA_EXTER_RID_ERR_CNT_S  0
/** H264_DMA_EXTER_RRESP_ERR_CNT : RO; bitpos: [7:4]; default: 0;
 *  AXI read resp err cnt
 */
#define H264_DMA_EXTER_RRESP_ERR_CNT    0x0000000FU
#define H264_DMA_EXTER_RRESP_ERR_CNT_M  (H264_DMA_EXTER_RRESP_ERR_CNT_V << H264_DMA_EXTER_RRESP_ERR_CNT_S)
#define H264_DMA_EXTER_RRESP_ERR_CNT_V  0x0000000FU
#define H264_DMA_EXTER_RRESP_ERR_CNT_S  4
/** H264_DMA_EXTER_WRESP_ERR_CNT : RO; bitpos: [11:8]; default: 0;
 *  AXI write resp err cnt
 */
#define H264_DMA_EXTER_WRESP_ERR_CNT    0x0000000FU
#define H264_DMA_EXTER_WRESP_ERR_CNT_M  (H264_DMA_EXTER_WRESP_ERR_CNT_V << H264_DMA_EXTER_WRESP_ERR_CNT_S)
#define H264_DMA_EXTER_WRESP_ERR_CNT_V  0x0000000FU
#define H264_DMA_EXTER_WRESP_ERR_CNT_S  8
/** H264_DMA_EXTER_RD_FIFO_CNT : RO; bitpos: [14:12]; default: 0;
 *  AXI read cmd fifo remain cmd count
 */
#define H264_DMA_EXTER_RD_FIFO_CNT    0x00000007U
#define H264_DMA_EXTER_RD_FIFO_CNT_M  (H264_DMA_EXTER_RD_FIFO_CNT_V << H264_DMA_EXTER_RD_FIFO_CNT_S)
#define H264_DMA_EXTER_RD_FIFO_CNT_V  0x00000007U
#define H264_DMA_EXTER_RD_FIFO_CNT_S  12
/** H264_DMA_EXTER_RD_BAK_FIFO_CNT : RO; bitpos: [18:15]; default: 0;
 *  AXI read backup cmd fifo remain cmd count
 */
#define H264_DMA_EXTER_RD_BAK_FIFO_CNT    0x0000000FU
#define H264_DMA_EXTER_RD_BAK_FIFO_CNT_M  (H264_DMA_EXTER_RD_BAK_FIFO_CNT_V << H264_DMA_EXTER_RD_BAK_FIFO_CNT_S)
#define H264_DMA_EXTER_RD_BAK_FIFO_CNT_V  0x0000000FU
#define H264_DMA_EXTER_RD_BAK_FIFO_CNT_S  15
/** H264_DMA_EXTER_WR_FIFO_CNT : RO; bitpos: [21:19]; default: 0;
 *  AXI write cmd fifo remain cmd count
 */
#define H264_DMA_EXTER_WR_FIFO_CNT    0x00000007U
#define H264_DMA_EXTER_WR_FIFO_CNT_M  (H264_DMA_EXTER_WR_FIFO_CNT_V << H264_DMA_EXTER_WR_FIFO_CNT_S)
#define H264_DMA_EXTER_WR_FIFO_CNT_V  0x00000007U
#define H264_DMA_EXTER_WR_FIFO_CNT_S  19
/** H264_DMA_EXTER_WR_BAK_FIFO_CNT : RO; bitpos: [25:22]; default: 0;
 *  AXI write backup cmd fifo remain cmd count
 */
#define H264_DMA_EXTER_WR_BAK_FIFO_CNT    0x0000000FU
#define H264_DMA_EXTER_WR_BAK_FIFO_CNT_M  (H264_DMA_EXTER_WR_BAK_FIFO_CNT_V << H264_DMA_EXTER_WR_BAK_FIFO_CNT_S)
#define H264_DMA_EXTER_WR_BAK_FIFO_CNT_V  0x0000000FU
#define H264_DMA_EXTER_WR_BAK_FIFO_CNT_S  22

/** H264_DMA_RST_CONF_REG register
 *  axi reset config register
 */
#define H264_DMA_RST_CONF_REG (DR_REG_H264_DMA_BASE + 0xb08)
/** H264_DMA_INTER_AXIM_RD_RST : R/W; bitpos: [0]; default: 0;
 *  Write 1 then write 0  to this bit to reset axi master read data FIFO.
 */
#define H264_DMA_INTER_AXIM_RD_RST    (BIT(0))
#define H264_DMA_INTER_AXIM_RD_RST_M  (H264_DMA_INTER_AXIM_RD_RST_V << H264_DMA_INTER_AXIM_RD_RST_S)
#define H264_DMA_INTER_AXIM_RD_RST_V  0x00000001U
#define H264_DMA_INTER_AXIM_RD_RST_S  0
/** H264_DMA_INTER_AXIM_WR_RST : R/W; bitpos: [1]; default: 0;
 *  Write 1 then write 0  to this bit to reset axi master write data FIFO.
 */
#define H264_DMA_INTER_AXIM_WR_RST    (BIT(1))
#define H264_DMA_INTER_AXIM_WR_RST_M  (H264_DMA_INTER_AXIM_WR_RST_V << H264_DMA_INTER_AXIM_WR_RST_S)
#define H264_DMA_INTER_AXIM_WR_RST_V  0x00000001U
#define H264_DMA_INTER_AXIM_WR_RST_S  1
/** H264_DMA_EXTER_AXIM_RD_RST : R/W; bitpos: [2]; default: 0;
 *  Write 1 then write 0  to this bit to reset axi master read data FIFO.
 */
#define H264_DMA_EXTER_AXIM_RD_RST    (BIT(2))
#define H264_DMA_EXTER_AXIM_RD_RST_M  (H264_DMA_EXTER_AXIM_RD_RST_V << H264_DMA_EXTER_AXIM_RD_RST_S)
#define H264_DMA_EXTER_AXIM_RD_RST_V  0x00000001U
#define H264_DMA_EXTER_AXIM_RD_RST_S  2
/** H264_DMA_EXTER_AXIM_WR_RST : R/W; bitpos: [3]; default: 0;
 *  Write 1 then write 0  to this bit to reset axi master write data FIFO.
 */
#define H264_DMA_EXTER_AXIM_WR_RST    (BIT(3))
#define H264_DMA_EXTER_AXIM_WR_RST_M  (H264_DMA_EXTER_AXIM_WR_RST_V << H264_DMA_EXTER_AXIM_WR_RST_S)
#define H264_DMA_EXTER_AXIM_WR_RST_V  0x00000001U
#define H264_DMA_EXTER_AXIM_WR_RST_S  3
/** H264_DMA_CLK_EN : R/W; bitpos: [4]; default: 0;
 *  1'h1: Force clock on for register. 1'h0: Support clock only when application writes
 *  registers.
 */
#define H264_DMA_CLK_EN    (BIT(4))
#define H264_DMA_CLK_EN_M  (H264_DMA_CLK_EN_V << H264_DMA_CLK_EN_S)
#define H264_DMA_CLK_EN_V  0x00000001U
#define H264_DMA_CLK_EN_S  4

/** H264_DMA_INTER_MEM_START_ADDR0_REG register
 *  Start address of inter memory range0 register
 */
#define H264_DMA_INTER_MEM_START_ADDR0_REG (DR_REG_H264_DMA_BASE + 0xb0c)
/** H264_DMA_ACCESS_INTER_MEM_START_ADDR0 : R/W; bitpos: [31:0]; default: 806354944;
 *  The start address of accessible address space.
 */
#define H264_DMA_ACCESS_INTER_MEM_START_ADDR0    0xFFFFFFFFU
#define H264_DMA_ACCESS_INTER_MEM_START_ADDR0_M  (H264_DMA_ACCESS_INTER_MEM_START_ADDR0_V << H264_DMA_ACCESS_INTER_MEM_START_ADDR0_S)
#define H264_DMA_ACCESS_INTER_MEM_START_ADDR0_V  0xFFFFFFFFU
#define H264_DMA_ACCESS_INTER_MEM_START_ADDR0_S  0

/** H264_DMA_INTER_MEM_END_ADDR0_REG register
 *  end address of inter memory range0 register
 */
#define H264_DMA_INTER_MEM_END_ADDR0_REG (DR_REG_H264_DMA_BASE + 0xb10)
/** H264_DMA_ACCESS_INTER_MEM_END_ADDR0 : R/W; bitpos: [31:0]; default: 2415919103;
 *  The end address of accessible address space. The access address beyond this range
 *  would lead to descriptor error.
 */
#define H264_DMA_ACCESS_INTER_MEM_END_ADDR0    0xFFFFFFFFU
#define H264_DMA_ACCESS_INTER_MEM_END_ADDR0_M  (H264_DMA_ACCESS_INTER_MEM_END_ADDR0_V << H264_DMA_ACCESS_INTER_MEM_END_ADDR0_S)
#define H264_DMA_ACCESS_INTER_MEM_END_ADDR0_V  0xFFFFFFFFU
#define H264_DMA_ACCESS_INTER_MEM_END_ADDR0_S  0

/** H264_DMA_INTER_MEM_START_ADDR1_REG register
 *  Start address of inter memory range1 register
 */
#define H264_DMA_INTER_MEM_START_ADDR1_REG (DR_REG_H264_DMA_BASE + 0xb14)
/** H264_DMA_ACCESS_INTER_MEM_START_ADDR1 : R/W; bitpos: [31:0]; default: 806354944;
 *  The start address of accessible address space.
 */
#define H264_DMA_ACCESS_INTER_MEM_START_ADDR1    0xFFFFFFFFU
#define H264_DMA_ACCESS_INTER_MEM_START_ADDR1_M  (H264_DMA_ACCESS_INTER_MEM_START_ADDR1_V << H264_DMA_ACCESS_INTER_MEM_START_ADDR1_S)
#define H264_DMA_ACCESS_INTER_MEM_START_ADDR1_V  0xFFFFFFFFU
#define H264_DMA_ACCESS_INTER_MEM_START_ADDR1_S  0

