espressif/esp-idf/components/soc/esp32p4/register/hw_ver1/soc/h264_dma_reg.h
/** H264_DMA_INTER_MEM_END_ADDR1_REG register
 *  end address of inter memory range1 register
 */
#define H264_DMA_INTER_MEM_END_ADDR1_REG (DR_REG_H264_DMA_BASE + 0xb18)
/** H264_DMA_ACCESS_INTER_MEM_END_ADDR1 : R/W; bitpos: [31:0]; default: 2415919103;
 *  The end address of accessible address space. The access address beyond this range
 *  would lead to descriptor error.
 */
#define H264_DMA_ACCESS_INTER_MEM_END_ADDR1    0xFFFFFFFFU
#define H264_DMA_ACCESS_INTER_MEM_END_ADDR1_M  (H264_DMA_ACCESS_INTER_MEM_END_ADDR1_V << H264_DMA_ACCESS_INTER_MEM_END_ADDR1_S)
#define H264_DMA_ACCESS_INTER_MEM_END_ADDR1_V  0xFFFFFFFFU
#define H264_DMA_ACCESS_INTER_MEM_END_ADDR1_S  0

/** H264_DMA_EXTER_MEM_START_ADDR0_REG register
 *  Start address of exter memory range0 register
 */
#define H264_DMA_EXTER_MEM_START_ADDR0_REG (DR_REG_H264_DMA_BASE + 0xb20)
/** H264_DMA_ACCESS_EXTER_MEM_START_ADDR0 : R/W; bitpos: [31:0]; default: 806354944;
 *  The start address of accessible address space.
 */
#define H264_DMA_ACCESS_EXTER_MEM_START_ADDR0    0xFFFFFFFFU
#define H264_DMA_ACCESS_EXTER_MEM_START_ADDR0_M  (H264_DMA_ACCESS_EXTER_MEM_START_ADDR0_V << H264_DMA_ACCESS_EXTER_MEM_START_ADDR0_S)
#define H264_DMA_ACCESS_EXTER_MEM_START_ADDR0_V  0xFFFFFFFFU
#define H264_DMA_ACCESS_EXTER_MEM_START_ADDR0_S  0

/** H264_DMA_EXTER_MEM_END_ADDR0_REG register
 *  end address of exter memory range0 register
 */
#define H264_DMA_EXTER_MEM_END_ADDR0_REG (DR_REG_H264_DMA_BASE + 0xb24)
/** H264_DMA_ACCESS_EXTER_MEM_END_ADDR0 : R/W; bitpos: [31:0]; default: 2415919103;
 *  The end address of accessible address space. The access address beyond this range
 *  would lead to descriptor error.
 */
#define H264_DMA_ACCESS_EXTER_MEM_END_ADDR0    0xFFFFFFFFU
#define H264_DMA_ACCESS_EXTER_MEM_END_ADDR0_M  (H264_DMA_ACCESS_EXTER_MEM_END_ADDR0_V << H264_DMA_ACCESS_EXTER_MEM_END_ADDR0_S)
#define H264_DMA_ACCESS_EXTER_MEM_END_ADDR0_V  0xFFFFFFFFU
#define H264_DMA_ACCESS_EXTER_MEM_END_ADDR0_S  0

/** H264_DMA_EXTER_MEM_START_ADDR1_REG register
 *  Start address of exter memory range1 register
 */
#define H264_DMA_EXTER_MEM_START_ADDR1_REG (DR_REG_H264_DMA_BASE + 0xb28)
/** H264_DMA_ACCESS_EXTER_MEM_START_ADDR1 : R/W; bitpos: [31:0]; default: 806354944;
 *  The start address of accessible address space.
 */
#define H264_DMA_ACCESS_EXTER_MEM_START_ADDR1    0xFFFFFFFFU
#define H264_DMA_ACCESS_EXTER_MEM_START_ADDR1_M  (H264_DMA_ACCESS_EXTER_MEM_START_ADDR1_V << H264_DMA_ACCESS_EXTER_MEM_START_ADDR1_S)
#define H264_DMA_ACCESS_EXTER_MEM_START_ADDR1_V  0xFFFFFFFFU
#define H264_DMA_ACCESS_EXTER_MEM_START_ADDR1_S  0

/** H264_DMA_EXTER_MEM_END_ADDR1_REG register
 *  end address of exter memory range1 register
 */
#define H264_DMA_EXTER_MEM_END_ADDR1_REG (DR_REG_H264_DMA_BASE + 0xb2c)
/** H264_DMA_ACCESS_EXTER_MEM_END_ADDR1 : R/W; bitpos: [31:0]; default: 2415919103;
 *  The end address of accessible address space. The access address beyond this range
 *  would lead to descriptor error.
 */
#define H264_DMA_ACCESS_EXTER_MEM_END_ADDR1    0xFFFFFFFFU
#define H264_DMA_ACCESS_EXTER_MEM_END_ADDR1_M  (H264_DMA_ACCESS_EXTER_MEM_END_ADDR1_V << H264_DMA_ACCESS_EXTER_MEM_END_ADDR1_S)
#define H264_DMA_ACCESS_EXTER_MEM_END_ADDR1_V  0xFFFFFFFFU
#define H264_DMA_ACCESS_EXTER_MEM_END_ADDR1_S  0

/** H264_DMA_OUT_ARB_CONFIG_REG register
 *  reserved
 */
#define H264_DMA_OUT_ARB_CONFIG_REG (DR_REG_H264_DMA_BASE + 0xb30)
/** H264_DMA_OUT_ARB_TIMEOUT_NUM : R/W; bitpos: [15:0]; default: 0;
 *  Set the max number of timeout count of arbiter
 */
#define H264_DMA_OUT_ARB_TIMEOUT_NUM    0x0000FFFFU
#define H264_DMA_OUT_ARB_TIMEOUT_NUM_M  (H264_DMA_OUT_ARB_TIMEOUT_NUM_V << H264_DMA_OUT_ARB_TIMEOUT_NUM_S)
#define H264_DMA_OUT_ARB_TIMEOUT_NUM_V  0x0000FFFFU
#define H264_DMA_OUT_ARB_TIMEOUT_NUM_S  0
/** H264_DMA_OUT_WEIGHT_EN : R/W; bitpos: [16]; default: 0;
 *  reserved
 */
#define H264_DMA_OUT_WEIGHT_EN    (BIT(16))
#define H264_DMA_OUT_WEIGHT_EN_M  (H264_DMA_OUT_WEIGHT_EN_V << H264_DMA_OUT_WEIGHT_EN_S)
#define H264_DMA_OUT_WEIGHT_EN_V  0x00000001U
#define H264_DMA_OUT_WEIGHT_EN_S  16

/** H264_DMA_IN_ARB_CONFIG_REG register
 *  reserved
 */
#define H264_DMA_IN_ARB_CONFIG_REG (DR_REG_H264_DMA_BASE + 0xb34)
/** H264_DMA_IN_ARB_TIMEOUT_NUM : R/W; bitpos: [15:0]; default: 0;
 *  Set the max number of timeout count of arbiter
 */
#define H264_DMA_IN_ARB_TIMEOUT_NUM    0x0000FFFFU
#define H264_DMA_IN_ARB_TIMEOUT_NUM_M  (H264_DMA_IN_ARB_TIMEOUT_NUM_V << H264_DMA_IN_ARB_TIMEOUT_NUM_S)
#define H264_DMA_IN_ARB_TIMEOUT_NUM_V  0x0000FFFFU
#define H264_DMA_IN_ARB_TIMEOUT_NUM_S  0
/** H264_DMA_IN_WEIGHT_EN : R/W; bitpos: [16]; default: 0;
 *  reserved
 */
#define H264_DMA_IN_WEIGHT_EN    (BIT(16))
#define H264_DMA_IN_WEIGHT_EN_M  (H264_DMA_IN_WEIGHT_EN_V << H264_DMA_IN_WEIGHT_EN_S)
#define H264_DMA_IN_WEIGHT_EN_V  0x00000001U
#define H264_DMA_IN_WEIGHT_EN_S  16

/** H264_DMA_DATE_REG register
 *  reserved
 */
#define H264_DMA_DATE_REG (DR_REG_H264_DMA_BASE + 0xb3c)
/** H264_DMA_DATE : R/W; bitpos: [31:0]; default: 539165699;
 *  register version.
 */
#define H264_DMA_DATE    0xFFFFFFFFU
#define H264_DMA_DATE_M  (H264_DMA_DATE_V << H264_DMA_DATE_S)
#define H264_DMA_DATE_V  0xFFFFFFFFU
#define H264_DMA_DATE_S  0

/** H264_DMA_COUNTER_RST_REG register
 *  counter reset register
 */
#define H264_DMA_COUNTER_RST_REG (DR_REG_H264_DMA_BASE + 0xb50)
/** H264_DMA_RX_CH0_EXTER_COUNTER_RST : R/W; bitpos: [0]; default: 0;
 *  Write 1 then write 0 to this bit to reset rx ch0 counter.
 */
#define H264_DMA_RX_CH0_EXTER_COUNTER_RST    (BIT(0))
#define H264_DMA_RX_CH0_EXTER_COUNTER_RST_M  (H264_DMA_RX_CH0_EXTER_COUNTER_RST_V << H264_DMA_RX_CH0_EXTER_COUNTER_RST_S)
#define H264_DMA_RX_CH0_EXTER_COUNTER_RST_V  0x00000001U
#define H264_DMA_RX_CH0_EXTER_COUNTER_RST_S  0
/** H264_DMA_RX_CH1_EXTER_COUNTER_RST : R/W; bitpos: [1]; default: 0;
 *  Write 1 then write 0 to this bit to reset rx ch1 counter.
 */
#define H264_DMA_RX_CH1_EXTER_COUNTER_RST    (BIT(1))
#define H264_DMA_RX_CH1_EXTER_COUNTER_RST_M  (H264_DMA_RX_CH1_EXTER_COUNTER_RST_V << H264_DMA_RX_CH1_EXTER_COUNTER_RST_S)
#define H264_DMA_RX_CH1_EXTER_COUNTER_RST_V  0x00000001U
#define H264_DMA_RX_CH1_EXTER_COUNTER_RST_S  1
/** H264_DMA_RX_CH2_INTER_COUNTER_RST : R/W; bitpos: [2]; default: 0;
 *  Write 1 then write 0 to this bit to reset rx ch2 counter.
 */
#define H264_DMA_RX_CH2_INTER_COUNTER_RST    (BIT(2))
#define H264_DMA_RX_CH2_INTER_COUNTER_RST_M  (H264_DMA_RX_CH2_INTER_COUNTER_RST_V << H264_DMA_RX_CH2_INTER_COUNTER_RST_S)
#define H264_DMA_RX_CH2_INTER_COUNTER_RST_V  0x00000001U
#define H264_DMA_RX_CH2_INTER_COUNTER_RST_S  2
/** H264_DMA_RX_CH5_INTER_COUNTER_RST : R/W; bitpos: [3]; default: 0;
 *  Write 1 then write 0 to this bit to reset rx ch5 counter.
 */
#define H264_DMA_RX_CH5_INTER_COUNTER_RST    (BIT(3))
#define H264_DMA_RX_CH5_INTER_COUNTER_RST_M  (H264_DMA_RX_CH5_INTER_COUNTER_RST_V << H264_DMA_RX_CH5_INTER_COUNTER_RST_S)
#define H264_DMA_RX_CH5_INTER_COUNTER_RST_V  0x00000001U
#define H264_DMA_RX_CH5_INTER_COUNTER_RST_S  3

/** H264_DMA_RX_CH0_COUNTER_REG register
 *  rx ch0 counter register
 */
#define H264_DMA_RX_CH0_COUNTER_REG (DR_REG_H264_DMA_BASE + 0xb54)
/** H264_DMA_RX_CH0_CNT : RO; bitpos: [22:0]; default: 0;
 *  rx ch0 counter register
 */
#define H264_DMA_RX_CH0_CNT    0x007FFFFFU
#define H264_DMA_RX_CH0_CNT_M  (H264_DMA_RX_CH0_CNT_V << H264_DMA_RX_CH0_CNT_S)
#define H264_DMA_RX_CH0_CNT_V  0x007FFFFFU
#define H264_DMA_RX_CH0_CNT_S  0

/** H264_DMA_RX_CH1_COUNTER_REG register
 *  rx ch1 counter register
 */
#define H264_DMA_RX_CH1_COUNTER_REG (DR_REG_H264_DMA_BASE + 0xb58)
/** H264_DMA_RX_CH1_CNT : RO; bitpos: [20:0]; default: 0;
 *  rx ch1 counter register
 */
#define H264_DMA_RX_CH1_CNT    0x001FFFFFU
#define H264_DMA_RX_CH1_CNT_M  (H264_DMA_RX_CH1_CNT_V << H264_DMA_RX_CH1_CNT_S)
#define H264_DMA_RX_CH1_CNT_V  0x001FFFFFU
#define H264_DMA_RX_CH1_CNT_S  0

/** H264_DMA_RX_CH2_COUNTER_REG register
 *  rx ch2 counter register
 */
#define H264_DMA_RX_CH2_COUNTER_REG (DR_REG_H264_DMA_BASE + 0xb5c)
/** H264_DMA_RX_CH2_CNT : RO; bitpos: [10:0]; default: 0;
 *  rx ch2 counter register
 */
#define H264_DMA_RX_CH2_CNT    0x000007FFU
#define H264_DMA_RX_CH2_CNT_M  (H264_DMA_RX_CH2_CNT_V << H264_DMA_RX_CH2_CNT_S)
#define H264_DMA_RX_CH2_CNT_V  0x000007FFU
#define H264_DMA_RX_CH2_CNT_S  0

/** H264_DMA_RX_CH5_COUNTER_REG register
 *  rx ch5 counter register
 */
#define H264_DMA_RX_CH5_COUNTER_REG (DR_REG_H264_DMA_BASE + 0xb60)
/** H264_DMA_RX_CH5_CNT : RO; bitpos: [16:0]; default: 0;
 *  rx ch5 counter register
 */
#define H264_DMA_RX_CH5_CNT    0x0001FFFFU
#define H264_DMA_RX_CH5_CNT_M  (H264_DMA_RX_CH5_CNT_V << H264_DMA_RX_CH5_CNT_S)
#define H264_DMA_RX_CH5_CNT_V  0x0001FFFFU
#define H264_DMA_RX_CH5_CNT_S  0

#ifdef __cplusplus
}
#endif
